{"valle de bravo": ["Just less than 20minute ride from Valle de Bravo you can find yourself walking along beautiful nature and discovering a nice waterfall.", " We went in a tour, well with a taxi actually. There are many down at the lake, docks, waiting for toursits and they will aproach you. We went to the oldest tree, 3 waterfalls and the top of the highest local peak to take pictures.", " On first arriving you think the waterfall that you can immediately see is the cascada. It is not, you can continue walking along the river to eventually get to the bigger casacade and it's lovely!", " So this was part of the Chu Chu train tour, very nice waterfall. Very accessible, too bad was raining a lot, but definitely it is a must see attraction!", " We loved coming to the waterfalls. It was so beautiful and peaceful. It's about a fifteen minute walk from the parking area to the falls.", " Lovely waterfall. Must see feature of the Valle area.", " As waterfalls go, this is a pretty one, with a couple of handicraft stands by it.", " One of the main attractions of Valle de Bravo is this waterfall, the area has been well organized, and the waterfall is very beautiful, not as tall as you may expect but very nice", " There is no charge to visit the waterfall.", " The waterfall of Velo de Novia is located in Avandaro, a town 5 KM from Valle de Bravo. The best day to see Avandaro is on a Monday when they have the &quot;tianguis&quot; (open air market) set up in the central plaza. Get to Avandaro early eat some pancita (menudo) from the tianguis, and head over to the waterfall. There is no charge to visit the waterfall. There are two smaller waterfalls, Rio de Molina and Refugio del salto, before getting into Avandaro; the first is visible from the road with several roadside restaurants, so you may be able to include those on the way back to Valle. Taking a collective taxi from Valle (central plaza) to Avandaro will cost you 15 MXN$ and from Avandaro to Velo de Novia 10 MXN$.", " It's a beautiful waterfall, nothing like Iguazu or Niagra, but worth seeing.", " This waterfalls are one of Valle de Bravo's main attractions and I would recomend a visit if you are in the area. Also, you might get tempted to go INTO the water, so bring apropiate clothes for it (there where no changing room I could see). Most visitors go to the main waterfall which is a good first stop, but you might want to continue walking further down, to a place refered to as &quot;the slide&quot; where you can slide off rocks, into the water."], "comitan": [" My family and I traveled to Chiapas, Mexico last year and visited 4 different cities in Chiapas including Comitan. We visited many beautiful waterfalls and had a handful of amazing experience but none like the 3 Tzimoleras. Hands down the 3 Tzimoleras was the best experience of our whole entire trip! Angel and his crew including Sarain, made this adventure unforgettable. We started the trip to the waterfall in a pickup truck which was an adventure all on its own. There were 11 in our group including 2 young children. I say experience because you get to stand so close to the front of the waterfall and feel its tremendous power and admire its amazing beauty. For those with more of an adventurous and brave spirit than me, you can take a 7 meter jump into the most beautiful blue lagoon you have ever seen close to the edge of the waterfall. If you are brave enough to go through with it (only one in our family was) you are rewarded with a walk to the edge of the waterfall. My cousin did it and said it was the most unbelievable experience and one he will never forget.", " My family and I traveled to Chiapas, Mexico last year and visited 4 different cities in Chiapas including Comitan. I say experience because you get to stand so close to the front of the waterfall and feel its tremendous power and admire its amazing beauty. For those with more of an adventurous and brave spirit than me, you can take a 7 meter jump into the most beautiful blue lagoon you have ever seen close to the edge of the waterfall. My cousin did it and said it was the most unbelievable experience and one he will never forget.", " We visited many beautiful waterfalls and had a handful of amazing experience but none like the 3 Tzimoleras. Hands down the 3 Tzimoleras was the best experience of our whole entire trip! We started the trip to the waterfall in a pickup truck which was an adventure all on its own. There were 11 in our group including 2 young children. Once there, we climbed down tons of stairs (with alot of help from Angel and his crew) to get to experience the most beautiful waterfalls you will ever see.", " The waterfalls are so beautiful, I was really moved by the beauty of nature\nAngel, you and your team are doing a great job!!!", " the 3 tzimoleras are virgins waterfalls, awesome view, you can swim and dive in some of them!!", " the 3 tzimoleras are virgins waterfalls, awesome view, you can swim and dive in some of them!! Angel and his crew were really kind", " Excellent trip in familly with our guide !! Thanks a lot for everything...\nEverything was perfect  : the waterfall, the campside, the cook and of course the guides.", " On board of a truck, we embarked on a journey that will stay in our hearts forever ! After a few kilometers we entered a private land where we began to walk down to the river. Bathing suits and shoes on, and ready to dive in the water !! We followed the three waterfalls (gorgeous views!) and jumped from a 7m one! The adventure continued and we went behind beautiful water curtains to discover a small cave where bats and birds come to cool down. We also took mud baths and admired the breath-taking view from the 45m waterfall at the end of the path.", " The lakes themselves are beautiful in colour and the views that are provided.", " We visited the lakes from Comitan. Unfortunately the day was not great, but the lake were beautiful anyway.", " We visited the lakes from Comitan. Apparently you can only swim in Montebello lake. So all in all we were happy to have an accommodation in Comitan and not in Tziscao.", " For 25MXP you enter to a forest surrounded of beautiful lakes. Main lakes in my opinion are 5 Lakes, Pojoj, Tziscao. At Pojoj you can take a trip to an small island in a logs balsa and swim and dive. I didn’t do it as part of a tour. We walked to Guatemalan border .", " Main lakes in my opinion are 5 Lakes, Pojoj, Tziscao. I didn’t do it as part of a tour. I rented a  driver an stay in rustic cabin inside park At Tziscao Lake.", " If you want to &quot;see&quot; the lakes - it is OK, but if you want to enjoy it - you better take your time with another multiple day tour...The day tour lasted 13hours.", " We had read about the Lagunas and it was part of our tour on the same day that we visited El Chiflon (which was great). We would have prepared less driving and spending more time at the waterfall.", " We had read about the Lagunas and it was part of our tour on the same day that we visited El Chiflon (which was great). If the sun is not shining, the colours of the lakes are not so special.", " The lakes are beautiful: each one is a different shade of green or blue. There are boats on some of the lakes; food and crafts at others.", " You can also do kayaking and visit some islands in the middle of lakes. Be careful of some tour agencies which have some partnership with some local restaurants and the drivers end up stopping at many places for food and you end up having no time to enjoy the lakes.", " The place is just next to Guatemala and around 3 hours drive from San Cristobal de las casas. The place has over 50 lakes and some of them are worth visiting.", " The place has over 50 lakes and some of them are worth visiting.", " Very cold day saw a couple of the lakes. Agree that they are not really spectacular.", " I took a path from Laguna pojoj to cinco lagunas. It was awesome, there was nobody there, just orchids and stunning views of different lakes. It is worth staying for a day.", " I did a tour of these lakes, but only really saw two out of the many that are there. All up, because I went on a tour, I could see some beautiful lakes but did not see the variety that I have read exists in this national park.", " I did a tour of these lakes, but only really saw two out of the many that are there. The tour was organized from San Cristobal de las Casas, but it would have been better for us to get a bus there and then the mini taxis that we saw on the road.", " Lovely and colorful lakes only a 45 minutes drive from Comitan. Note that there are two groups of lakes: the &quot;older&quot; lakes if you go straight after the park entrance (inclusive in the park entrance fee) and the &quot;new&quot; lakes at the right turn (for a separate fee good for all of them). There are also pony rides to special sites.", " Note that there are two groups of lakes: the &quot;older&quot; lakes if you go straight after the park entrance (inclusive in the park entrance fee) and the &quot;new&quot; lakes at the right turn (for a separate fee good for all of them).", "Quite nice lakes but probably stunning only a clear blue day.", "Lots a lakes and very pretty.", " A group of different lakes you can go check out rent a canoe or in my case ride your bike to all of them until you find the one you can swim in.", " There are more than 50 lakes in this area and only one is really the Montebello lake but all are usually named as Montebello lakes. I strongly recommend to go first to the area known as five lakes (cinco lagos), rent a kayak or enjoy a trip in a native boat and enjoy a superb swimming time in crystalline waters. Then you may go to the &quot;international lake&quot; when you will find an interesting open border between Mexico and Guatemala where you can buy souvenirs from Guatemala and even enter that country for some time without a passport. Finally you can visit the actual Montebello lake and some others.", " If you arrive by yourself to the entrance, is a good idea to hire a guide and arrange his rate in advance. For around US 25 he will guide you for about 4 - 5 hours to different lakes. I strongly recommend to go first to the area known as five lakes (cinco lagos), rent a kayak or enjoy a trip in a native boat and enjoy a superb swimming time in crystalline waters.", " There's no doubt about it that this is a nice place to visit with beautiful lake sceneries. However we only got to visit 3/4 lakes with just a 15 minute time limit visiting each one. This made me feel disappointed as I felt that we could've visited more lakes.", " However we only got to visit 3/4 lakes with just a 15 minute time limit visiting each one. This made me feel disappointed as I felt that we could've visited more lakes.", " We picked up one of the guides who told us about each of the lakes. One of them is really polluted, but the others are lovely.", " We picked up one of the guides who told us about each of the lakes.", " These lakes are really stunning and well worth a visit. The lakes are all really close together making it easy to visit a lot of them, which is worthwhile because they are all very different.", " These lakes are really stunning and well worth a visit. We hired a car and stayed for 2 nights in a wonderful little cabana right on the water at lake Tziscao. There are plenty of good places to swim and we also enjoyed a great walk rom the Bosque Azul car park through the forrest to some caves alongside a river; incredible scenery.", " This is all before arriving at the main waterfall itself and there are many more opportunities than to just see the waterfalls!", "Can be a nice day trip, San Cristobal ... Once you arrive, it is a nice walk to the waterfall  - No need for a guide ...", " The color of water is beautiful; 3 falls were you can take photos of amazing views, place have some altitude and the way is 1 km or more than half mile uphill with a path with many stairs, most under big trees to get to the amazing “ Velo de novia” is an amazing visit, we take right path. Restaurant food was good Chicken mlianesa and tostadas.. We swim on river.", " Many fotos show a calm river with turquoise colored water. There are paths on both sides of the river with stairs when necessary to get the highest waterfall, El Chiflón.", "This waterfall attraction is very beautiful.", " On a day long trip to the falls and Montebello lakes. The falls are clean, spotless, seemingly endless.", " We visited these waterfalls in December &amp; the experience itself was amazing; the waterfalls &amp; the places to swim are very worth it (or cost $30 MXN), but getting there was a nightmare because the highways we had to take (from San Cristobal de las Casas to Comitán &amp; from Comitán to Tzinup or something like that) were both being repaired, so it took us like 3 extra hours to get there than what we planned.", " We visited these waterfalls in December &amp; the experience itself was amazing; the waterfalls &amp; the places to swim are very worth it (or cost $30 MXN), but getting there was a nightmare because the highways we had to take (from San Cristobal de las Casas to Comitán &amp; from Comitán to Tzinup or something like that) were both being repaired, so it took us like 3 extra hours to get there than what we planned. Tip 1: zip line costs $150-$300 (MXN)\n\nTip 2: bring food &amp; stuff to drink. It's very cozy &amp; suitable for it.", " We visited these waterfalls in December &amp; the experience itself was amazing; the waterfalls &amp; the places to swim are very worth it (or cost $30 MXN), but getting there was a nightmare because the highways we had to take (from San Cristobal de las Casas to Comitán &amp; from Comitán to Tzinup or something like that) were both being repaired, so it took us like 3 extra hours to get there than what we planned. Apart from that, we had a very nice time walking towards the waterfall &quot;la Novia&quot;, swimming &amp; on the zip line. Tip 1: zip line costs $150-$300 (MXN)\n\nTip 2: bring food &amp; stuff to drink.", " We visited these waterfalls in December &amp; the experience itself was amazing; the waterfalls &amp; the places to swim are very worth it (or cost $30 MXN), but getting there was a nightmare because the highways we had to take (from San Cristobal de las Casas to Comitán &amp; from Comitán to Tzinup or something like that) were both being repaired, so it took us like 3 extra hours to get there than what we planned. Apart from that, we had a very nice time walking towards the waterfall &quot;la Novia&quot;, swimming &amp; on the zip line.", " The drive from Comitan to the waterfalls is 45 minutes nice scenery driving trough villages. Arriving at the waterfalls park your car and have a great walk and see the waterfalls.", " We visited in March with a tour from San Cristobal de las Casas and there was lots of water. There is a 1 km walk up to the second (and main) waterfall and you can bath and enjoy a canopy ride more at for kids and adults. We took the entrance on the left looking towards the waterfall and I believe the other one (on the right side) has slightly better views. Also the canopy on the right side one is close to the main waterfall although they told us it has a shorter flight (300m vs 450m)", " It's a fantastic waterfall. We visited in March with a tour from San Cristobal de las Casas and there was lots of water. We took the entrance on the left looking towards the waterfall and I believe the other one (on the right side) has slightly better views. Also the canopy on the right side one is close to the main waterfall although they told us it has a shorter flight (300m vs 450m)", "Spectacular scenery, a chain of waterfalls along a river with nice swimming &amp; picnic areas.", " One of the most beautiful waterfalls I've ever seen... It's so tall I had to shoot it as a panoramic to get the entire height of it in one picture. Plus it's a nice easy walk up to the bottom of the falls along the river. Definitely recommend checking it out while in Chiapas.", " Still both take you to the &quot;Velo de Novia&quot; waterfall wich is by far the most imprssive. Still, they told us there are very nice views from the &quot;Corona&quot; waterfall, but we didn't het there at the end. The restaurant has very good food and WiFi, which was a great thing since there was no 3G/4G connectiona and since we rented a carbwe needed Google Maps to tell us the way back.", " The Cascadas El Chiflon are simply amazing. Roads in Chiapas are not the best, so the trip from bigger cities such as Tuxtla or San Cristobal can be tiersome, but once you are there is completely worth it. The way up to the furthest waterfall is about 30-40 min, but there are several waterfalls that make the walk a nice one. There are two paths up, one will take you to the tallest zip line (there are two zip lines) and the other one takes you to the path for the &quot;Corona&quot; waterfall, the highest of all. Still both take you to the &quot;Velo de Novia&quot; waterfall wich is by far the most imprssive. Still, they told us there are very nice views from the &quot;Corona&quot; waterfall, but we didn't het there at the end. The restaurant has very good food and WiFi, which was a great thing since there was no 3G/4G connectiona and since we rented a carbwe needed Google Maps to tell us the way back.", " There are two paths up, one will take you to the tallest zip line (there are two zip lines) and the other one takes you to the path for the &quot;Corona&quot; waterfall, the highest of all. Still both take you to the &quot;Velo de Novia&quot; waterfall wich is by far the most imprssive.", " There is no words to describe how beautiful the waterfalls are and how colourful the water is. The waterfalls are worth your drive and time 100%. The water is crystal and there is so many spots where you can get amazing views and pics of the waterfalls, don't forget to bring your bathing suit and have an awesome swim in crystal waters.", " This is one of my favourite national parks in Mexico! The water is crystal and there is so many spots where you can get amazing views and pics of the waterfalls, don't forget to bring your bathing suit and have an awesome swim in crystal waters. I went with my girlfriend but this place is for everyone.", " We were on a tour (380 pesos for the entire day) from San Cristobal to the Montebello lakes and this was part of the tour. We hadn't heard of it before, which I think added to the experience. We were expecting a pretty waterfall, but nothing could prepare us for what we found at the end of the trail, absolutely beautiful!!", " We were on a tour (380 pesos for the entire day) from San Cristobal to the Montebello lakes and this was part of the tour.", "You can swim in the river after hiking to the different waterfalls.", " The last waterfall, Velo de Novia, is the most impressive, but the trail is pretty steep, all on stairs, but a tiring climb. The waterfall is huge and you can go to an observatory being right next to it!", " Every waterfall is different, I know. There are two properties on either side or the river, I visited the one called &quot;El Chiflon&quot; ecopark; it turned out to be the better choice for me since it goes all the way into the waterfall and most of the cool pic's you see are taken there.", " It really doesnt matter where in chiapas you are.... this waterfalls are well known... so just work out your schedule to arrive early and be there a good part of the day.... \n\nthere is many activities you can do here... from swimming to just admiring the waterfalls.....\nYOU MUST TAKE....\ngreat walking shoes, really comfortable please... you will walk walk and walk and walk and guess what!! its all uphill so be prepared.... \nswimming gear specially if your taking little ones\nand and extra sets of clothes because YOU WILL GET WET... \n\nok so we arrived early, and we were just there to walk the trail up to the last possible point... its a long walk but it is well worth it... it had been raining the past few days... so we were on our own... they told us to be extremely careful the dirt was loose and the waterfalls were extremely full and did not recommend us to walk up BUT HEY WE WERE THERE ALREADY..  there is a few waterfalls before arriving the the tallest one called &quot;velo de novia&quot;  well you can imagine the walk with all the loose ground because of the water but it was fun!!!", " its all uphill so be prepared.... \nswimming gear specially if your taking little ones\nand and extra sets of clothes because YOU WILL GET WET... \n\nok so we arrived early, and we were just there to walk the trail up to the last possible point... its a long walk but it is well worth it... it had been raining the past few days... so we were on our own... they told us to be extremely careful the dirt was loose and the waterfalls were extremely full and did not recommend us to walk up BUT HEY WE WERE THERE ALREADY..  there is a few waterfalls before arriving the the tallest one called &quot;velo de novia&quot;  well you can imagine the walk with all the loose ground because of the water but it was fun!!! at last we arrived to the highest point... there is a chance to do zip lining but the waterfall was so pack with water that the amount of water dispersed around it was really heavy... as if it was pouring a storm so the zip line was closed... \n\nanyways it was an awesome experience and will go again. by the time we got back people were arriving some were in the river enjoying their day.. others were in the restaurant which smelled great... did not try it..... some were going in to the cabins they have there... all in all, a very excellent place... \n\nNO CONS: from my visit I have nothing to complain..... everything was great the place does the job by itself its natural beauty, its amazing, its just great.... its great to appreciate creation and its beauty...", " its all uphill so be prepared.... \nswimming gear specially if your taking little ones\nand and extra sets of clothes because YOU WILL GET WET... \n\nok so we arrived early, and we were just there to walk the trail up to the last possible point... its a long walk but it is well worth it... it had been raining the past few days... so we were on our own... they told us to be extremely careful the dirt was loose and the waterfalls were extremely full and did not recommend us to walk up BUT HEY WE WERE THERE ALREADY..  there is a few waterfalls before arriving the the tallest one called &quot;velo de novia&quot;  well you can imagine the walk with all the loose ground because of the water but it was fun!!!", " If you are exploring Chiapas wonderful sites and have an extra day to relax and enjoy a beautiful waterfall do not miss this place, specially if you are planning the magnificent Montebello lakes. I recommend to rent a car but remember to rent an automatic one because Chiapas roads are really full of &quot;deadcops&quot;.", " I took the day trip to Cascada El Chiflon ,  when  arrive you should go upstairs (half hour)\nand you can see this huge waterfall. The trip also includes a visit at Lagos de Montebello after waterfall.", " I took the day trip to Cascada El Chiflon ,  when  arrive you should go upstairs (half hour)\nand you can see this huge waterfall. The trip also includes a visit at Lagos de Montebello after waterfall. Really recommended !!", "Waterfalls are the best, not a lot of people and you can swim if you want, stay hole day if you can, bring your own water and sandwiches", " It's a long trip, about 3 hours from San Cristobal to El Chilfón. I took this tour along with a visit to the Lagunas de Montebello. At El Chiflón, the waterfall is impressive, the sound is so beautiful that you will forget everything. I recommend bringing sunscreen, some water to drink but especially be eager to walk because the tour guides will tell you that there are 800 steps to go. I recommend going early to visit:  El Chiflón and the Lagunas de Montebello before 16:00 h. to admire the different shades of the water of the lakes.", " Not by much but I guess enough that most will miss this &quot;top ten&quot; waterfalls. Wonderfully constructed pathway along the river leading to the falls. Take a collectiva 1.5 hr to Comitan (55 MX). The OCC bus leaves to late in the day to make it a comfortable day trip. The best is to relocate to Comitan, if possible. Once in Comitan, cross the main street to get a collectiva that goes towards the falls NOT to the small village of Tzimol (25MX, 1 hr). There is a 30MX park entrance fee. It's a 1200 m lovely path with many steps to get to the top fall but there are smaller falls along the way. If we had been on the road too long and wanted to hang somewhere for a bit, this would have been the place to do it.", "The series of waterfalls are stunning for photos!"], "ciudad valles": [" If you are looking for a calm,relaxing and quiet day, this is it! If you are visiting the Huasteca Potosina don't miss this hotel, it is unique!", " If you are visiting the Huasteca Potosina don't miss this hotel, it is unique!", " We were staying at Hotel Aventura Huasteca and the guide from our rappelling tour recommend that we go and enjoy the temazcal at the resort that night. I loved it and the grounds of the resort look really nice.. the natural pool does look a little scummy though but it´s natural so what can you do.", " We were staying at Hotel Aventura Huasteca and the guide from our rappelling tour recommend that we go and enjoy the temazcal at the resort that night. We might consider staying there next time we go back though as they have rock climbing there. Try to avoid weekends and national holidays to visit there. The temazcal started at 7pm I think but arrive an hour early and they let you enjoy the pools.", " Taninul isn´t actually in Ciudad Valles, it´s about a 30 minute drive away. We were staying at Hotel Aventura Huasteca and the guide from our rappelling tour recommend that we go and enjoy the temazcal at the resort that night. For those of you that don´t know what that is it´s kinda like a mud-like igloo where they have sauna rocks inside with herbs and flowers in with the rocks. When you are in the igloo you give thanks to what you have, you apologize to the people and things you have hurt, you wish for anything and you ask forgiveness for your regrets all the while they add more rocks and make the hut hotter. The temazcal started at 7pm I think but arrive an hour early and they let you enjoy the pools.", " We went rafting with Huaxteca.com at the end of March on the Rio Tampaon. The guys picked us up in their van on time and even spoke enough English to get by. We got out on the water with minimal trouble and had a great guide to lead us down the river and through the rapids. It was challenging enough for us newbs but never really scary.", " We went rafting with Huaxteca.com at the end of March on the Rio Tampaon. We got out on the water with minimal trouble and had a great guide to lead us down the river and through the rapids. It was challenging enough for us newbs but never really scary. Plenty of relaxing parts in between the rapids and chances to swim as well.", " We wen't with our two guides Paco and Hazel two days to waterfalls to swim - it's so awesome! We had so much fun with them, we leaned some spanish and had a little party in the bus between the stops :-) But it wasn't only the swimming in waterfalls, we stopped also for typical Mexican food and for sugarcane juice - and the food in mexico...muy rico!", " We wen't with our two guides Paco and Hazel two days to waterfalls to swim - it's so awesome! The two leads us through the waterfalls, the streaming and we jumped several times from different heights - which we had to climb before. We had so much fun with them, we leaned some spanish and had a little party in the bus between the stops :-) But it wasn't only the swimming in waterfalls, we stopped also for typical Mexican food and for sugarcane juice - and the food in mexico...muy rico! They also told us something about the country and how the people live here.", " This was the waterfall tour of Minas Viejas, Salto and Micos. **LEAVE YOUR BELONGINGS IN THE VAN***\nI brought my hat, sunglasses and a bottle of water to the waterfall.", " He took time out to talk to me one on one and tell me about the waterfalls.", " This was the waterfall tour of Minas Viejas, Salto and Micos. We stopped at a large cat sanctuary on our way to the first waterfall. When I got out of the water they were gone.", " Our tour of the Edward James garden and Sotano de las Huahuas was so well informed and our guides were very consciousness about being eco friendly. Our tour to Puente de Dios and the Cascadas with Josue, Paco and Lorena was phenomenal! They were extremely attentive to everyone's safety and making sure that we had fun and enjoyed ourselves. Overall all of our guides were very personable and experienced.", " We had the most fun here of any of the places we visited in Huasteca! Like everything you seem to do in Huasteca you have to climb stairs. It was pouring rain for part of the time too.", " We had the most fun here of any of the places we visited in Huasteca! Sorry I don't know the cost, our guide took care of it for us. Like everything you seem to do in Huasteca you have to climb stairs. Its the tallest thing any of us ever jumped off of.", " Sorry I don't know the cost, our guide took care of it for us. Like everything you seem to do in Huasteca you have to climb stairs.", " The waterfalls are amazing. Jump them all!", "Located in the Huasteca Potosina-  absolutely beautiful and easy to get to.", " This place is one of the highlights of Huasteca Potosina. That being said I would look for Javier (tour company is the one in blue), he was an amazing guide and has been working there for 20 years. The site itself needs little advertisement, gorgeous landscape to do sequential jumping in different height cascades... truly fun and amazing", " Had a lovely couple of hours at the Micos waterfalls. We caught a Vencedor bus from Calle 5 de Mayo (half a block south of Jardin Hidalgo) in Ciudad Valles. Asked the lady for Micos and she charged us 21 pesos each. It dropped us at a 'look-out' a few kilometers past the town of Platanito. We had been told there were stairs down to the falls so after a few misdirections, we continued walking the way the same bus was driving for about a kilometer until we came to a hydroelectric building with a set of concrete stairs leading down. We didn't swim (was too cold!) We ended up walking back into Platanito and a colectivo taxi took us back to Centro Ciudad Valles for 25 pesos each but a local man said the Vencedor buses came back that way eventually. Please note we speak very very basic Spanish so all of this is relatively easy if you have the same or any more than we do! The falls were lovely and very quiet when we were there. Recommended.", " Had a lovely couple of hours at the Micos waterfalls. We had been told there were stairs down to the falls so after a few misdirections, we continued walking the way the same bus was driving for about a kilometer until we came to a hydroelectric building with a set of concrete stairs leading down.", "The place is amazing, jumping through seven waterfalls of different heights, the highest one of 9m.", " This place is nice, you can't do much other than swim and jump some waterfalls, definitely take a tour guide with you to experience the whole thing from the beginning of the waterfalls, to the end of them.", "it was so much fun, although scary at the beginning, to jump from the different waterfalls.", " The Cascadas (waterfalls) of Rio Micos are a wonderful attraction in the vicinity of Ciudad Valles, SLP, Mexico. If you travel with Huaxteca.com the guides are not only attentive, but very safety conscious. If you travel with your own group, Huaxteca.com offers &quot;private tours&quot;, say for 6-12-20 people, with guides and equipment and this would make the jumping so much more enjoyable and fast paced. It takes, depending on the group, from 45 minutes to 90 minutes to complete the circuit.", " The Cascadas (waterfalls) of Rio Micos are a wonderful attraction in the vicinity of Ciudad Valles, SLP, Mexico. While this spectacle would be enough, the fun part of the activity is to be able to jump from pool to pool from the waterfall´s edge. You need aqua-shoes or tennis shoes, as the rock is at times very slippery. The water temperature in december was 26/27 degrees celsius, so a bit colder than a swimming pool, but nothing you can not get used to quickly, specially when the sun is out at 11 AM or later.", " As we don't want to waste our day we booked our tours with another company ( huasteca.com) and we had two great and amazing days with these guides. So if you want to come to Huasteca Potosina (which is totally worth it) you should book with this company, because they are professionals!", " We wanted to book three or four tours with MS Expidiciones, because they are recommended in our travel guide. We tried to book in advance but it was nearly impossible, because nobody answered my questions properly. We decided to book the tour directly at the office, but only one tour was available. So we booked one and they promised us that we can do another tour on the next day. The tour was ok,but the guide was quite unmotivated and didn't speak to us the whole drive to the activity, during the lunch and the drive back. As we asked the guide about the next tour, he told us that he can't guarentee that there is a tour at the next day and we should come to the office and maybe there is one. As we don't want to waste our day we booked our tours with another company ( huasteca.com) and we had two great and amazing days with these guides.", " Activities ranged from Planet Earth experiences--seeing thousands of birds nosedive into the Cave of Swallows--to more extreme activities--rappelling next to a waterfall, jumping down waterfalls, etc. The staff at MS Xpediciones were what really made the difference, though.", " Somehow we almost always had the place--the waterfall, the river, the cave--to ourselves. Martha came out to dinner with us towards the end of the trip just to check how well it had gone and to receive our thanks.", " I was on a trip organized by Martha and MS Xpediciones in SLP in March. Activities ranged from Planet Earth experiences--seeing thousands of birds nosedive into the Cave of Swallows--to more extreme activities--rappelling next to a waterfall, jumping down waterfalls, etc.", " Activities ranged from Planet Earth experiences--seeing thousands of birds nosedive into the Cave of Swallows--to more extreme activities--rappelling next to a waterfall, jumping down waterfalls, etc. Somehow we almost always had the place--the waterfall, the river, the cave--to ourselves.", " From cascade jumping to whitewater rafting to waterfall repelling to cave swimming to mole consuming, these guys really set up and implemented a great trip. They helped with hotel accommodations as well, which all were great. I'd highly recommend using them for your visit to SLP!", " From cascade jumping to whitewater rafting to waterfall repelling to cave swimming to mole consuming, these guys really set up and implemented a great trip. I'd highly recommend using them for your visit to SLP!", " I am from Mexico, I have had the opportunity to travel my country and I can honestly say this agency is one of the best I have dealt with! I would recommend this agency 100% when planning to visit the beautiful Huasteca Potosina! They will help you with anything you need.", " I am from Mexico, I have had the opportunity to travel my country and I can honestly say this agency is one of the best I have dealt with! I took along with me 10 young people from the United States and all I can say is that we felt safe, happy, and well taken care of all the time thanks to MS Xpediciones. The service is amazing and the attention is unique. I would recommend this agency 100% when planning to visit the beautiful Huasteca Potosina!", " I took along with me 10 young people from the United States and all I can say is that we felt safe, happy, and well taken care of all the time thanks to MS Xpediciones. I would recommend this agency 100% when planning to visit the beautiful Huasteca Potosina!", " We were connected with MS Xpeditions through a neighbor shortly before leaving on an almost spur of the moment trip to the Huasteca in SLP. My husband had been in contact with Martha by phone and had only mentioned we'd be in the area for two nights. Martha arranged 3 tours for us: an afternoon canoe trip to the cascada de Tamul and the next day, a visit to Las Pozas in the morning and late afternoon/early evening at the Sótano de las Huahuas. The best part of all the tours was having capable drivers to shepherd us around the sites and navigate the twisted and narrow mountain roads. No worries about driving left us able to enjoy the routes as well as the destinations. We would use MS Xpeditions again.", " We were connected with MS Xpeditions through a neighbor shortly before leaving on an almost spur of the moment trip to the Huasteca in SLP. Martha arranged 3 tours for us: an afternoon canoe trip to the cascada de Tamul and the next day, a visit to Las Pozas in the morning and late afternoon/early evening at the Sótano de las Huahuas. Both days included lunch at local restaurants.", " We had the pleasure of meeting Martha from MS Xpedicions upon arrival in Ciudad Valles from Xilitla, who we found extremely warm, friendly and enthusiastic about showing us her surrounding areas in the Huastecas, a place she has a lot of knowledge about and a passion for! We had 2 fabulous days with her, she showed us some amazing geological sites, natural hot springs, took us to some of her little favourite spots even, including a little panaderia off the main rd towards Xilitla, the cinnamon cakes were so delicious. Martha certainly went out of her way to share  with us her paradise. On our 2nd day we set off again to see the Ceremonial de Tamaletom with the amazing spinning voladores, also spent some time in the village chatting to the locals and eating tasty local treats...This is a tour not to be missed!!! In the afternoon we shared the day with Martin, who drove us to see the cascades El Micos, El Minas Viejas y El Salto, chatting on the way about local lifestyle and affairs and having a laugh here and there. The beauty of Huasteca is nothing short of stunning and we will be returning very soon and will be doing our tours with MS Xpediciones again!!", " We had the pleasure of meeting Martha from MS Xpedicions upon arrival in Ciudad Valles from Xilitla, who we found extremely warm, friendly and enthusiastic about showing us her surrounding areas in the Huastecas, a place she has a lot of knowledge about and a passion for! We had 2 fabulous days with her, she showed us some amazing geological sites, natural hot springs, took us to some of her little favourite spots even, including a little panaderia off the main rd towards Xilitla, the cinnamon cakes were so delicious. On our 2nd day we set off again to see the Ceremonial de Tamaletom with the amazing spinning voladores, also spent some time in the village chatting to the locals and eating tasty local treats...This is a tour not to be missed!!! The beauty of Huasteca is nothing short of stunning and we will be returning very soon and will be doing our tours with MS Xpediciones again!!", " I forgot to pack my swimming clothes and river shoes but these can be bought at the various waterfalls or the market in Ciudad Valles fairly cheaply.", " I travelled alone to Ciudad Valles and so I was looking for a group of people to travel with and see the local sights. I read the reviews of a couple of companies on TA and went to both operators to find out what the tours included. Although the content of the tours are very similar I was impressed by the attitude of the staff in the office at MS Xpediciones. I speak some Spanish and although this is not essential it does help. One of the women in the office speaks good English and she told me that she is available to accompany non-Spanish speakers on tours if the guide does not speak English. I booked my first tour to cascada de Tamul, and after this booked two more tours with them to cascadas Minas Viejas on one day and Xilitla on the third day. I forgot to pack my swimming clothes and river shoes but these can be bought at the various waterfalls or the market in Ciudad Valles fairly cheaply. I kept going back to MS Xpediciones because of the friendliness of the guides and the good service. The make up of the groups is always hit and miss but I was lucky, or maybe it's just Mexican bonhomie, and had a great time talking to the other members of the groups, learning about Mexican culture and other places to visit.", " I travelled alone to Ciudad Valles and so I was looking for a group of people to travel with and see the local sights. I read the reviews of a couple of companies on TA and went to both operators to find out what the tours included. Although the content of the tours are very similar I was impressed by the attitude of the staff in the office at MS Xpediciones. I booked my first tour to cascada de Tamul, and after this booked two more tours with them to cascadas Minas Viejas on one day and Xilitla on the third day. I forgot to pack my swimming clothes and river shoes but these can be bought at the various waterfalls or the market in Ciudad Valles fairly cheaply. I kept going back to MS Xpediciones because of the friendliness of the guides and the good service.", "Son muy atentos ,amables y saben divertirse cuando valla a ala huasteca potosina con huasteca total la mejor opción de verdad aquí mi familia disfrutando 😍", " Gracias alos azules ( Huasteca Total ) por sus recorridos tan entretenidos y divertidos jaja con solo recordar vuelvo a vivir aquellos dias. --EN HORABUENA LOS RECOMIENDO--", "Ha sido una de la mejores experiencias de mi vida, con la mejor atención por parte del staff  sin duda volvería a visitar la Huasteca Potosína💫👍", " Muy padre experiencia, me gustó mucho la huasteca y el equipo de Huasteca Total se portó excelente todo el tiempo, estar en la naturaleza, la comida, los paisajes, los recorridos y todas las actividades fueron increíbles. Un viaje inolvidable, me divertí muchísimo, de los mejores viajes de mi vida.", "El trabajo en equipo del staff de huasteca total nos hizo cambiar nuestra forma de pensar pues estuvo padrísimo y conocer todos esos lugares y hacer rafting y el salto de cascadas que es ampliamente recomendable por que hasta pienso que te hace mejor persona... Tamúl impresionante, Minas viejas, Tamasopo todo estuvo genial.", "Para mi gusto se vive al maximo la adrenalina y el contacto con la naturaleza en la region huasteca con mis amigos de huasteca total  donde sus guias nos trataron siempre con una sonrisa y atentos a cada detalle,dudas y comida muy rica y sin duda dejan huella en mis vacaciones se los recomiendo", " I received an excellent treatment with my family on 4 Tours hire with Huasteca Viva ,Everything that was committed was fulfilled  \nExcellent Week and if I return to Cd Valles;  I will return with them \nI strongly recomend Huasteca Viva", " We drove down from Tamapsopo falls... should have stayed there another day as the water here at Mico was not nearly as clean. We arrived before several tour buses otherwise it would have been really crowded. The waterfalls were nice to look at but we did not feel comfortable getting in the water... also did not feel like doing the boat tour. Very limited choices on food... we also did not eat as we didn't feel like getting sick later (didn't trust the food).", " La Huasteca Potosina is for those that want to see the real Mexico and it's amazing natural beauty.", " La Huasteca Potosina is for those that want to see the real Mexico and it's amazing natural beauty. There are several waterfalls and rivers to see in the region all different.To get a better Idea what it's like go to youtube  to see more ok this beauty.", " Our extended family lives all over the Huasteca Potosina. The are small quaint villages, cultural festivals, plenty of eco-tourism activities, indian ruins, waterfalls, colonial churches amazing foods and a couple of locations listed in the book the 1000 places to visit before you die. For us the best times to visit is between October and Bebruary because the weather is milder.", " Our extended family lives all over the Huasteca Potosina. We have travelled there every year at least 2-3 times.", "If you like nature water activities, la Huasteca Potosina is the place for you a lot of activities and places to visit", " The Huasteca is enormous so need a few days to try to cover half of what is available to see and do. Plan in advance and if needed hire a guide. They tend to be expensive but you will be secure. Each location is an hour or more from Cuidad Valles.", " I webt with some friends and we did a rafting tour in the Tampaon river. It was awesome. We had a looooot of fun. We did the famous &quot;ruleta&quot; and we fell hahaha. But that fall makes us laugh and put us a huge smile everytime we remember. At the end of the tour, we had a huuuuge meal which was extremeley delicious!!!", " I webt with some friends and we did a rafting tour in the Tampaon river. It was awesome.", "we went in a rafting tour and its was perfect, great excercise and extremely beautiful views of the river and mountains.", " It's beyond words.. \n1)cascade de tamul - we went to see tamul  first.. we started from SLP at around 5:30.. we reached tamul at 9:30 with one coffee break.. we hired a boat at tanchachin.. as we were traveling in a group of 19 with young and adults.. we hired a whole boat for ourselves.. we started rafting at around 10:45. We reached to tamul waterfall at around 12:30 .. the experience was out of this world.. adventurous and funny too. 2)tamasopa: its on the way back from cascade de tamul to SLP.. in between. Tamasopa is like a village town, there are 4 spots to see at tamasopa.. we were able to cover two.. puente de dios and poza azul.", "Exciting waterfalls, rivers, lakes and wilderness.", " it is so extensive. we visited tamasopo and the puente de dios, lots of stairs but so worth it. also cascadas los micos, not too many stairs at all, we took a short boat ride to see the falls closer and feel the mist. very beautiful. we visited edward james castle and gardens in xilitla, got a tour guide on the grounds to tell us more about it. went to the cave of the swallows at dusk, the most stairs we have ever done, 585, but again, totally worth the trouble to see the birds in action. we missed seeing many more special spots in the huasteca, two days was not enough at all!", " we visited edward james castle and gardens in xilitla, got a tour guide on the grounds to tell us more about it. went to the cave of the swallows at dusk, the most stairs we have ever done, 585, but again, totally worth the trouble to see the birds in action. we missed seeing many more special spots in the huasteca, two days was not enough at all!", " we visited tamasopo and the puente de dios, lots of stairs but so worth it. we visited edward james castle and gardens in xilitla, got a tour guide on the grounds to tell us more about it. went to the cave of the swallows at dusk, the most stairs we have ever done, 585, but again, totally worth the trouble to see the birds in action.", " The Huasteca Potosina is the most beautiful place on Earth! I have never seen just crystal clear, turquoise water! I felt like I was swimming in a pool everywhere I swam.", " The Huasteca Potosina is the most beautiful place on Earth! If you're bored, Your'e doing it wrong!", " there are a lot od waterfalls, amazing, the waterfall of tamasopo, the tamul waterfall, with a very nice river where you can swim, the puente de dios location, Xilitla with the Castle of Edward james, with a lot of surrealistic sculputre surround with jungle and lots od different vegetation, spectacular", " Do not miss the opportunity to see the waterfalls of Tamasopo. A bit chilly in November to swim but the brave can handle it!", "With several options to visit that goes from caves, waterfalls, woods, swallows and many things to do, this is a must see place to all the persons that like nature and look for adventures.", " Here you can see the waterfall called Puente de Dios. You can also enjoy the cave of swallows and my favorite, very close to Xilitla, Sir Edward James Castle.", " People are cooking and eating inside the waterfall . Waterfalls are amazing but definitely not for tourism .", " Whether you are into waterfalls (there are 4), caves, birding, hot sulfer springs and orchids, this area has something to offer. By all means visit the Huasteca to truly see Mexico.", " We took the tours from Ruta Huasteca Expedicions, and spent 3 days visiting some of the most beautiful places I have been to. It has to be one of my best and favorite vacation in Mexico.", " And also went water rafting an the arrives torch the water falls just beautiful", " Huasteca is a region on the eastern part of the San Luis Potosi province. This is a beautifully natural area, with lots of trees, hills/mountains, natural springs, rivers, waterfalls and hiking/climbing. We drove on well paved roads most of the time, and traffic was very sane; no issues with driving. The places we visited that we recommend are \n\n- Cascades de Tamul; which is a waterfall that you have to paddle to from a small village called Morena, about 20-30 kms north of Aquisimon.", " The review by &quot;Queen J&quot; earlier was spot on; please refer to her review for all the places to visit. Huasteca is a region on the eastern part of the San Luis Potosi province. We drove east from San Luis Potosi via RioVerde to the Huasteca Potosina region. Here, for between 400 (shared) and 600 pesos (alone); the guide will take you in his canoe (4km) paddling to the magnificent water falls. ON the way back, there is a stop at a large cavern which is a natural swimming hole.. \n\n- Another good place we visited was the Sotano De las Golondrinas; or the cave of the swallows; and is on the outskirts of Aquisimon town. This is a huge cave 330m deep, and the top of the cave is open and about 50m wide. Very early morning (6:30-8:30AM), the swallows come out of the cave by the hundreds to forage for food for the day, returning in the evening. So you have to get here by 6:30AM, and be patient and quiet (swallows will not come out of they sense noise and hence danger threat). When the swallows come out, the fly our counterclockwise out of the cave slowly and then take off by the hundreds. You get there by driving very early in the morning (about 20 mins from Aquisimon), pay the 30 peso entrance fees, and hike down 560 steps to the top of the cave. - Xilitla is a noce picturesque town built on steep hillsides; similar to swiss towns.", " The waterfalls are worth the view, and you can jump/swim off a large boulder &quot;island&quot; near the foot of the falls.", " Edward James Surreal Gardens (castle, waterfall, and pools), located 15 min outside of the town of Xilitla. Parrot Cave-  Near Xilitla (5 min drive), past the Pemex station, is a huge cave that is visited at sunset by green parakeets (not to be confused with The Huge Cave, El Sótano, near Aquismón). By bus, Aquismón is about 1 hr north of Xilitla and 2 hrs south of Ciudad Valles. From Aquismón, buses are rare heading the 8km up to the cave opening. Entrance fee and hike down to the site are minimal. Go during high tourist season (Feb to May) to rappel or descend (via spiral staircase) into the cave and walk on the massive floor below. These rivers are all fresh, cold, bright aqua blue, and perfect for swimming in the hot, humid jungle. This one is located 30 minutes north of Xilitla in a tiny pueblo called Huichihuayán. It's about an hour north of Xilitla, just past the town of Aquismón. Just before the bridge (over the river), is a stone path that leads to the source, where the water cascades into a series of small pools. Missions - visit any of the first five missions established by Friar Junípero Serra - who later founded the California missions - south of Rio Verde, along the road to Jalpan, and Querétaro. Waterfalls- various waterfalls can be found near the towns of Rio Verde, Tamasopo, Ciudad Valles, and Xilitla. - The Tamasopo Falls is a 5 minute bus ride just outside the town. -The Puente de Dios cave and falls are a 10 min drive in the other direction outside of town. - The Temazcal Cascades are a 5 minute walk up the road from the parking lot of the Edward James Surreal Gardens. You can arrange a half day tour in Aquismón, and often at the river itself. It takes about two hours to paddle upstream to the waterfall. Hot springs - Hotel Taninul, famous for its hot springs, is a popular resort located 25 miles east of Ciudad Valles. Archaeological Zones - Tamuín:\nTamtok and El Consuelo display remnants of the Huastecan culture between the years 600-900, and are located just after the turn off to the Hotel Taninul, on the right. Caverns and caves - there are a variety of caverns throughout the Huasteca south and west of Ciudad Valles, 2 hrs south of Rio Verde (the Arroyo Seco area), and around Xilitla. La Media Luna - this &quot;Half Moon Lagoon&quot; is a small lake about 30 minutes outside of Rio Verde (which is two hours east of San Luis Potosí). Though it is small, it is ideal for swimming and scuba diving, due to warm (86°), extraordinarily crystal-clear, azure water that becomes profoundly deep once you venture past its shallow fingers. Authentic Huastecan towns:\n- Apezco - This is a small mountain village to the west of Xilitla with amazing  views, reached via a 1-2 hr hike up a steep, dirt road. - Tancanhuitz de Santos (Ciudad Santos) is located South of Cd Valles about 40 min north of Xilitla. Look for a turnoff to the right about 20 minutes after you pass through Huichihuayán. Typical Huastecan dress, handicrafts, and a church built on top of an ancient Huastecan pyramid can all be seen here. Market day in Santos is Sunday. - Huehuetlán - This is one of the prettiest towns in the area, located on a hilltop above a long, wide flight of stairs. Many trees, bright flowers, and vines make this town picturesque. A few miles ahead, on a gravel road is Aguacatitla, a main hub of medicinal herbal &quot;potions&quot;. There are at least 8 major waterfalls throughout the region, 4 or 5 main rivers, and endless cliffs, caves, and caverns to explore. Otherwise, I'd recommend reservations a few months ahead even when it means paying more. The cheapest and most plentiful lodging can be found in Ciudad Valles, but honestly, it's a pit of a town and the most humid of the entire area. And not in a good way. I'd recommend Tamosopo as a launching pad near the north and southwest activities, and either Aquismón - or the more expensive Xilitla - to be near the activities in the east. They are all very small, quaint towns, but you can still find adequate 2 and 3 star hotels with beautiful surroundings, adequate accommodations, restaurants (although I wouldn't eat in the hotel restaurants), hot water, and vending machines. Fly into the nearest major airport:\n- Fly into Mexico City and drive/bus to Xilitla or San Luis Potosí, roughly 7-8hrs. Fly into a smaller, closer, much more expensive airport:\n- the following airports are three times the cost and will NOT save time, as all routes to these airports are via another airport (usually Mexico City) and incur long layovers (6-12 hrs):\n- San Luis Potosí, Tampico, Querétaro, León/Bahía, or Aguascalientes. If you need more specific advice on bus transportation once you're within the region, read my July 2015 reviews on Hotel Cosmos near Tamasopo, Hotel d'Carmona in Ciudad Valles, Cascadas Tamasopo, Edward James Surreal Gardens (and las pozas), and Hotel Dolores in Xilitla. In short, do not let the traveler warnings deter you from visiting one of the most beautiful areas in Mexico (and there are SO many!) Just plan well and use  common sense.", " I'm still not sure to what exactly this attraction entry on TripAdvisor is supposed to refer...as the &quot;Huasteca Potosina&quot; is a large forest/jungle region throughout half the state of San Luís Potosí...  As such, here are my recommendations for touring the region:\n\nThe &quot;Huasteca&quot; stretches roughly between the  city of San Luis Potosí (NW), to just north of Ciudad Valles (NE), to below the town of Xilitla (SE), and the arroyos (SW), and everything in between.", " Tambaque River - Tambaque is another nacimiento swimming area located on the Tanute River. It's about an hour north of Xilitla, just past the town of Aquismón. 7. Waterfalls- various waterfalls can be found near the towns of Rio Verde, Tamasopo, Ciudad Valles, and Xilitla. - The Tamasopo Falls is a 5 minute bus ride just outside the town.", " I'm still not sure to what exactly this attraction entry on TripAdvisor is supposed to refer...as the &quot;Huasteca Potosina&quot; is a large forest/jungle region throughout half the state of San Luís Potosí...  As such, here are my recommendations for touring the region:\n\nThe &quot;Huasteca&quot; stretches roughly between the  city of San Luis Potosí (NW), to just north of Ciudad Valles (NE), to below the town of Xilitla (SE), and the arroyos (SW), and everything in between. For this reason, I'd recommend you plan on spending at least a week in this region, if possible. I always strongly recommend arranging everything yourself and using public transportation or a rented car to enjoy the luxury of arriving early to avoid the crowds (priceless), and the freedom of dictating your own schedule once there (equally valuable). As a single, blonde, female traveler, I had zero problems with safety in the region - not to imply that I don't need to be familiar with the area ahead of time (I study up), wary of my surroundings at all times, as inconspicuous as possible (for a white girl), or speak Spanish (my accent passes). I employ all of those skills when traveling, as should you. That said, I can often access areas that may prove tricky for travelers who do not speak any Spanish or are bogged down by pack mules loaded with touristy &quot;stuff&quot; or a pesky passel of kids. I found a ride half way, but had to walk uphill a few miles for a couple hours to get there.", " Edward James Surreal Gardens (castle, waterfall, and pools), located 15 min outside of the town of Xilitla. By bus, Aquismón is about 1 hr north of Xilitla and 2 hrs south of Ciudad Valles. Just before the bridge (over the river), is a stone path that leads to the source, where the water cascades into a series of small pools.", " I came to know Huasteca Postosina totally by chance. One of the most incredible places I have been to.", " Huasteca Potosina is not about one place. It is about visiting many places, from little towns which bring you in touch with the local ancient customs and traditions, to beautiful natural reserves. From SLP capital city, we began with Tamasopo falls, where we found nice hotels (specially clean). From there, we headed up to Micos fall, another great place to spend several hours of joy. Next day, we visited &quot;Sotano de las golondrinas&quot; (Cave of the Swallows), Rio Huichiuayan, and Pozas de Xilitla. For lunch or dinner, &quot;La Curva&quot; seafood restaurant was a great place to taste the &quot;acamayas&quot; (freshwater shrimp). Finally, we got a &quot;jobito&quot; bottle in Ciudad Valles, delicious jobito liqueur. Huasteca Potosina is a little vacation that could last from a two to five days with full of stuff to do every day.", " However, just hiking through the woods and seeing all the waterfalls was a cool enough experience on its own.", " Great experience: jumping in the waterfalls, enjoying the nature surrounding you and..viva la vida! Rafting is also possible in the nearby area.", "If you like the great outdoors, you cannot miss the Huasteca Potosina.", " I love it! I was born there and had to leave when I was 13 but have returned once or twice every year to re charge my batteries. The jungle, the waterfalls, the wonderful people, I love it all.", " We went on a river rafting in the HUASTECA , adults and children from the age of 9 , with the company HUASTECA ADVENTURE,they are very professional, maintain safety instructions, know how to work under pressure (we fell off the boat after a very stormy rapid ) , and especially thet have teamwork, it's reassuring and pleasant!!", " We went on a river rafting in the HUASTECA , adults and children from the age of 9 , with the company HUASTECA ADVENTURE,they are very professional, maintain safety instructions, know how to work under pressure (we fell off the boat after a very stormy rapid ) , and especially thet have teamwork, it's reassuring and pleasant!! the huasteca is full of extream activities and everything just beautiful !", " Huasteca Potosina is full of activities, nice people, beautiful waterfalls and river...\nYou can enjoy it alone or with your family. You just have to know that nothing is near neather well indicated... \nGo from november to march for a clear water color and be there for at least 3 days.", " We bought the three day &quot;adventure&quot; package with &quot;Ruta Huasteca&quot; that included the accommodation, entry to attractions and meals. We chose to stay in the &quot;Aldea&quot; that was a type of ecological village with very basic facilities but full of nature and a crystal clear water river. We had breakfast, dinner and sleep in the &quot;Aldea&quot;. The company picks you up from the Aldea in their own vans and take you to the different attractions, they feed you at the attractions and bring you back to the accommodation. On the first day we went to jump the waterfalls, swim and climb in Micos canyon. It was exciting and full of adventure and exercise. We will come back to do more rafting!", " They are very well equipped and have very good knowledge of every place they take you to. On the first day we went to jump the waterfalls, swim and climb in Micos canyon. We had great fun and enjoyed every moment.", " We bought the three day &quot;adventure&quot; package with &quot;Ruta Huasteca&quot; that included the accommodation, entry to attractions and meals. We chose to stay in the &quot;Aldea&quot; that was a type of ecological village with very basic facilities but full of nature and a crystal clear water river.", " We bought the three day &quot;adventure&quot; package with &quot;Ruta Huasteca&quot; that included the accommodation, entry to attractions and meals. We chose to stay in the &quot;Aldea&quot; that was a type of ecological village with very basic facilities but full of nature and a crystal clear water river. They are very well equipped and have very good knowledge of every place they take you to. On the first day we went to jump the waterfalls, swim and climb in Micos canyon. It was exciting and full of adventure and exercise. Instructors were very good, helpful and looked after all my group very well. We had great fun and enjoyed every moment. We will come back to do more rafting! On the third day we went to Minas Viejas to do abseiling. We were properly instructed on what to do and they equipped us very well and strapped us in the way that two other instructors were making sure we wouldn't fall into the cliff. It was a big achievement specially for me who is afraid of the highs. Definitely quite worthy and full of wonderful activities and safety.", " We bought the three day &quot;adventure&quot; package with &quot;Ruta Huasteca&quot; that included the accommodation, entry to attractions and meals. They made us feel very secure and encourage everyone of us to do the 50 m abseiling.", " I went with my family including my 14 and 7 year old children. On the second day we did rafting on Tampaon river.", " I loved all the waterfalls, they were all so beautiful, Cascada del Tamul was my favorite, better than Yosemite, and Yellowstone!!! Great tour guide Deider!", " We loved the scenery....the crystal rivers and waterfalls. The caves were amazing but be careful, they can be slippery.", " Puente Del Dios is a the watercourse that can be accessed via the city of Tamasopo in the state of San Luis Potosi in Mexico that has a natural beauty I haven't seen a comparable likeness of anywhere. Honestly there is so much to do in the entire region from Rioverde to Tamasopo to Xilitla and more but just for this review I am focusing on Puente Del Dios but for sure it should be part of a multi-day or even couple of week trip if possible. I hope to return in the future and stay and visit more of the waterfalls, caves and other attractions. All I can say is that it's beyond worth however it means to get there. I thought it was pretty interesting that in the most recent Lonely Planet guide it's not even mentioned. You could do it without a guide - it's very clearly marked - but the guide worked well for us.", " the Huasteca Potosina is a very beautifaul place, a lot of rivers, caves , waterfalls. do not expect many big hotels from the famous hotel chains, but yes : do expect, small, comfortable, some-times family run &quot;hotelitos&quot; and &quot;posadas &quot;,", " We decided to go to La Huasteca for 3 days, our program was : 1 day in Micos, 1 day in Tamasopo and last day in Xilitla. To sleep : We hadn't booked any hotel and found one called ... for about 390 pesos. To eat : We had diner and breakfast in the restaurant just next to the hotel. Things to do : we started by going to Puente de dios which is less crowded in the morning. Then we went to Tamasopo cascades, very nice place with lots of place to swim but quite crowded during WE !", " We traveled to Tamosopo San Luis Potosi last week and visited Puente De Dios. The waterfalls and cascades are so awesome and the water is Sooooo crystal clear. We really enjoyed seeing all the beautiful scenery on our way down the many stairs.", " We traveled to Tamosopo San Luis Potosi last week and visited Puente De Dios. The waterfalls and cascades are so awesome and the water is Sooooo crystal clear.", " We walked up river through woodland with constant views of the river and rapids before arriving at La puente de Dios, a powerful waterfall where my son and I dived in (Jorge provided us with life jackets) and using ropes laid out across the current we could half swim half pull our way across to a smaller waterfall and climb under it, we swam through a cave/rock bridge with clear bluish water where we could see fish before reluctantly climbing out to rejoin my wife who was happy just to watch and enjoy the beauty of the place. My wife and I chose to stroll and enjoy thar area, whilst my 13 year old son along with local kids could swing from a rope hanging from a tree and drop or dive or somesault into the deep pool below the fall....which kept him happy for at least an hour. We paid about 90 euros for the three of us...it was like a private tour as nobody else had booked that day.", " From Ciudad Valles we took a tour with Jorge Castillo, a really nice man who drove us safely in his big car past sugar cane fields, stopping to talk to and photograph a farmer ploughing the fields with an oxen drawn plough. We made a delightful stop at the cascaditas before moving up river to  the Playita de amor and Paso Ancho area. We walked up river through woodland with constant views of the river and rapids before arriving at La puente de Dios, a powerful waterfall where my son and I dived in (Jorge provided us with life jackets) and using ropes laid out across the current we could half swim half pull our way across to a smaller waterfall and climb under it, we swam through a cave/rock bridge with clear bluish water where we could see fish before reluctantly climbing out to rejoin my wife who was happy just to watch and enjoy the beauty of the place. Later with our life jackets we could float back down the river to the start point, where we continued onto the biggest waterfall of all: Tamasopo. We paid about 90 euros for the three of us...it was like a private tour as nobody else had booked that day. In fact we saw little tourism in the area in spite of the natural beauty. We were going to go on another tour (there were many choices and Jorge was willing to customize the tour for us) the next day to another waterfall and to the Sótano de las Golondrinas (cave of the swallows), but the weather turned bad and we moved south.", " From Ciudad Valles we took a tour with Jorge Castillo, a really nice man who drove us safely in his big car past sugar cane fields, stopping to talk to and photograph a farmer ploughing the fields with an oxen drawn plough. We made a delightful stop at the cascaditas before moving up river to  the Playita de amor and Paso Ancho area. We walked up river through woodland with constant views of the river and rapids before arriving at La puente de Dios, a powerful waterfall where my son and I dived in (Jorge provided us with life jackets) and using ropes laid out across the current we could half swim half pull our way across to a smaller waterfall and climb under it, we swam through a cave/rock bridge with clear bluish water where we could see fish before reluctantly climbing out to rejoin my wife who was happy just to watch and enjoy the beauty of the place. Splendid scenery, exuberant vegetation and places to eat. We were going to go on another tour (there were many choices and Jorge was willing to customize the tour for us) the next day to another waterfall and to the Sótano de las Golondrinas (cave of the swallows), but the weather turned bad and we moved south.", " We walked up river through woodland with constant views of the river and rapids before arriving at La puente de Dios, a powerful waterfall where my son and I dived in (Jorge provided us with life jackets) and using ropes laid out across the current we could half swim half pull our way across to a smaller waterfall and climb under it, we swam through a cave/rock bridge with clear bluish water where we could see fish before reluctantly climbing out to rejoin my wife who was happy just to watch and enjoy the beauty of the place. Later with our life jackets we could float back down the river to the start point, where we continued onto the biggest waterfall of all: Tamasopo.", " We walked up river through woodland with constant views of the river and rapids before arriving at La puente de Dios, a powerful waterfall where my son and I dived in (Jorge provided us with life jackets) and using ropes laid out across the current we could half swim half pull our way across to a smaller waterfall and climb under it, we swam through a cave/rock bridge with clear bluish water where we could see fish before reluctantly climbing out to rejoin my wife who was happy just to watch and enjoy the beauty of the place.", " We walked up river through woodland with constant views of the river and rapids before arriving at La puente de Dios, a powerful waterfall where my son and I dived in (Jorge provided us with life jackets) and using ropes laid out across the current we could half swim half pull our way across to a smaller waterfall and climb under it, we swam through a cave/rock bridge with clear bluish water where we could see fish before reluctantly climbing out to rejoin my wife who was happy just to watch and enjoy the beauty of the place. We were going to go on another tour (there were many choices and Jorge was willing to customize the tour for us) the next day to another waterfall and to the Sótano de las Golondrinas (cave of the swallows), but the weather turned bad and we moved south.", " We walked up river through woodland with constant views of the river and rapids before arriving at La puente de Dios, a powerful waterfall where my son and I dived in (Jorge provided us with life jackets) and using ropes laid out across the current we could half swim half pull our way across to a smaller waterfall and climb under it, we swam through a cave/rock bridge with clear bluish water where we could see fish before reluctantly climbing out to rejoin my wife who was happy just to watch and enjoy the beauty of the place. My wife and I chose to stroll and enjoy thar area, whilst my 13 year old son along with local kids could swing from a rope hanging from a tree and drop or dive or somesault into the deep pool below the fall....which kept him happy for at least an hour.", " San Luis Potosí capital is mostly a semi arid  area. La Huasteca has so many rivers and the food is incomparable. Valles the main door to la Huasteca.", " We trusted Ruta Huasteca with our tour in México coming from USA, and we enjoyed every bit of the trip. They are so much fun!! These guides made sure we had an amazing time!!! Will definitely book with them again!!", " The most fun guides, adventurous, caring, and helpful! We trusted Ruta Huasteca with our tour in México coming from USA, and we enjoyed every bit of the trip. These guides made sure we had an amazing time!!!", " We trusted Ruta Huasteca with our tour in México coming from USA, and we enjoyed every bit of the trip. Specially Brenda, Sari, Abi, Lobo, Octa, Tio, and Mike!", " But the highlight of all seven days was the rafting on the Tampeon River, which is not part of the ecotour package but since there weren't enough people to go on the tour I had arranged, Ruta Huasteca upgraded me to the rafting - A gift from heaven I will always cherish.", " I went on a trip there a while ago--and have been meaning to review (over a year). I went with a Yoga group, it was over 20 people I believe. When I went rafting, the guys that accompanied us on the trip, made it a point to kayak to the end of the river to pick up any trash that had accumulated. Aside from that, I would recommend 100% as the guides, planning, and activities were awesome--you always feel safe as the staff is always prepared.", " I went on a trip there a while ago--and have been meaning to review (over a year). When I went rafting, the guys that accompanied us on the trip, made it a point to kayak to the end of the river to pick up any trash that had accumulated.", " We just got back from our trip with Ruta Huasteca to tamapon river for a rafting tour. It was really amazing and we had a lot of fun.", " You are taken to a small town near Tamul waterfall and have an instruction there, then the rafting starts and there are multiple currents to go through in a beautiful scenery.", " We just got back from our trip with Ruta Huasteca to tamapon river for a rafting tour. For English speaking guides ask for Martin, Octavio, Azul or Chaak. You are taken to a small town near Tamul waterfall and have an instruction there, then the rafting starts and there are multiple currents to go through in a beautiful scenery.", " We just got back from our trip with Ruta Huasteca to tamapon river for a rafting tour. It was really amazing and we had a lot of fun. The guides made sure we are safe and comfortable in every situation.", " If you're visiting the huasteca potosina you can enjoy it with these guys.", " When we got to Huasteca we realized we had to change all of our plans because of the water levels so we couldn’t go swimming on the waterfalls, so we decided to go on a rafting trip on the Micos waterfalls and it was amazing!", " When we got to Huasteca we realized we had to change all of our plans because of the water levels so we couldn’t go swimming on the waterfalls, so we decided to go on a rafting trip on the Micos waterfalls and it was amazing! The guides, drivers and staff in the Aldea were really fun and super helpful, gave us a bunch of advices of things to do in Huasteca, also were a lot of fun, safe and really great experience, the landscape is beautiful! Thanks to Miguel, Sonia, Celeste, Chino, Marcos and Efrain, everyone was really nice!", " We had three tours with the Ruta Huasteca Team and every one of them was great! The first tour was Visiting the Surrealistic Garden and Rappeling in the jungle, the second one was Rafting and the last one Climbing in a cave and visiting Huahas. Every tour was very well organized and the Team was great! Even if you don't speak Spanish it's no problem because the Team is firm in English.", " We had three tours with the Ruta Huasteca Team and every one of them was great! Very friendly, helpful, focused and funny. We had a great time with you guys and we can recommend the tours to everyone in this area!", " We had three tours with the Ruta Huasteca Team and every one of them was great! We had a great time with you guys and we can recommend the tours to everyone in this area!", " I would definitely recommend Ruta Huasteca Expediciones for any of your planned adventures! The pay is simple (paypal) the tours are on time , food is delicious but most of all you get your money's worth everytime!", " We did a fantastic three-day tour with Ruta Huasteca, visiting the spectacular surrealist garden in Xilitla, as well as some brilliant waterfalls around Huasteca. I'm not normally one to do group tours but for me this was totally worth it as we got to visit loads of places with no hassle at all, the food included is great, everything was very well organised, and altogether it was just a really fun few days.", " We did a fantastic three-day tour with Ruta Huasteca, visiting the spectacular surrealist garden in Xilitla, as well as some brilliant waterfalls around Huasteca. The guides (shoutout to Octavio and Paco!) La Huasteca Posotisina is a fantastic place to explore, really beautiful, with impossibly blue waters. Highly recommend staying at La Aldea Huasteca too, as it's so nice to be by the river in the jungle both before and after the day excursions.", "Great experience, excelent tour guides, best service, garantid to enjoy the scenes and adventures at La Huasteca!!!", " The trip was a day full of fun and the guides were great and entertaining. The guides didn't speak a ton of English, but it was more than enough to guide us through the river for a lot of fun.", " Our trip was definitely one of the best I have taken so far (and I have travelled quite a bit), they have the nicest and professional crew members I have ever met! If I have the chance to come back to the beautiful Huasteca Potosina I would definitely do it with Ruta Huasteca every time!!", " For the commodity of travelling in an unknown area, Ruta Huasteca is just perfect. I stayed at an airbnb but I realized that it would have been a much better option to have stayed at one of their locations for about the sameness price I paid for the airbnb.", " I did the rafting tour from Xilitla and it may have taken an hour and a half to get to the river but it was totally worth it. Just so you know I've done 3 rafting tours in Ecuador, Costa Rica, and Jalcomulco before and I must say doing rafting in Huasteca Potosina is so far incomparable. Beginners should have no problem. As for the tour agency, they are professional and always make sure we're safe. Shout out to Elena (from Chile) and Big Mike for looking out for us. Highly recommended.", " I did the rafting tour from Xilitla and it may have taken an hour and a half to get to the river but it was totally worth it.", " I did the rafting tour from Xilitla and it may have taken an hour and a half to get to the river but it was totally worth it. Just so you know I've done 3 rafting tours in Ecuador, Costa Rica, and Jalcomulco before and I must say doing rafting in Huasteca Potosina is so far incomparable. I will definitely return one day to do other tours on offer", " I did the rafting tour from Xilitla and it may have taken an hour and a half to get to the river but it was totally worth it. For miles along the river there are no houses, only trees, animals, and pure nature.", " OMG last year i visited La Huasteca Potosina and toke the Ruta Huasteca tours, i finished in Love with the activities and with all the staff, this time was even better I toke 2 different tours than last year and I repeat one from last year and wow\n\nif you like adrenaline, adventure, nature, you like the water, yo must take their tours\n\nIVAN is a such funny guy, \n\nNeto Vallarta always paying attention and taking care of all participants, he save my go pro camera to go away in the river current, \n \nMario as also very helpful\n\nBorrego knows what he is doing, but need to have more interaction with the clients \n\nOrco was very good in the tour and planned very good the visit to la cueva the agua and the water fall so we did not have many other people around, we enjoy the different spots and views \n\nMIke once again the best in the rafting, when I saw Mike in my hotel lobby as one of my tour guys immediately i feel save, very professional all the time and very very funny, we have the best time doing raffting with Mike\n\nall the staff at the Ruta Huasteca office was very helpful and friendly \n\nspecial thanks to Laura Cardona for all her time and information \n\nRUTA HUASTECA 10 from 10", " We booked a Rafting Tour with Ruta Huasteca. They immediately took me to the hospital, made sure that everything was clarified with the insurance, brought my husband  and me a little snack and accepted without any hassle our cancellation of the next two days. We got full refund of our money.", " We booked a Rafting Tour with Ruta Huasteca. They immediately took me to the hospital, made sure that everything was clarified with the insurance, brought my husband  and me a little snack and accepted without any hassle our cancellation of the next two days.", " I went to Ciudad Valles last week and had an awesome experience. The landscape is breathtaking and the activities we did woith ruta Huasteca were extremely fun. everyone was really nice to us, specially Borre, Vico, and Paco they even gave us a snack :)  I totally recommend it.", " The landscape is breathtaking and the activities we did woith ruta Huasteca were extremely fun. everyone was really nice to us, specially Borre, Vico, and Paco they even gave us a snack :)  I totally recommend it.", " I went to Ciudad Valles last week and had an awesome experience. The landscape is breathtaking and the activities we did woith ruta Huasteca were extremely fun. I felt safe all the time, the crew explains every single detail of the activity, the equipment, everything; they tookcare of the whole group in each stage which makes things easier and way more fun. everyone was really nice to us, specially Borre, Vico, and Paco they even gave us a snack :)  I totally recommend it.", " I went with them rafting, it was awsone. I felt comfortable, safe and the most important i has fun. I should go here yo do everythin", " We stayed at La Aldea Huasteca, a little too expensive for the type of room they offer. (Shared washroom, no A/C, just a bed and a fan) Enjoy.", " Every guide on every activity we did (which was 3) was great and went out of their way to make sure we all felt comfortable. I was with 2 of my cousins who do not know how to swim and neither one of them at any point felt that it was not safe. We can not wait to go back and definitely continue to use Ruta Huasteca as our guides.", " We did 3 days custom private tour and it was awesome! Totally we were 9 people and everyone was happy with all the activities. Surprisingly one of our guides had Russian name - Ivan (Ivan, everyone says Hi to you and looks forward to meet you again). We were met at Tampico airport with a sign in Russian language and after that I understood, that those guys are awesome and they are willing to go extra mile for their customers. In Huasteca we did rafting, rappelling, we were jumping from waterfall cascades and it was scary. Nevertheless Ivan inspired us not to give up and all 9 people jump down form 8-meter high waterfall. Also we visited Cave of swallows and Edward James garden.", " We were met at Tampico airport with a sign in Russian language and after that I understood, that those guys are awesome and they are willing to go extra mile for their customers. In Huasteca we did rafting, rappelling, we were jumping from waterfall cascades and it was scary. Accommodation they have found for us, security measures, food, transportation, guides, recommendation of the restaurants in Ciudad Valley, everything was great! One of our friends had a birthday and a nice surprise with huge cake was organised, thank you guys, it was so much fun for us:)))\nKeep in touch,\nFebruary 2019 we meet again,\nWarmest regards from cold Russia,\nAlex and party\nIn Russian: Друзья, если вы собрались в Уастеку, то долго не раздумывайте.", " I have even &quot;stolen&quot; some Spanish songs which were played in the van (music is also cool while you spend your time with Ruta Huasteca) and listen to them from time to time.", " In Huasteca we did rafting, rappelling, we were jumping from waterfall cascades and it was scary.", " Finally I have some time (I broke my leg playing football yesterday and now I have plenty of time) to post a review. I'm very grateful to Laura, who has answered tons of my emails and organised everything! We were met at Tampico airport with a sign in Russian language and after that I understood, that those guys are awesome and they are willing to go extra mile for their customers. I have even &quot;stolen&quot; some Spanish songs which were played in the van (music is also cool while you spend your time with Ruta Huasteca) and listen to them from time to time.", " We were met at Tampico airport with a sign in Russian language and after that I understood, that those guys are awesome and they are willing to go extra mile for their customers. In Huasteca we did rafting, rappelling, we were jumping from waterfall cascades and it was scary. Accommodation they have found for us, security measures, food, transportation, guides, recommendation of the restaurants in Ciudad Valley, everything was great! I have even &quot;stolen&quot; some Spanish songs which were played in the van (music is also cool while you spend your time with Ruta Huasteca) and listen to them from time to time. One of our friends had a birthday and a nice surprise with huge cake was organised, thank you guys, it was so much fun for us:)))\nKeep in touch,\nFebruary 2019 we meet again,\nWarmest regards from cold Russia,\nAlex and party\nIn Russian: Друзья, если вы собрались в Уастеку, то долго не раздумывайте.", " Huaxteca is very organized and no time is wasted! I strongly recommend using them for your visit to Huasteca!", " Small groups make for pleasant stops! I strongly recommend using them for your visit to Huasteca!", " I had a great experience with Ruta Huasteca. I landed in Mexico City and headed straight to Ciudad Valles by bus. If you choose this company and go on excursions, you will find that they are much better organized than the other ecotour companies that you'll encounter.", " I had a great experience with Ruta Huasteca. I landed in Mexico City and headed straight to Ciudad Valles by bus. I had reserved my 4 day package about a month in advance.", " The complete staff, guides, drivers, office, chefs, are amazing, helpful, professionals, Yessica from Public Relations is one of the best person I ever met, always helping with all my questions and requests. The guides Celeste and Aguita OMG what energy, Villalobos, Bernardo and Sari give you all the confidence you need to execute the activities, (rapel and Jumping from waterfalls, Mike Miky ( auxilio, socorro) super fun and professional, I never feel nerveous or insecure doing the rafting, thanks Stefania for your instruction for rafting, I had the most wonderful experience. the rivers, the waterfalls, the lakes, the colors of the water, the view , the food, the hotel, everything is amazing, I will be back as soon as possible and i will bring with me all my family and friends.", " The guides Celeste and Aguita OMG what energy, Villalobos, Bernardo and Sari give you all the confidence you need to execute the activities, (rapel and Jumping from waterfalls, Mike Miky ( auxilio, socorro) super fun and professional, I never feel nerveous or insecure doing the rafting, thanks Stefania for your instruction for rafting, I had the most wonderful experience.", " The guides Celeste and Aguita OMG what energy, Villalobos, Bernardo and Sari give you all the confidence you need to execute the activities, (rapel and Jumping from waterfalls, Mike Miky ( auxilio, socorro) super fun and professional, I never feel nerveous or insecure doing the rafting, thanks Stefania for your instruction for rafting, I had the most wonderful experience. you guys at ruta Huasteca receive a big hug, all the best for you , see you soon\n\nArmando J Martinez", " we had a 3 day experience with the most amazing team ever, first day we went rappelling with Agüita, Ivan, and Bernie, on the second day we went to the TAMUL waterfall with Chavarin, and on the third day we went Rafting with Leon, I gotta say that every day had it's own charm but the rafting was amazing!", " we had a 3 day experience with the most amazing team ever, first day we went rappelling with Agüita, Ivan, and Bernie, on the second day we went to the TAMUL waterfall with Chavarin, and on the third day we went Rafting with Leon, I gotta say that every day had it's own charm but the rafting was amazing! and despite we flipped over twice, we would do it over and over again!", " After arriving back in Mexico-City, I realised my passport was still in their office in Ciudad Valles. Through a lot of effort from the Ruta Huasteca office, the passport did arrive in Mexico City on sunday morning, for which I want to thank them again.", " We joined a rafting tour last August on the Micos river, which was amazing! After arriving at the Micos river, we were given our safety equipment and an extensive instruction after which we hopped onto the boats.", " After arriving back in Mexico-City, I realised my passport was still in their office in Ciudad Valles. Since it was a saturday, it was actually not that easy to send it by mail. Through a lot of effort from the Ruta Huasteca office, the passport did arrive in Mexico City on sunday morning, for which I want to thank them again.", " We joined a rafting tour last August on the Micos river, which was amazing! The rafting itself is challenging, but it never felt unsafe. Since it was a saturday, it was actually not that easy to send it by mail. Through a lot of effort from the Ruta Huasteca office, the passport did arrive in Mexico City on sunday morning, for which I want to thank them again.", " After arriving back in Mexico-City, I realised my passport was still in their office in Ciudad Valles. Through a lot of effort from the Ruta Huasteca office, the passport did arrive in Mexico City on sunday morning, for which I want to thank them again. All in all: great experience and I would definitely recommend it.", " My cousin and I went with Ruta Huasteca to do the Rappel and Rafting. They were super easy to work with and answeree every question. The staff was Awesome we had Borre, Ivan, Berny and other people (dont remember their names) they were all super helpful, informed us of every task and measure they go to ensure our safety and knew english which waa super helpful.", " My cousin and I went with Ruta Huasteca to do the Rappel and Rafting. I look forward to coming back and trying the rest of the expeditions.", " My cousin and I went with Ruta Huasteca to do the Rappel and Rafting. The staff was Awesome we had Borre, Ivan, Berny and other people (dont remember their names) they were all super helpful, informed us of every task and measure they go to ensure our safety and knew english which waa super helpful.", " They sucked. We ended going with HuastecaROL with Perla cause they (Ruta Huasteca) left us with no choice.", " We ended going with HuastecaROL with Perla cause they (Ruta Huasteca) left us with no choice.", " Great day with Ruta Huasteca! Cristian Moreno - Hulk - and his colleagues guided us through the English Palace in Xilitla and the &quot;sótano de las huahuas&quot;.", " We enjoyed doing the rafting trip with them, all was very well organised. Picking up from our hotel on time, good briefing for the rafting, good material. We had a very good local lunch at the end with plenty of food.", " We enjoyed doing the rafting trip with them, all was very well organised. Picking up from our hotel on time, good briefing for the rafting, good material.", " I went with my wife last week, we took 3 tours: Cascades/Rappel, Rafting &amp; ecotourism(Xilitla/ Zotano Huahuas). I have compared and I can say Ruta Huasteca are defenitly the best. Is like all included, you don't worry about get transport or find good food. I strongly recommend visit Huasteca with Ruta Huasteca for people of every country.", " I went with my wife last week, we took 3 tours: Cascades/Rappel, Rafting &amp; ecotourism(Xilitla/ Zotano Huahuas). We took an extra day with another agency, only to try something different and to visit a place that Ruta Huasteca doesn't... we regret a lot!... I have compared and I can say Ruta Huasteca are defenitly the best. they make the tours unique, reall they are awesome. We stayed at the &quot;Aldea Huasteca&quot;, and it is an awesome experience. Rustic cabins, you are in touch with nature, but still have accommodations. Is like all included, you don't worry about get transport or find good food. I recommend you to stay there. You can go with friends, couple or by your self.. anyways you will met new people with your same interests, make new friends. We was thinking to met the Huasteca by ourselves or with another agency to save some money, but we definitely take the best decision. We can't visit Tamul because the weather, but it still was a great travel. I strongly recommend visit Huasteca with Ruta Huasteca for people of every country.", " We took an extra day with another agency, only to try something different and to visit a place that Ruta Huasteca doesn't... we regret a lot!... We stayed at the &quot;Aldea Huasteca&quot;, and it is an awesome experience. We was thinking to met the Huasteca by ourselves or with another agency to save some money, but we definitely take the best decision. We can't visit Tamul because the weather, but it still was a great travel.", " they make the tours unique, reall they are awesome. We stayed at the &quot;Aldea Huasteca&quot;, and it is an awesome experience.", " The Tampaon river, where you can do rafting is so beautiful and the rafting is far from boring! The best part of Ruta Huesteca is the Staff crew!!! I would recommand to stay at the Aldea Camping own by Ruta Mexico, the place is really beautiful, well equiped (big and warm showers) and the food is good!", " We went rafting with Ruta huasteca. We had a lot fun and the guides were so friendly and professional especially Samuel!!", " The place is beautiful and we had so much fun doing rafting and canyoning. Don't miss the surealist garden of Xilitla ;)!!!", " The team is really kind and professional. The place is beautiful and we had so much fun doing rafting and canyoning.", " We spent five days on the adventure tour and I can honestly say it was one of the best vacations of my life. Not only were the guides super knowledgeable about the area, they were committed to supporting local communities, making sure you felt safe and comfortable and just in general wanted to make sure that you were having a great time. We really thought that not only were they prepared form a safety standpoint, but their passion about the area and their job really translated to us. There was so much attention to small details (from\nThe fresh flowers and linens at lung in the middle of the forest after rafting to the reference of us all as one family). I know there are a lot of other companies offering tours in the same region, but Ruta Huasteca Expeditions is so much more than just a tour company and they deserve every peso we spent.", " We spent five days on the adventure tour and I can honestly say it was one of the best vacations of my life. I know there are a lot of other companies offering tours in the same region, but Ruta Huasteca Expeditions is so much more than just a tour company and they deserve every peso we spent.", " There was so much attention to small details (from\nThe fresh flowers and linens at lung in the middle of the forest after rafting to the reference of us all as one family). I know there are a lot of other companies offering tours in the same region, but Ruta Huasteca Expeditions is so much more than just a tour company and they deserve every peso we spent.", " We have been rafting  with Rita huasteca expeditiones during our tour if Mexico and it was perfect ! After the 11 rapids the good was included in the price and we've eaten with the whole team at a very good tacos !", " We have been rafting  with Rita huasteca expeditiones during our tour if Mexico and it was perfect ! Ps: they all speak very well English and they are funny ;)", " We have been rafting  with Rita huasteca expeditiones during our tour if Mexico and it was perfect ! The whole crew was very professional and a directly understood that a could trust them when we'd be on the raft. After the 11 rapids the good was included in the price and we've eaten with the whole team at a very good tacos ! We definitely recommend you to follow them there it was very good and tasty !", " We went rafting with Ruta Huasteca and had an awesome time the guys and girls of the team are very friendly and fun to hang out with. I would do a tour with them again if I ever get back in Ciudad Valles!", " The Huasteca, is a beautiful area, with lots of waterfalls, and turquoise rivers, the color is amazing, and you cannot see that anywhere else, to know the place well, I recommend you to hire ecotouristic expeditions like this company offers, they really know the zone really well and help you during the expeditions, beside is one of the best ones in the area.", " Valles until our departure , they were always worried about us , besides having very good activities , if you need tours English , they are the best, look after you from the beginning to the end, excellent food, in fact ; it is as if the adventure have done it with your best friends , plus see the most beautiful of the Huasteca , we have beautiful pictures and great memories in our minds...", " I traveled with my best friend, since our first contact all treated us really well , supported us at all times, since our arrival in Cd . Valles until our departure , they were always worried about us , besides having very good activities , if you need tours English , they are the best, look after you from the beginning to the end, excellent food, in fact ; it is as if the adventure have done it with your best friends , plus see the most beautiful of the Huasteca , we have beautiful pictures and great memories in our minds... 100% Recommended", " I traveled with my best friend, since our first contact all treated us really well , supported us at all times, since our arrival in Cd . Valles until our departure , they were always worried about us , besides having very good activities , if you need tours English , they are the best, look after you from the beginning to the end, excellent food, in fact ; it is as if the adventure have done it with your best friends , plus see the most beautiful of the Huasteca , we have beautiful pictures and great memories in our minds...", " I visited the Huasteca region several times with Ruta and always enjoyed it 120%! I completely recommend traveling with those guys!", " I visited the Huasteca region several times with Ruta and always enjoyed it 120%!", " I can say that Ruta Huasteca was one of the best vacations in my life! I  absolutely would go again!", "I enjoyed fully all the rafting tour due to beatiful river and nature, professional guides, security in all moment", " I love to show off the beauties of my country and thanks to Ruta Huasteca I was able to visit spots that I would probably would have missed by my self! We especially loved Chicù our daily/constant guide!!", " I love to show off the beauties of my country and thanks to Ruta Huasteca I was able to visit spots that I would probably would have missed by my self!", " They take you to the best places of the Huasteca, the staff was responsive with us and kind, but the best the offer is that they took us to the table of natives of the huasteca to eat local food.", " you must do rafting rappel and waterfall jumping. and the boyos are really comfortable.", " La huasteca is a paradise, and having the chance of visiting it with the guidence and protection of profesionals from Ruta Huasteca made it better!", " We were a party of 9 and went river rafting with the Ruta Huasteca's team. The rafting experience was amazing, the team of Rutas Huasteca gives the extra mile on everything.", " We were a party of 9 and went river rafting with the Ruta Huasteca's team. The rafting experience was amazing, the team of Rutas Huasteca gives the extra mile on everything. Laura Cardona, Xcharly, Pato, JJ, Juanito and Andres our bus driver were part of the staff that made our experience to be just perfect.", " We were a party of 9 and went river rafting with the Ruta Huasteca's team. We received the best professional service from all the staff at all times. Laura Cardona, Xcharly, Pato, JJ, Juanito and Andres our bus driver were part of the staff that made our experience to be just perfect."], "san carlos": [], "colima": [" We went with Francisco of Tlaloc Tours and had a great time. He made sure to point out the &quot;sleeping woman&quot; in the mountains as we were driving there. Once we arrived at el Salto, we all, including Francisco got changed into our bathing suits. The water is fed by the same source as the waterfall so it is clean and cool, not full of chemicals. When we were finished playing we went for the short walk to the waterfall. We walked down the stairs to the bottom and Francisco helped us across to a rocky area where we could post for pictures or play go into the water to play in the waterfall. There is a small creek the waterfall empties into that you can play in as well. I could not figure out why Francisco got changed, but he comes into the water with you to make sure you are safe. When we were done playing in the waterfall, we went back up and had a yummy lunch that was waiting for us. Some people relaxed and dried off while others went back into the waterpark until it was time to leave."], "palenque": [" I suggest to spend there at least 3 hours.... Each level of waterfalls is different and beautiful, so take your time. If you want to do this as a part of a tour with the ruins, u can.", " I suggest to spend there at least 3 hours.... Each level of waterfalls is different and beautiful, so take your time. U will love it.", " We visited after spending the morning at the Palenque Ruins, so it was great to come somewhere cool and enjoy the natural beauty of the cascades. The water was lovely and cool on this hot day and we were able to navigate this waterfall by climbing down it, sliding down it in places and swimming in the pools. The waterfall wasn't very crowded even though it was Sunday (but it was election day in Mexico).", " You walk through the \njungle and don’t stop being surprised by the (at least) 5 different waterfalls you find.", " You walk through the \njungle and don’t stop being surprised by the (at least) 5 different waterfalls you find. A must if you are in Palenque!", " These waterfalls are frequented mostly by locals, and they are spectacular.", " There is a small restaurant outside of the waterfalls were they have some meals and drinks. The waterfalls are beautiful and very refreshing to swim in.", " We took a collectivo from near the market in Palenque to Roberto Barrios (50 pesos per person one way). We had heard good things about the waterfalls and that they are less touristy than Agua Azul. When we asked at the desk where you pay to get in we were informed that the village has stopped the children doing this now. The guy who took our entry fee offered to show us around instead and he took us through the waterfalls, told us where to jump, and we slid down the waterfall on a 2L plastic bottle (although this was fun we both cut ourselves, as the rock is quite sharp as it goes into the water).", " The guy who took our entry fee offered to show us around instead and he took us through the waterfalls, told us where to jump, and we slid down the waterfall on a 2L plastic bottle (although this was fun we both cut ourselves, as the rock is quite sharp as it goes into the water). He &quot;suggested&quot; we should pay him 200 pesos (for two people), which we did in the end as he spent a few hours guiding us.", " We took a collectivo from near the market in Palenque to Roberto Barrios (50 pesos per person one way). The guy who took our entry fee offered to show us around instead and he took us through the waterfalls, told us where to jump, and we slid down the waterfall on a 2L plastic bottle (although this was fun we both cut ourselves, as the rock is quite sharp as it goes into the water).", " The guy who took our entry fee offered to show us around instead and he took us through the waterfalls, told us where to jump, and we slid down the waterfall on a 2L plastic bottle (although this was fun we both cut ourselves, as the rock is quite sharp as it goes into the water). He &quot;suggested&quot; we should pay him 200 pesos (for two people), which we did in the end as he spent a few hours guiding us. Although it wasn't as we expected it was an amazing experience.", " We took a collectivo from near the market in Palenque to Roberto Barrios (50 pesos per person one way). We had heard good things about the waterfalls and that they are less touristy than Agua Azul. Reading previous reviews we thought that it would be easy to find one of the local children to guide us on the waterfalls and show us where is safe to jump in, however we couldn't find any children. When we asked at the desk where you pay to get in we were informed that the village has stopped the children doing this now. The guy who took our entry fee offered to show us around instead and he took us through the waterfalls, told us where to jump, and we slid down the waterfall on a 2L plastic bottle (although this was fun we both cut ourselves, as the rock is quite sharp as it goes into the water).", " The guy who took our entry fee offered to show us around instead and he took us through the waterfalls, told us where to jump, and we slid down the waterfall on a 2L plastic bottle (although this was fun we both cut ourselves, as the rock is quite sharp as it goes into the water).", " We had heard good things about the waterfalls and that they are less touristy than Agua Azul. Reading previous reviews we thought that it would be easy to find one of the local children to guide us on the waterfalls and show us where is safe to jump in, however we couldn't find any children. The guy who took our entry fee offered to show us around instead and he took us through the waterfalls, told us where to jump, and we slid down the waterfall on a 2L plastic bottle (although this was fun we both cut ourselves, as the rock is quite sharp as it goes into the water). Although it wasn't as we expected it was an amazing experience.", " While we were enjoying the first of the falls a local offered us a guided tour down the falls. We were quickly off on a adventure- sliding, jumping and swimming our way down the falls. There were even caves to stop and explore under the falls. Another local carried all of our gear to where we got out of the falls, he even took one of our phones and took pictures and videos of us along the way.", " We ended  up here after our guide at Palenque suggested the side trip. It was one of our favorite days of our trip! We had already been to Agua Azul, and enjoyed walking the falls and swimming in the pools where allowed. We were expecting about the same, but we're pleasantly surprised to get so much more!! While we were enjoying the first of the falls a local offered us a guided tour down the falls. We were quickly off on a adventure- sliding, jumping and swimming our way down the falls. Another local carried all of our gear to where we got out of the falls, he even took one of our phones and took pictures and videos of us along the way. IIt is great for all ages (including my 70+ parents!). The only warning is there isn't really a place to change or restrooms available, so come ready to swim!!", " The most well known waterfalls near Palenque are Agua Azol and Misol Ha. If you want a rather different experience, try Cascada de Roberto Barrio. About 45 minutes from town on a winding mountain road, it is set in natural jungle and is pretty much undeveloped. It is worth it for a tranquil swim in natural surroundings.", " The place is lovely very rustic but waterfalls are amazing ! I wish I could have spent longer there", " The place is simple. The place is lovely very rustic but waterfalls are amazing !", " Great to do it the Chiapas way with local children taking you to jump off the rocks amongst the waterfalls .. they are really professional and cautious! Trust them!", " These waterfalls were beautiful! My friends and I had such a great time!", " These waterfalls were beautiful! The waterfalls are not huge from a height perspective, but certainly from a width and length perspective, i.e. there were numerous falls, working their way down-river.", " This is my kind of place! We had a rented car so we drove (about an hour from Palenque). My husband, kids, and I love to swim in rivers and waterfalls so this place was perfect for us. Five levels of falls, perfect water temperture (we went the end of December), tucked away in the beautiful jungle, not too many tourists, a few locals  selling fruit and empanadas if you get hungry... we could only spend a few hours here but easily could have spent the whole day. We happily paid a local kid/ guide 100 pesos ($5) --which he was  REALLY happy with--to guide us and show us the caves, where it was safe to walk, slide, jump....  (shout to Leandro even though I don't think he will ever read this!)", " This is my kind of place! We had a rented car so we drove (about an hour from Palenque). My husband, kids, and I love to swim in rivers and waterfalls so this place was perfect for us. We happily paid a local kid/ guide 100 pesos ($5) --which he was  REALLY happy with--to guide us and show us the caves, where it was safe to walk, slide, jump....  (shout to Leandro even though I don't think he will ever read this!) I saw some people wearing life vests--I wasn't paying too much attention but was under the impression they were provided for those who needed them. It looked like some people came just to look at the falls-- I didn't see them swimming. That would be tortue for me! Not sure I would bother coming here if not to swim. If you read my other reviewss you will see I am stingy with my stars, but this place easily earns  five stars as far as I am concerned!", " I would recommend these falls because of the atmospehere, the blue water and several waterfalls. Some are more excessible than others so i would first look at them all and then decide where to get in.", " This was one of my best experiences in Mexico - its almost 4 levels of waterfalls that you can jump off, swim behind and explore - and at the bottom waterfall you slide down on a flattened 2 litre bottle - bonkers but amazing\n\nDont worry if you cant jump from high heights either every waterfall has a walking option down so you dont have to jump. I would recommend having a guide as some waterfalls can be VERY slippy and you will need to know where you can and cant jump but this is a MUST see experience!", " The waterfalls themselves are fabulous just to see them and take photos even if you don’t plan to swim there.", " We decided on Robert Barrios over Agua Azul after recommended by our guide Edgar at the ruins who told us it had rained too much and Agua Azul would be muddy. We ended up going to with the tour company right outside the bus station and because there was another operator there they bid against each other and we paid $450 (for 3 of us) with them and bought our tickets for Yaxchilan and Bonampak with the operator inside for $750. The falls are everywhere - the water is everywhere. Our guide had us make about 5-6 stops over the course of 3-4 hours. The first place we slid down a waterfall on plastic bottles he provided into a giant body of water. We also hiked up waterfalls, jumped off more, swam under them to hidden caves and jumped off trees and cliffs into the water. There was only enough time for one of us to experience it as it was towards the end so make sure to ask about it if that interests you. We only saw about 5 other people the whole time. It was really nice to feel like it was just us and the jungle.", " We stayed an extra day to see some of the waterfalls in the Palenque area when going to the ruins. Aguas Azules and other places offered similar experiences, but what makes Cascada de Roberto Barrios stand out is you can jump down the waterfalls to enjoy them as well as walk down the sides. We paid 50 pesos each for a colectivo from downtown Palenque and then 20 pesos to get in. This area is still not as well known as the others, so we had a good time without lots of other tourists. When you get there, guides (we ended up tipping each guide 100 pesos) to take us to the safe jumping spots to reach the awesome natural waterslide at the end. We had rain and cloudiness throughout the time, but the water was warm enough and refreshing that it didn't feel cold or uncomfortable.", " We stayed an extra day to see some of the waterfalls in the Palenque area when going to the ruins. Aguas Azules and other places offered similar experiences, but what makes Cascada de Roberto Barrios stand out is you can jump down the waterfalls to enjoy them as well as walk down the sides. If you go quickly, it takes about an hour to jump down through the falls, but you can spend time swimming in larger calm waters and hanging out in caves under the waterfalls.", " We stayed an extra day to see some of the waterfalls in the Palenque area when going to the ruins. It was definitely worth it!", " We were very much looking forward to Agua Azul but our tour guide at Palenque Edgar told us to do Roberto Barrios instead as the rain would make Agua Azul muddy and we would probably be disappointed as it wouldn't be blue. We went with the booth in front of the Ado bus station and the one inside to book Yaxchilan and Bonampak. Our guide showed us an area between the streams to set our stuff down and invited us out to a large waterfall where he gave us large plastic bottles to sit on and hold between our legs while sliding down the waterfall.", " We were very much looking forward to Agua Azul but our tour guide at Palenque Edgar told us to do Roberto Barrios instead as the rain would make Agua Azul muddy and we would probably be disappointed as it wouldn't be blue. What a unique experience! We had toyed with the idea of renting a car and doing it on our own but because we went through a tour company, we were guided the entire way. If you bargain with the guys they generally will give you a good price. We went with the booth in front of the Ado bus station and the one inside to book Yaxchilan and Bonampak. Our guide showed us an area between the streams to set our stuff down and invited us out to a large waterfall where he gave us large plastic bottles to sit on and hold between our legs while sliding down the waterfall. We spent some time in various in little areas with him showing us a cavern beneath a waterfall, a larger cliff to jump off and an underwater cave towards the end only one member on our tour got to see which was towards the end - of that interests you, ask about it in the beginning so there's enough time. We really enjoyed ourselves and I'd return to play in a heartbeat.", " We were very much looking forward to Agua Azul but our tour guide at Palenque Edgar told us to do Roberto Barrios instead as the rain would make Agua Azul muddy and we would probably be disappointed as it wouldn't be blue. Our guide showed us an area between the streams to set our stuff down and invited us out to a large waterfall where he gave us large plastic bottles to sit on and hold between our legs while sliding down the waterfall. We spent some time in various in little areas with him showing us a cavern beneath a waterfall, a larger cliff to jump off and an underwater cave towards the end only one member on our tour got to see which was towards the end - of that interests you, ask about it in the beginning so there's enough time.", " And we jumped off again into the pool again to find another waterfall.", " Eventually we followed him and it was the best decision we did! He told us where to walk down the waterfall (as it can be quite slippy) and where it was safe to jump off. We did this and jumped into the pool below where we found another waterfall! And we jumped off again into the pool again to find another waterfall. We were shown an underwater cave. At the very last waterfall we were asked if we wanted to sit on something plastic and slide down the waterfall! Low and behold, the local brought out 5 squashed 5L water bottles for us to sit on! We couldn't stop laughing! We slid down and boy did it hurt! But it was so much fun!", " What a great time swimming the pools and riding the waterfalls.", " We had such an awesome time st the waterfalls - they are huge and there are different options to go swim. Most of the time we were just by ourselves - a must do when you stay in Palenque!!", " We hired some of the young guys who would swim with us across the waterholes then show us the best and safest places to jump from the top of the waterfalls to the waterhole below.", " A great excision to these lesser known waterfalls. We hired some of the young guys who would swim with us across the waterholes then show us the best and safest places to jump from the top of the waterfalls to the waterhole below. A thrilling day negotiating the waterfalls.", " Once you get there you'll be followed by a young boy who will show you the waterfalls. There are 5 or 6 and it's good to have him show you as you might miss some. The waterfalls were awesome to swim around, very powerful in parts but rope helps you to not get carried downstream!", " Once you get there you'll be followed by a young boy who will show you the waterfalls. The waterfalls were awesome to swim around, very powerful in parts but rope helps you to not get carried downstream!", " The waterfalls aren't huge but they river is pretty wide.", " you can jump off, slide and even walk down some of these waterfalls. The locals here are super nice and will show you around the waterfalls.", " Then we parked car on a small street and went down to the river. After ten minutes walk we arrived in front of the river and small but clear trail leaded as down to waterfalls.", " Google maps is wrong about the location of these awesome waterfalls. They are about 30 mi s from Palenque and simply incredible. Swimming in the pools is exhilarating.", "Beautiful waterfalls full of water.", " A young local guide joined us to walk us through the waterfalls, showing where it was safe to jump and slide (on plastic bottles:)).", " We didn't visit the other waterfalls, but I had heard they can get crowded.", " You basically drive into this very small village, walk into the woods a bit, and come upon these beautiful cascading waterfalls. It was very pretty and great to swim in them, you can even do a few jumps and go in some small caves.", " After having a BBQ with a nearby family we went swimming in the Roberto Barios-waterfalls. It was an amazing experience with clear water and some good jumps to do.", " My family of four (two elementary aged kids) had a great time at this waterfall. We drove there (decent signage on the road) and showed where to park. While driving there, the road was empty and we were wondering if this had been a good idea. There were several other cars and collectivos in the parking lot, so we felt good. We paid 10 pesos per person (kids were not free) and the parking attendant also charged us 10 pesos to park. However, we think this is because he didn't want to give us change. He didn't charge the people next to us for parking. Two 18-ish year olds walked us to the waterfall and gave us a guide of the area. Other guides were walking their groups through the waterfall (yes, in the water and showing them a safe path to go). We didn't do this because of our young kids. We'd highly recommend this falls.", " My family of four (two elementary aged kids) had a great time at this waterfall. We drove there (decent signage on the road) and showed where to park. Two 18-ish year olds walked us to the waterfall and gave us a guide of the area. Other guides were walking their groups through the waterfall (yes, in the water and showing them a safe path to go).", " Other guides were walking their groups through the waterfall (yes, in the water and showing them a safe path to go).", " A small kid Luis Miguel was our guide and showed us the 4 waterfalls, he was very good taking us pictures.", " The waterfalls are next to a small community were you have to pay a small fee to visit, however, the people use it to build stairs and huts next to the river and enjoy the place.", " The waterfalls are next to a small community were you have to pay a small fee to visit, however, the people use it to build stairs and huts next to the river and enjoy the place. A small kid Luis Miguel was our guide and showed us the 4 waterfalls, he was very good taking us pictures.", " So\nCheck it out    Waterfalls and pollos los Carnales in cascadas roberto barrioss. U have to\nCheck it out", " It was so refreshing and a lot of fun to trek down the six waterfalls and swim in the crystal clear water. A local boy also showed us the caves underneath the waterfalls and the easiest way to trek down them.", " This place was amazing! It was so refreshing and a lot of fun to trek down the six waterfalls and swim in the crystal clear water.", " these are waterfalls with a particular beauty. they are a little hidden from what we usually know about touristic places, but it totally worth a visit.", " I just recomend to be careful and not to feel so confident even when you are a great swimer. when you arrive here, local people try to reach you to help you to carry your things and show you the way, they will spect some tip, i recommend to take this service and give them $30 or $50. to access the waterfalls you have to pay $50 per person, i'm not so sure, i can't remember the exactly ammount, but i remember it is really cheap and beautiful there. to get there, i recommend you to stay at palenque, there are no hotels or anything in  the waterfalls, some people do camping but it is dangerous, so please, avoid it.", " You keep straight on the road and at the km 14 you will find a deviation to your right to the waterfalls. once you are there, keep on the road and you will find the signs to the waterfalls or you can ask to the local people.", " You can choose to enjoy 1 of the 6 waterfalls locations or swim in all of them if you have enough time.", " to access the waterfalls you have to pay $50 per person, i'm not so sure, i can't remember the exactly ammount, but i remember it is really cheap and beautiful there. to get there, i recommend you to stay at palenque, there are no hotels or anything in  the waterfalls, some people do camping but it is dangerous, so please, avoid it.", " Our family decided to visit this site since we were in the area. Our two young guides were very thorough in showing us all the different waterfalls to be seen and they were so polite and friendly we really enjoyed their company on the trails. The waterfalls were magnificent and the water was such an amazing color is made for some really picturesque scenes. We also heard a cacophony of howler monkeys in the nearby trees!", " Our two young guides were very thorough in showing us all the different waterfalls to be seen and they were so polite and friendly we really enjoyed their company on the trails. The waterfalls were magnificent and the water was such an amazing color is made for some really picturesque scenes.", " Our two young guides were very thorough in showing us all the different waterfalls to be seen and they were so polite and friendly we really enjoyed their company on the trails.", " These waterfalls are yet undiscoverd by massive tourism, which makes them a quite unique experience. We were able to swim in the clear blue water by ourselves, which we weren't able to in e.g. Agua Azul or Misol Ha, because of the lack of time and huge amount of tourists (we were with a tour). A local in Palenque told us about these waterfalls and we went there by colectivo. The ride took us about 45 minutes. When we arrived we had to pay a small entrance fee to some guys who appeared to be just chilling in the shade.", " Agua Azul or Misol Ha, because of the lack of time and huge amount of tourists (we were with a tour). A local in Palenque told us about these waterfalls and we went there by colectivo.", " These waterfalls are yet undiscoverd by massive tourism, which makes them a quite unique experience. A local in Palenque told us about these waterfalls and we went there by colectivo.", " It's a nice waterfall but it is a pretty small area to visit.", "Very beautiful waterfall with a little cave, but don't spend too much time here.", " There's a short pathway you can walk (about 1/4 of a mile) to appreciate the waterfall from almost underneath it. You can swim here, so take your swim clothes.", " There isn't really much to see here, but I would still say it's worth a stop. I like that you can walk behind the waterfall!", " The place is magical the waterfall is a small tall thin one, 45 meters high, the pond where if falls is nice, and you can have a good swim there. There is also a little cave behind the waterfall with a tiny waterfall coming out of the wall. But this way yo will not be able to feel the place.", " The falls are nice and there's also a cave that you have to pay 30 Pesos extra to get into that has a small waterfall in it, very small actually but novel. There's the main falls and some smaller ones along the path that takes you behind the falls and to the cave I mentioned.", " The falls are nice and there's also a cave that you have to pay 30 Pesos extra to get into that has a small waterfall in it, very small actually but novel.", "The Misol-há waterfall is beautiful.", " It's a really nice tall waterfall and you can go behind it.", " Definitely go into the cave just beyond the main tall waterfall. It's only  10 pesos (50 cents) more and pretty cool -- you wade through knee deep water to where there's a small waterfall inside the cave!", "Misol-Ha is a beautiful waterfall near Palenque, where you can swim in the pool or walk under/behind the waterfall.", " We paid $200 MXN for a day trip to Misol-Ha and Agua Azul, and it was worth it. We were given 45 minutes to spend at Misol-Ha on the way to Agua Azul, and that’s about all you need to get a nice photo and take in the view. It’s possible to swim at the base of the falls, and you can walk behind the waterfall for a different view.", " Did a tour that included this waterfall, cascadas de Agua Azul and the palenque ruins. This waterfall was spectacular and you could go under ( behind) the fall which was very cool.", " I visited the waterfall on a transfer from San Cristobal to Palanque, so the visit felt a bit rushed. You can walk behind the waterfall (though I recommend sturdy shoes). You can also swim in a rock pool at the bottom, but I didn't have time to do this. If you only have time to visit one waterfall I preferred Aqua Azul which is wider but less high, and on multiple levels with pools in between.", " I visited the waterfall on a transfer from San Cristobal to Palanque, so the visit felt a bit rushed. You can walk behind the waterfall (though I recommend sturdy shoes). If you only have time to visit one waterfall I preferred Aqua Azul which is wider but less high, and on multiple levels with pools in between.", "Pretty waterfall in the woods, place to swim.", " The visit is short 1 hour maybe, this is because you do not walk much to get to the waterfall.Take a change of clothes, you can walk behind the waterfall and you are going to get wet!", " This is one of the places that if you do not visit, you do not know it exists! The visit is short 1 hour maybe, this is because you do not walk much to get to the waterfall.Take a change of clothes, you can walk behind the waterfall and you are going to get wet!", " We took a day tour including this place and the Azul waterfall. I'd say this was the better one out of the two, the waterfall itself was spectacular and the swim at the bottom is cool and refreshing. Would recommend it as a day tour with Palanque ruins.", " I'd say this was the better one out of the two, the waterfall itself was spectacular and the swim at the bottom is cool and refreshing. Would recommend it as a day tour with Palanque ruins.", " In a place filled with waterfalls, this is a great one. You can swim right up to it and walk behind it.", " A really cool waterfall. You could view the waterfall from one area, then walk along to get almost behind it. Signs actually have rules for if you want to swim in the pool at the bottom of the falls, but it immediately flows into some rocks, so I don't know that that would be a good thing.", " The waterfalls are part of the fixed bus tours that take you to Palenque. Both waterfalls can be skipped and instead one can spend a bit more time at the ruins. The waterfalls only provide a good break in the journey and place to refresh if it is very hot.", " If you have seen other more spectacular falls in the world, then this is an average waterfall However, on a hot day, it is a good place to relax. From the car park, it is a short walk to the falls.", "It's a very close and pacific place where you can swim and watch one of the must amazing waterfalls in the area.", " If You're on the region and on the way to San Crostobal or agua azul, it's worth stoping by taking a few pictures. It's a nice setting and beutiful waterfalls, if you plan to swim better wait and head to agua azul", " Beautiful by itself? is hides a secret - a small cave with underground lake and waterfall - just pass behind the main waterfall following the stairs, which it quite an astonishing experience by itself, especially during the high waters season, and proceed to the cave of the other side of the lake. The place has also cabins to stay a night, and a nice restaurant with a slow service, but good food.", " This waterfall is very impressive and you can swim in its lagoon.", " This waterfall is beautiful and huge, it is beautiful but there is not a place to swim and it is very crowed, you can you go behind the waterfall and get wet and walk inside a little cave which you have to pay extra, after the 2 payments point you have to stop and pay to enter. For me the best of Misol Ha was the Elotes with mayo, cheese and salt (chilli optional) on the entry.", "This is a very impressive waterfall.", " Look for a secret path that takes you up the waterfall,if you can find it.", " We caught a combi van from the main highway at the edge of town direct to the site for something like 30 pesos each. We visited on a Sunday the week before Easter (a popular time to vacation throughout Mexico for both Mexicans and foreigners) and it was very crowded. Others speak of a cave you can enter behind the waterfall, but there were so many people, we never saw it. You can also swim here. I recommend stopping here, walking around behind the waterfall, then heading on to swim at Agua Azul.", " The waterfall is great to see and you can walk up al the way behind the waterfall.", " Even though I have seen LOTS of waterfalls on many continents, this one was still worth it and very pretty.", " It is a beautiful waterfall with a large pool and several smaller waterfalls surrounded by lush foliage. You can swim in the pool if desired and there are stone stairs with walkways to go behind the waterfall.", " This is accessible by car and can be seen from the driveway for those who are mobility impaired. It is a beautiful waterfall with a large pool and several smaller waterfalls surrounded by lush foliage. It looks like the pictures you see in a movie about Hawaii.", " Waterfall is impressive, vegetation, the sounds of the water and birds... you can safely walk &quot;behind&quot; the waterfall and had a once in a lifetime experience.", " You can walk around behind the waterfall and for $10 pesos you can walk into a cave where you can see an inside waterfall, stalactites, and stalagmites. I recommend stopping here, walking around behind the waterfall, then heading on to swim at Aqua Azul.", " Bring a swimsuit so you can go swimming while you enjoy the beautiful waterfall.", " To get to the falls, though, you must pay a toll to use the road, which I thinks was 20 pesos per person. The entrance to the falls is nominal and if you decide that you want to explore the cave with the falls, I think that's another 20 pesos. The swimming here is great, and the falls are spectacular.", " We vistied this waterfall during the second week of June, 2016, and it is a beautiful site. The entrance to the falls is nominal and if you decide that you want to explore the cave with the falls, I think that's another 20 pesos.", " Ask the waiter when the food will be ready (usually within 30 minutes) and then you have enough time to explore the waterfalls. You could go swimming, but we decided not to after already exploring Agua Azul.", " It's not the biggest waterfall in the world but it is in a beautiful jungle setting.", " To enjoy the falls even more, take a swim and get closer to the falls as they plumment into the pool.", " The waterfalls dropping straight down off the mountain is an amazing sight. The walkways lead you right under the falls for a full immersion experience.", " Visited the waterfall with a small tour and it was beautiful. Easy access to walk around behind it into the cave.", " When you arrive you pay 10 pesos to walk all the way to waterfall/ charge for walking on private road/. You can take a swim, chill out or explore small cave for extra 10 pesos.", " The waterfall is very beautiful with a clean and refreshing water for swimming. Nearby there is a very good restaurante where you cannot miss the Mojara Frita.", " You can have a walk behind the waterfall, you can have a swim, and you can even hike downstream through the water and rocks. Of the kids which set up a rope to stop you driving in the road towards the waterfall.", " This is a nice big waterfall. You can take a concrete pathway behind it and get to a cave which is interesting.", " We went first to the more famous Cascadas de Agua Azul, but we liked this more, it is a lovely waterfall which you can walk behind and have a spectacular view, we went in the afternoon and the light coming through the water, was amazing", "Having enjoyed waterfalls in such places as  Hawaii Island, these falls are more with great views and the joy of the trail behind the waterfall A WOW experience and photo delight", "Nice walk down to the waterfall, and there was a trail you could follow to walk behind the falls.", "Stopped here to see the falls and swim.", " They climbed all over the rocks and were fascinated with the waterfall as we hiked under it. You can swim in the pool at the base of the falls, but we didn't bring our suits so we just waded. It's not terribly far, but I was surprised to see a large underground waterfall inside the back of the cave. Our guide took pictures of us, pointed out stalagtites and stalagmites, as well as fossils and bats. I skipped the cave the first time, so glad we didn't this time around! If you go with a guide they will limit your time, usually around an hour and a half but this is doable. We spent about 2 hours and 15 minutes taking our time to explore it all.", " Nice waterfall just off the road a bit. It does charge an entrance fee (but what doesn't these days?)", " I really enjoyed my stay at Misol-Ha, but I don't think that it is outstanding from the many waterfalls Mexico has to offer.", " I really enjoyed my stay at Misol-Ha, but I don't think that it is outstanding from the many waterfalls Mexico has to offer. It is a nice visit when you are about to pass it anyways but I wouldn't go there only to see the waterfall.", " This is not a very famous attraction in the Palenque area, but it should be. It's &quot;only&quot; one medium size waterfall, but you like it as soon as you see it, and as you get closer you want to swim next to it or walk behind it, both things can actually be done!", " It's &quot;only&quot; one medium size waterfall, but you like it as soon as you see it, and as you get closer you want to swim next to it or walk behind it, both things can actually be done!", " It's a nice place to visit, you can even walk behinf the waterfalls. Still, it's not mind blowing...", " This waterfall is nice but because it is so busy it was hard to fully enjoy. The trail is wet and with so many people on it can feel a little unsafe. I highly recommend this because there is no better view of the waterfall then right in the middle of the pool, plus the spray and the force of the waterfall is spectacular.", "High drop waterfall which is a beauty to see.", " I always love it, when I have the chance to go behind the waterfall.", " I loved these falls much more than Aguas Azul. It was truly unlike any waterfalls I had ever seen before...absolutely inspiring!", " If I had to choose between going to the Misol-Ha Waterfall and Agua Azul, I would definitely chose the latter. There I quite a trek to get to the waterfall and it is very beautiful when you get to it.", "Lovely waterfall with cold water to swim in.", " This was a nice place to visit for a short period of time. It was neat walking behind the waterfalls.", " It was a nice high waterfall, with an interesting cave. If you are around the area you better stop and have a look. Its worth it.", " We took a tour guide which brought us to the Cascada (Waterfall) of Misol-Ha, it was a very nice experience! they have a restaurant at the beginning of the waterfall so you could easily be there the whole day and have lunch and you can also go swimming if you like. we visited the Misol Ha and also the Agua Azul and the agua azul is much bigger but both very nice to enjoy for a day.", "A stop by the double waterfalls of Misol-Ha and take a quick dip is worth the effort.", " Now, if I was not sure about the score is because certainly this waterfalls are great by itself.", " The waterfall is excellent. You can't swim directly under the waterfall but you can swim in the pool beneath it(they have roped off area)\nThere is a little cave you can check out while you are there for 10 pesos it has 2 little waterfalls not much else but its so cheap. Walking behind the waterfall is really nice too you will get wet though from spray", " The falls is Majestic and you can actually swim there! We were there before sundown and it was extra amazing. Caves to explore also behind falls, will do that next time we come!", " The falls is Majestic and you can actually swim there! But find the path to go behind the falls and you could stay there forever, taking photos and drinking in the beauty.", "These waterfalls are beautiful, reminiscent of some in Hawaii.", " I went to Palenque to see the ruins and knew nothing about the waterfalls before getting there, but they are definitely not to be missed. The waterfall thunders down into a lovely clear pool perfect for swimming. You can walk behind the waterfall and for a small fee explore the little cave on the other side. You are given a torch to wade into the cave with and a short walk through the cave takes you into a chamber with another little waterfall. Perfect for creeping up behind people &amp; doing Golum impressions!", " You can walk behind the waterfall and for a small fee explore the little cave on the other side. You are given a torch to wade into the cave with and a short walk through the cave takes you into a chamber with another little waterfall.", " Make sure you also walk on the path that takes you under the waterfall through a cave which allows you to experience the power of the falls close up.", " In the same area as Agua Azul but completely different, is the waterfall called Misol-Ha. The spectacular waterfall cascades into a huge, deep, green pool. It's a wonderful place for a refreshing swim and for sunbathing on the rocks. Make sure you also walk on the path that takes you under the waterfall through a cave which allows you to experience the power of the falls close up.", " A lovely waterfall, not too inviting to swim when there are so many people. There is a cave and an underground waterfall but there are so many people at weekends that I advise to only go inside if you can stand being in a contained space!", " Beautiful spot with a path all around the back of the waterfall. We took a joint tour with Agua Azul and only spent 40 mins here. Regretted not having time to swim.", " Once you get over the site ( which you never actually do) you can swim all over, the water is rally fresh and even though it's super deep it's crisscrossed by ropes you can hold on to, even my 8 year old was enjoying herself. There are other smaller waterfalls and can get under the big one, don't miss the small cave at the far right, for $10 pesos per person you'll get a flash light and will explore an inner waterfall with a vault full of friendly bats, it's not super exciting, but since you're there why not?", " Also, if you can, take with you $10 pesos ton enter to a small cave with a little waterfall inside, its worth it.", " I recommend to wear tennis because first you can walk behind and around the waterfall. You can see a rainbow and swim very near the waterfall.", " This waterfall ... what can I say . This is the real nature,  you can actually walk behind the waterfall and swim in the bottom of it. My english is not the best !", " beautiful waterfall with walkway that goes behind the waterfall...don't miss it.", " after our early morning visit to the site of Palenque, we did not want to drive all the way to Agua Azul, so we made it to Misol-Ha. The waterfall is nice, albeit that the small lake is not so inviting to take a swim. A nice trip for an afternoon if you stay in Palenque.", " The waterfalls of Mishol-Ha are lovely, especially during the rainy season when the water cascades down with incredible force. We especially liked going behind the falls to photograph them from behind.", " You will be blown away by this beautiful waterfall near Palenque. Theres \na pathway behind the waterfall but be careful not to slip.", " You will be blown away by this beautiful waterfall near Palenque. Theres \na pathway behind the waterfall but be careful not to slip. I \nwould book another trip there.", " Our tour group stopped here following our visit to Aqua Azul. It was a nice location with rainforest surrounding the waterfall and lagoon. There is a short walk down to the base of the waterfall and the path is fairly safe, though there are parts to watch and especially near the waterfall, which you can walk behind of, which is mossy.", " Palenque is situated around so many great waterfalls, check them all out!! Take a tour that includes 2 or 3 and take your swimsuit!", " First things first as a heads up, you have to pay twice to get into Misol-ha. Anyhow, this waterfall is known for a scene which was filmed for the movie Predator. It doesn't take long until you see the waterfall after a short walk from the car park and one can follow the trail which goes behind the waterfall. At the end of the trail is a cave which costs 10 Pesos to enter and the guy will lend you his torch to see inside the cave. The average time it could take to experience the waterfall in a basic way would be about 30-60 minutes, but if you take it easy and have the time then you need about 1-2 hours (maybe 3 tops) to explore the place.", " But then again, I was travelling with a Mexican family and not in a tour. I can't remember what the fees were but to my knowledge they didn't cost much. I don't think it would be a good idea to swim in the main pool under the waterfall especially as it looks too murky and deep.", " the place is very nice and worthy to visit it, it is spectacular how the waterfall is so clean and with the jungle behind, i will not recommend to swim, because it is very deep and also because they don´t have where to change and shower", "Misol ha is beautiful, my favorite waterfall in chiapas.", " The waterfall is definitely worth to see. Not only because it's famous from the Predator movie from 80's who was shoot in the area, but also it's a wonderful natural place with possibility to swim. The entrance is just about $25 pesos and its also possible to go behind the waterfall and take a photos from The back (take waterproof camera or a plastic bag at least).", " In my opinion this is far more impressive than the Agua Azul Waterfalls. The intensity and height of the fall is far more intense than Agua Azul and the path behind the waterfall is amazing.", "Take about an hour to relax and walk through the path behind the waterfall and do enjoy the scenery.", " The first waterfall I've ever had the opportunity to walk BEHIND. It was beautiful and fascinating.", " the misol ha waterfall are big, and we can walk into the hole behind the waterfall, where you will get wet as soon as you arrive, the view is different from seeing in front of the waterfall.", "This is a very nice spot, but not the biggest or best waterfall I've seen.", " These waterfalls were a nice refreshing trip from hot Palenque town and they're only 30 min away. To get there:\nYou can take a tour which will charge either $120 pesos or $150, depending on the company.", " These waterfalls were a nice refreshing trip from hot Palenque town and they're only 30 min away. They're not on some major park complex with trails; there's only the waterfall and nothing else but I really enjoyed them. They'll give you either 40 min or an hour at Misol Ha and 3 hours at Agua Azul (turquoise waterfalls during dry season about an hour away from misol Ha).", " They're not on some major park complex with trails; there's only the waterfall and nothing else but I really enjoyed them. My recommendation, don't take a tour.", " The spray created was enough to douse you if you walked behind the falls (which I highly recommend doing). If you venture in far enough you will find a waterfall inside the mountain.", " This was a really pretty waterfall. You could walk on the path behind it as well as swim in the water in front of it. It was a bit cold, but worth the $30 or so pesos per person to get in.", " It's a big and powerful waterfall, but nothing really special about it... A nice stop between san cristobal and palenque if youq are doing the trip anyway", " Is a long fall waterfall, you doesn’t expect to see that majestic waterfall, beautiful place to swim and to visit, very nice, take your camera and something to cover it because there’s a lot of mist", " There was a cave on the other side under the waterfall but we didn't go in it.", " When we arrived at Palenque we booked a trip to Palenque archaeological site which took in the full morning, in the afternoon we visited Misol-High waterfall and then onto Agua Azul wateralls which took up the afternoon. After that we then went on to San Christobal for a couple of days. Misol-High is a high drop waterfall. As you approach the waterfall the path splits, one goes to a viewing platform and the other path takes you behind the waterfall. It is well worth using both paths. This is well worth a visit for a short while.", " When we arrived at Palenque we booked a trip to Palenque archaeological site which took in the full morning, in the afternoon we visited Misol-High waterfall and then onto Agua Azul wateralls which took up the afternoon. As you approach the waterfall the path splits, one goes to a viewing platform and the other path takes you behind the waterfall.", " If have a car or rent a car, this is a nice stop. It's a pretty waterfall, but not much to it.", " The same day with Agua Azul, you have to visit Misol Ha! You can also swim under the waterfall!!", " It seems you get a flashlight and get to cross through the little river inside the cave to see a second waterfall. Maybe you can give it a chance ;)", " If you're an Arnie fan don't miss the waterfalls of Mishol - Ha, this is where the famous scene where Arnold Schwarzenegger jumps from the top of the waterfall.", " Not only is it famous but it's a really beautiful waterfall in a lovely relaxing setting, if you're in the Palenque region this is well worth a visit!", " If you're an Arnie fan don't miss the waterfalls of Mishol - Ha, this is where the famous scene where Arnold Schwarzenegger jumps from the top of the waterfall. Not only is it famous but it's a really beautiful waterfall in a lovely relaxing setting, if you're in the Palenque region this is well worth a visit!", " great for photo opportunity, can also swim around the waterfall, nice trip to stay for a good 1hr or hour and a half, go round the back of the waterfall and explore the cave with a light!!", " The waterfall was quite big because we're in rainy season now. I think it was worth the trip.", " We didn't have the time to swim, but it's possible. The waterfall was quite big because we're in rainy season now.", " Waterfalls, caves under the waterfalls, warning signs everywhere about the danger of the waterfalls... what's not to love about it.", " I really loved this waterfall because you can swim below it and see the power of the waterfall. If you are there you need to A) Swim: Even if you don't feel like it. B)  Walk behind the waterfall until you reach the caves", " I visited Mishol -Ha as part of a tour that I'd booked in Palenque that included the site of Palenque, Mishol-Ha and Agua Azul. You can walk down a stairway to see the waterfall or swim in the deep pool just below the falls and there is another trail that takes you behind the falls giving you a view of the backside of the waterfall. This trail ends at a cave that you can enter; I only took a few steps into the cave, but you can go further if you want and have a flashlight.", " You can walk down a stairway to see the waterfall or swim in the deep pool just below the falls and there is another trail that takes you behind the falls giving you a view of the backside of the waterfall.", " The scenery all the way to the waterfalls is just marvelous, and swimming in the waterfalls is a real treat.", " A beautiful waterfall and large pool at the base, which you are allowed to swim in, so bring your swimsuit.", " Though Trip Advisor and Lonely Planet had suggestions for tour companies, we decided to go with to the waterfalls with Kim Travel, because arrangements could be made from our hotel. He was a half hour late, filled tank with gas after picking us up, and announced that we would have less time at the waterfalls.", "You can walk behind the waterfall which is great.", " It's one waterfall, nice if you combain it with Agua Azul. Check the trips they offer in Palenque.", " It's one waterfall, nice if you combain it with Agua Azul.", " Less commercialized than Agua Azul, it allows for a nice swim in the 'pool' around the waterfall.", " Less commercialized than Agua Azul, it allows for a nice swim in the 'pool' around the waterfall. You may take your picnic and spend the day.", " The waterfals in Chiapas are amazing. there are a lot of them and they are completely amazing, you can find a lot of art crafts on your way to the waterfall and you can swim on this one.", "The water was high, so the waterfalls were spectacular.", " We stayed at Palenque and made a day trip out to three waterfalls. From here, we drove 45 mins towards Palenque to the next waterfall; we stopped for about 30 mins at the Misol-Ha waterfall and walked behind the falls. We then drove approximately an hour to the Robberto Barrios falls where we swam for 2 hours.", " We stayed at Palenque and made a day trip out to three waterfalls. It took approximately 2.5 hours to get to Agua Azul. From here, we drove 45 mins towards Palenque to the next waterfall; we stopped for about 30 mins at the Misol-Ha waterfall and walked behind the falls. We then drove approximately an hour to the Robberto Barrios falls where we swam for 2 hours. You can jump into the water from the rocks and its quite relaxing. Great day trip!", " We stayed at Palenque and made a day trip out to three waterfalls. Definitely the best of the three waterfalls. We then drove approximately an hour to the Robberto Barrios falls where we swam for 2 hours.", " We stayed at Palenque and made a day trip out to three waterfalls. It took approximately 2.5 hours to get to Agua Azul. Definitely the best of the three waterfalls.", " This is an incredible place where you can stay the entire day. It’s a natural park, full of waterfalls; there are places where you can swim in, there are tiny restaurants as well as little shops where you can buy food or souvenirs.", " Long drive from Palenque. Waterfalls are beautiful. There is a climb with stairs to the top viewing point but if you have difficulties the bottom is good enough.", "Lots of water so interesting waterfall.", " We went with a tour company that put on a bus to Misol-Ha waterfalls and then Agua Azul. It was great value, we spent 2.5 hours at Agua Azul, which was plenty of time.", " We went with a tour company that put on a bus to Misol-Ha waterfalls and then Agua Azul. It was great value, we spent 2.5 hours at Agua Azul, which was plenty of time. We would recommend going downstream a bit where it’s a little bit quieter and you can chill in little natural pools on the cascades rather than in a big area full of other people.", " We went with a tour company that put on a bus to Misol-Ha waterfalls and then Agua Azul. The water was an incredible colour and very refreshing especially in the heat! We would recommend going downstream a bit where it’s a little bit quieter and you can chill in little natural pools on the cascades rather than in a big area full of other people.", " In rainy season the power of the waterfalls is impressive yet the color of the water is like chocolate. Some areas are appropriate for swimming, and other areas are forbidden due turbulent areas of the river and waterfalls.", " Cascadas de Agua Azul is a series of waterfalls set in a dense jungle region near Palenque. The sheer volume from multiple waterfalls hurtles down the mountains &amp; concentrates in a large pool of water at the base.", " Cascadas de Agua Azul is a series of waterfalls set in a dense jungle region near Palenque. To get the best views &amp; the best selfies of the powerful rushing torrents of water, go to the wooden viewing platform. The sheer volume from multiple waterfalls hurtles down the mountains &amp; concentrates in a large pool of water at the base. Further down the power of the waters dissipates enough to allow bathers to wade out with the aid of a rope strung across the raging river. Because of the sloping topography of the location, visitors can climb the steps of the hill adjacent to the falls &amp; get a number of different vantage points of the wildly gushing waters. The over-touristy nature of the site detracts a bit from Agua Azul’s natural wonder, the place is teeming with too many persistent vendors &amp; hawkers &amp; an over-concentration of souvenir &amp; food huts.", " We like the wonderful waterfalls of Azul and could enjoy the different steps of the falls. It is definitely worth to climb the stairs - for the views of the falls, not for the shopping area, which is awful.", "After the  the Chiflon  waterfall's the Agua Azul is nothing special...but if you don't know what to do is a nice place to spend few hours.", "Spectacular waterfalls and lots of buissnesses around, where one can eat and buy souvenirs.", " We were lucky to visit the falls in the week before the storm (before Christmas). But the whole walk up the waterfall is packed with stalls and restaurants etc. Get a guide or ask a local for a trip down the waterfall, to jump, canyoning and slide. It takes you all the way to Roberto Barrios (one hour drive, the road is not bad and easy with a high riding car, no 4x4 required) and is beautifull.", " The waterfalls are amazing but it had been raining so I didn't get to see the turquoise waters...but I'll be back", " The waterfalls  were so full the day we visited and it was spectacular to see. It was raining but still we had a fantastic day. Our guide Christian explained everything really well and was very easy going.", " This is a place to relax and spend at least half a day. The waterfalls are a must see on you Chiapas trip and I would have loved to have a couple of hours more here - as it is a great place to relax, walk around and take pictures.", " All I can say is WOW!! these waterfalls are by far very beautiful and spectacular, clean turquoise water refreshing to jump in, lots of locations for great pictures, great for families, never felt unsafe as they have people guiding you to locations for a safe swim. I will definitely return!", " these waterfalls are by far very beautiful and spectacular, clean turquoise water refreshing to jump in, lots of locations for great pictures, great for families, never felt unsafe as they have people guiding you to locations for a safe swim.", " We stayed at Palenque and did a one day tour to Agua Azul. We reached this place after about 2-3 hrs of a curvy street going through the mountains of the Sierra Chiapaneca. The street was to 50% destroyed, some parts of the street &quot;filled out&quot; with stones, some parts washed out by the rain,  nothing for week hearts  but the landscape just stunning. I must say, probably my experience at agua azul is bias because of a group of people who stopped our van by standing in front of it and partially surrounding it, not allowing us to drive further unless we buy souvenirs and fruit from them. This experience in &quot;the mountains&quot; just left us already willing to turn around and forget about the waterfall. Anyways, we finally made it to Agua Azul. During the rainy season the water is brown and you cannot swim however you get to see the &quot;power&quot; of the waterfall when 2-3 times more water is coming down. Maybe we were unlucky but as a traveler I also want to share the unpleasant experiences. If you are in Palenque maybe try rather Misol-HA and cascades Roberto Barrios which are closer to Palenque.", " At the next view, you think &quot;the last spot was better&quot;, then the third shows even more and you're amazed again. We have been to a lot of places (34 countries and counting) and have visited many waterfalls. This waterfall is definitely at the top of my list of the falls that we have seen.", " Back then we could swim freely in some of its pools with no one to bother us. I heard from our guide there are other not well known waterfalls in the area which are more beautiful and less crowded.", " The waterfalls are part of the fixed bus tours to Palenque. They can be skipped - they are only good for a break in journey. It would be better to go directly to the ruins and maybe the waterfalls afterwards so as to relax after being under the sun.", " Went along with a conducted tour and was allotted 1 hour to visit the falls which is quite adequate to see the falls if you don't plan on swimming here. The falls itself is stunning and the colour of the water varies from yellow to green to blue, an impressive site to see.", " Took a collectivo there from Palenque (recommend this rather than a tour, you can also take one to the ruins. I prefer to be on my own so I don't have to try and find the tour etc.) They swimming area was not swimmable due to all the families but if you walk up the stairs a few levels and climb under the banister I found a lovely place to swim right by a waterfall.", "Beautiful waterfalls surrounded by dense forest/jungle.", " The Agua Azul waterfalls are true to their name- the water is as blue as it gets.", " Although you are allowed to swim in a very small portion of the waterfall towards the bottom I did not mind. Be ready for a lot of climbing if you want to see the waterfall all the way from the top. Not sure how I felt about it being completely filled with vendors but in the end they sold some neat stuff.", " The waterfalls are amazing, they are very popular and a lot of people go there, but they are big, and there are plenty of space and different places where you can walk and also even swim, the water feels so good, also they places to eat and to do a little shopping.", " Waterfall are big and pretty no really high ones but really nice, depende on de year season water might be blue, white or chocolate color. For best pictures go before noon, so the sun light is pointing the waterfall.", " What at first feels like a large arts and crafts market, with a small waterfall added for entertainment, eventually turns into an amazing display of natural beauty the further up you follow the falls, leaving the ubiquitous and rather annoying vendors behind. Since most of the visitors either didn't know how to swim or were reluctant to approach the falls, we had most of the large pool of blue water to ourselves.", " This is a beautiful place to visit, I did the friends and family version so I am not familiar with guided tours. I did visit during the rainy season so the Cascadas de Agua Azul (Blue Falls) were anything but, plenty of brown water due to the rain. I would recommend to try the small bananas, they are delicious. I recommend to park your car and walk around, you can walk up towards the top and just look around. I am going to try and make it back during the warmer weather so I can experience the Blue Falls for myself.", " I did visit during the rainy season so the Cascadas de Agua Azul (Blue Falls) were anything but, plenty of brown water due to the rain. I am going to try and make it back during the warmer weather so I can experience the Blue Falls for myself.", "Waterfalls for days.", "Beautiful waterfalls.", " The waterfalls are nice to see but very touristic. Most tours offer a 3 hour stay at the waterfalls but I think that's really to long. The children will follow you asking for money.", " On the road to the waterfalls the have roadblocks so be prepared to pay extra if you want to enter. Otherwise they won't let you go further.", " This waterfall was one of the prettiest I have ever seen. We went right to the top of the waterfall first to go for a swim. After our swim we went slowly down checking out all the various vantage points along the way.", " This waterfall was one of the prettiest I have ever seen. We went right to the top of the waterfall first to go for a swim.", " Agua Azul is the attraction I tell EVERYONE about. Chiapas, Mexico, is my all-time favorite destination, and I have to admit that the main reason is because of these waterfalls. My photos say more than I can in words.", " Impressive waterfalls, but after the rain really brown water (Cajeta/ Caramal) - although its possible to get in for a swim.", " Agua Azul is a beautiful, turquoise colored river that you can swim in. You can also walk along the river to multiple swimming areas. Bathrooms are plentiful for $5 pesos.", " I was looking forward to gorgeous blue, green like coloured water by the waterfalls (and the tourists in our tour bus were too), but we were all disappointed when we got there. Can't deny that the view of the waterfalls themselves look AMAZING and the 'mirador' gives opportunity for great pictures with the waterfalls as background, but the water looked brown and murky.", " Can't deny that the view of the waterfalls themselves look AMAZING and the 'mirador' gives opportunity for great pictures with the waterfalls as background, but the water looked brown and murky.", " Can't deny that the view of the waterfalls themselves look AMAZING and the 'mirador' gives opportunity for great pictures with the waterfalls as background, but the water looked brown and murky. We opted not to get in the water though we were looking forward to it. Instead we sat to enjoy the view and take some drinks.", " I was looking forward to gorgeous blue, green like coloured water by the waterfalls (and the tourists in our tour bus were too), but we were all disappointed when we got there.", " It is undeniable that the waterfall itself is spectacular but it is overcrowded and full of souvenir, food stalls, etc. You can't appreciate the natural beauty of Agua Azul, even you try to look away from them. And most time of the year, the waterfall is brown and muddy.", " The great part is that it is permitted to swim in the falls.", " You can have a walk behind the waterfall, you can have a swim, and you can even hike downstream through the water and rocks. Of the kids which set up a rope to stop you driving in the road towards the waterfall.", " Lovely falls that a great for swimming. Go for the swimming and falls", " I forgot to mentiona above that the waterfall is blue in color( most of the times:p)", " I've seen such beautiful cascade waterfalls only in Laos so far. The water is turquoise blue, there is a path which is around 3 km long and goes along the cascades.", " We went there on a day tour to Palenque from San Cristóbal. The driver advised us to have our breakfast fast before the place got too crowded and then visit the waterfalls as we only hada couple of hours.", " The driver advised us to have our breakfast fast before the place got too crowded and then visit the waterfalls as we only hada couple of hours. Luckily we didn't do that.", " We went there on a day tour to Palenque from San Cristóbal. The driver advised us to have our breakfast fast before the place got too crowded and then visit the waterfalls as we only hada couple of hours. Luckily we didn't do that. Actually there are dozens of places to eat within the park and we would have missed the upper part of the waterfalls which is a long walk upstream.", "Incredibly blue water and simply breathtaking waterfalls.", " When we visited it was full of people, so we had to climb up and up to feel a little bit more private, but the walk was amazing and discovered new and more waterfalls.", " The waterfalls and swimming ponds are beautiful, and luckily there were not that many persons so we could go into one if them without too much problem. Yes, someone might say these falls are not that high, but the total package you get is worth a visit.", "The park and waterfalls are magnificent.", " I've been to many waterfalls within Mexico and I can say this place is one of the best and most beautiful waterfall places.", " Due to the wet season and that it just rained the day before, the waterfalls were just mood, no blue at all. The size of the waterfalls is stunishing but without the characteristic color, it was just meh.", " Waterfalls - we've all seen them. However, these falls are beautiful and full. Very broad and full, these are wider rather than higher and the amount of water running downstream makes these falls a trip worth taking.", " Cascadas d Agua Azul (BlueWater Waterfalls) its a natural park near Palenque Chiapas , his name came from the true blue on the water due to many minerals and sulfurus  from upriver in the mountains...you can swim at your own risk or take a lot of pics!", " Probably the best waterfalls I ever seen in my life.", " The waterfalls are amazing to visit.", " Agua Azul is sooo beautiful and it's great that you can walk alongside the falls on the path all the way up to the top. There area  few swimming holes, but we didn't swim...but instead sat down and chilled out to the sound of the falls :)", " Visited these waterfalls and as the name suggest they were nowhere near blue. I actually still up to this point do not know why they call them the Agua Azul.", "Lovely waterfalls in fact some of the nicest I have ever seen.", " The falls are nice, and you can swim. There´s also a lot of restaurants and even ( low class ) hostels close by, which we learned when local thugs closed of the road in both directions and we had to spend the night at a &quot; hostel &quot; next to the falls. The thugs however do not affect the niceness of the waterfalls, but I recommend you to be VERY cautious if you are travelling by car.", " Make sure you allow for a few hours of swimming with a natural back massage from the waterfalls. I loved it.", "Beautiful blue green water and very attractive waterfalls.", " Agua Azul is a beautiful series of waterfalls, and offers a place to swim. There is a large marketplace where once can get souvenirs &amp; food.", "These waterfalls were fabulous.", " There are many beautiful things to see in Chiapas, but one of the most important ones are the waterfalls. And this ones are particularly stunning because it's not the height what amazes you, but the extension of the waterfalls, and of course the turquoise blue color of the water. But it is also true that the natives use that touristic zone to make war towards the government, sometimes they completely block the road to the waterfalls to make the government stumble, making that tourists miss the experience.", " Beautiful, large waterfalls. We visited after a few days of rain. They were more a muddy brown color. We went en route from our time in palenque to San cristobal.", " We did a trip around Chiapas in November, it was a bit crowded and the waterfalls weren't as blue as we thought they would be, our guide said it was due to the raining season.", " I like bit more wild with my waterfall.", "Beautiful waterfall and cascades in a lovely jungle setting.", " Quite an extensive area and a beautiful waterfall. There is a walk up the side of the waterfall with lots of offshoots to explore.", " It's some nice, but not very large waterfalls and a nice small &quot;town&quot; surrounding it and living from the tourism. I found it more interesting to see how people live there then the waterfalls itself, I'd say it's very nice but not worth a drive from Palenque.", " I found it more interesting to see how people live there then the waterfalls itself, I'd say it's very nice but not worth a drive from Palenque.", " I have seen most of the importend waterfalls in the world, but agua azul comes for me among the top ten. Ok its not that big, but its just besutiful, sall those different cascades. Its quite touristic, but what can you do if its a beautiful place.", " I have seen most of the importend waterfalls in the world, but agua azul comes for me among the top ten.", " I have seen most of the importend waterfalls in the world, but agua azul comes for me among the top ten. Ok its not that big, but its just besutiful, sall those different cascades.", " I did not find the road from Palenque to the waterfalls to be uncomfortably windy. The waterfalls are nice, if you are around the area it is worth the visit. However, warniing: if you're coming from far, it only takes about 20 minutes to reach from the bottom to the top of the waterfalls. There are a lot of stray dogs around the area and walking around the waterfalls so you have to be careful.", " The waterfalls are nice, if you are around the area it is worth the visit. However, warniing: if you're coming from far, it only takes about 20 minutes to reach from the bottom to the top of the waterfalls. The water is cold but really refreshing, I suggest you to take a dip or the trip will not be too worth it.", " I did not find the road from Palenque to the waterfalls to be uncomfortably windy. It is quite annoying to get harassed by kids holding ropes to stop cars and sell their products though. However, warniing: if you're coming from far, it only takes about 20 minutes to reach from the bottom to the top of the waterfalls.", "A don't miss....at least a kilometer long cascade of small and large waterfalls...and you can walk along the side the entire way...what great pics.", " We were very happy to visit Agua Azul with blue water during our stay in juli because it could turn brown during rainy season. It took us 1h 30 min! You can swim near the big waterfalls (and pay for it) or you can go further (lots of stairs) and swim for free without crowd like we did.", " You can swim near the big waterfalls (and pay for it) or you can go further (lots of stairs) and swim for free without crowd like we did.", " Atmittedly, the circus you run into from the parking right up to the falls is off putting, but when you enter the raft (haggle a bit for this tour!) you are taken into the jungle to the back of the falls, up to a nice swimming spot. Beware: after the wet season the falls are brown, not blue!", " The waterfalls themselves are beautiful the disappointment is the area around the falls.", " We stopped here and at the Misol-Há waterfalls on our way from Palenque to San Cristóbal de las Casas and found it to be well worth our time. The natural beauty of Chiapas is amazing and its maximum expression may be these waterfalls, along with Misol-Há. Yes, there are a lot of souvenir vendors.", " We stopped here and at the Misol-Há waterfalls on our way from Palenque to San Cristóbal de las Casas and found it to be well worth our time. The natural beauty of Chiapas is amazing and its maximum expression may be these waterfalls, along with Misol-Há.", " We stopped here and at the Misol-Há waterfalls on our way from Palenque to San Cristóbal de las Casas and found it to be well worth our time.", " It is sad, but this is one of the very poor regions in Mexico. All said and done, it is an experience worth the trip, and the tour to see the other 7 waterfalls is very good, with interesting river crossings, great picture areas.", " I love epic waterfalls (Argentina's Iguazu Falls is one of the top scenic sites in the entire world) so I didn't expect a lot out of Agua Azul.", " Took a day tour to Misol Ha and Agua Azul, waterfalls close-ish to Palenque, transport and entrance fees were just under $18US,  the tour was from noon 'til about 6pm, when we arrived back in Palenque. 40 minutes to take in Misol Ha, and almost 3 hours to enjoy Agua Azul, enough time to enjoy both places. The tour cost 150pesos, entrance fees were extra - 70 pesos for Misol Ha and Agua Azul, for a total of 230 pesos for the day, and well worth it. Misol Ha was very natural, no vendors, and you could walk behind the falls, which was really cool. Agua Azul had a TON of vendors, restaurants, mostly close to the entrance, they thinned out the further up the site you went. Agua Azul had some upsells further up the site, guided tours to other, smaller falls, though the main attraction is the BIG falls as you first enter the site, some great photo opps here. Highly recommended to get out of Palenque and into the beautiful, natural surroundings.", " Took a day tour to Misol Ha and Agua Azul, waterfalls close-ish to Palenque, transport and entrance fees were just under $18US,  the tour was from noon 'til about 6pm, when we arrived back in Palenque.", " Even though they are called &quot;Blue-waterfalls&quot; they can be a bit brown when you go after a rainy couple of days.", " The waterfalls were nice, but not sure they were worth the extra drive to see them, especially with kids standing in front of your car to try and get money from you en route.", "Agua azul is a beautiful series of waterfalls.", " The waterfalls are nice, but don't try to compare them with Iguasu or Victoria falls.", " Agua Azul's stunningly beautiful blue green waters with its many levels of waterfalls combined with a short visit to Misol-Ha will make for a very relaxing day trip from Palenque. The drive to both waterfalls through the mountains and jungles is both very scenic and also a bit nerve-wracking - there were 3 different sections of the road where the mountainside gave way taking with it half of the road.", " These are a series of waterfalls. There are several of them and they are really beautiful.", "The view is beautiful, the waterfalls fantastic!", " This waterfall is HUGE. There is a pathway all the way to the top with the scenic waterfall on one side and souvenir and handicraft stalls on the other.", " Make sure, if you are in Palenque, that you get to see these magnificent pools/waterfalls. They are breathtaking. You can swim in them, and the water color is like the Caribbean Sea.", "Great waterfalls which unfortunately weren't blue when we visited as it had rained and this changes the colour of the water.", " These waterfalls certainly lived up to their name as the water was brilliant blue and it was nice to see the local people enjoying bathing in the natural polls below the falls.", " Also nearbay ys a beautifull waterfall called misol-ha its also worth to visit and swim in it", "Very scenic waterfalls with the change to have a swim in a little pool at the top.", " We had the best view just to ourselves and it was breath-taking. Then we walked up the river and saw more beautiful places, small waterfalls, had a swim, had a picknic, as lots of resting places are prepared a long the side. We really had amazing day trip, but coming back we saw the tourist groups pushing around for the picture next to the main cascades.", " The Agua Azul waterfall is absolutely stunning with beautiful turquoise water, but you won't enjoy it as much if you will come with a tour to make five pictures and visit one of the local food places lined up along side it. To really souk up the beauty of it and enjoy it to the full I think you you need to spend a day around there.", " The Agua Azul waterfall is absolutely stunning with beautiful turquoise water, but you won't enjoy it as much if you will come with a tour to make five pictures and visit one of the local food places lined up along side it.", " The place is very nice, as there are multiple waterfalls and water is as blue as it appears on pictures.", " we've seen waterfall before (Iguazu) it still gives a jolt of what nature is all about.As in Palenque, we arrived at the falls when it rained heavily.That did not ruin the beauty of the site, You can walk for 7 Km.", " we've seen waterfall before (Iguazu) it still gives a jolt of what nature is all about.As in Palenque, we arrived at the falls when it rained heavily.That did not ruin the beauty of the site, You can walk for 7 Km. along the river if you want, if not, just enjoy.", " Came to Aqua Azul after two days of heavy rain. The water was thundering down and the waterfall was much bigger then last time i visited the place. We had bought a ride from Palengue in a mini bus going to Misal Ha and then to Agua Azul  - price 150 pesos 8 hours trip. When you arrive to agua azul you pay a small fee to enter. Try to take a walk up the waterfall banks on the left side of the waterfall and see how the place is changing the further up the streck you get. You can hang out and there is a small sandy area about 20 min walk up the waterfall. all in all this one of mexico wonders and a place to remember.", " The water was thundering down and the waterfall was much bigger then last time i visited the place. Try to take a walk up the waterfall banks on the left side of the waterfall and see how the place is changing the further up the streck you get.", " I loved the Agua Azul Waterfalls. We arrived at night and stayed in a very little not so cozy cabin, everything was dark and we didn't know what to expect but when the sun rised...\nWe could see from our room the emerald blue of the river flowing. Breakfast near the waterfall was great and all the walk up to the second swimming area is full of souvenirs and places where you can grab a drink or just some fresh water.", " I loved the Agua Azul Waterfalls. There are a couple of lookout points around the way up, I recommend checking them, nice to take pictures! The water was so clean and so cool and it was not too deep (I don't know how to swim hehe), though in the middle of the river you could see people dipping in, I guess it was deep enough in the middle to do that.", " I loved the Agua Azul Waterfalls. We arrived at night and stayed in a very little not so cozy cabin, everything was dark and we didn't know what to expect but when the sun rised...\nWe could see from our room the emerald blue of the river flowing.", "Did not get to see the blue blue waterfall, it was cloudy and had been raining but just to see so much water is incredible.", " The tiered blue wedding cake waterfalls are gorgeous. The restaurants lined up across from the falls are absolutely terrible.", " it was hot and humid but the sight of Agua Azul waterfalls,\ntheir turquoise colored waters.", " We went of a tour from San Cristobal to these waterfalls and to the palenque ruins. The waterfall was lovely - it is worth making the walk up all the steps past the vendors to get to the quite water pools at the top.", " Though we were there as well, we were lucky it hasen't been raining. It is indeed very touristy, but there are also a lot of locals. First we walked up to the top of the huge waterfall. Later we went swimming. Our guide knew a quite place so we could swim without locals and other tourists around us.", " It's a beautiful place, a perfect stop on the way from San Cristobal to Palenque but I found it VERY touristy. I prefer other waterfalls,like MIsol-Ha", " Having been to the place 15 years ago I was amazed in at the amount of shops which have sprung up along the waterfalls. The waterfalls in itself are superb.", " The waterfalls at Agua Azul is very beautiful, although not very blue when we visited. If you only want to get in once, wait till you get higher up in the waterfalls, its much more beautiful and grand than the first area where swimming is allowed.", " The waterfalls at Agua Azul is very beautiful, although not very blue when we visited. But we had a nice walk along the waters and went in a couple of places.", "is worth to go to agua azul waterfalls.", " It was nice and we had a really great group.. but these waterfalls are better when it's not raining season. We didn't have Agua Azul, more Aqua Brown..", " The cascades are beautiful, and there are blue pools to swim in at several areas along the river. The waterfalls are truly magical!", " The cascades are beautiful, and there are blue pools to swim in at several areas along the river. As you climb the path, there are some smaller cascades and other areas for swimming.", " It's one waterfall, nice if you combain it with Mishol-Ha.", " We get here on the rainy days, so we couldn't see the blue water. Unfortunately when we get there there, we had 4 days of rain so the water was like any other waterfall in the world, but still amazing.", " Unfortunately when we get there there, we had 4 days of rain so the water was like any other waterfall in the world, but still amazing.", " There are places to eat, buy souvenirs and simply sit and watch the falls. You can also swim in the lagoons at the bottom of the falls, although we didn't have the time to do this.", " Agua Azul waterfalls are not to be missed if you are in Chiapas visiting the Palenque ruins or San Cristobal de las Casas. They are a series of cascading waterfalls of brilliant blue which run over a red / orange bedrock and are simply beautiful.", " In the heart of the jungle, you can follow a trail up the waterfalls to the top and off into the jungle.", " We pretty much had the whole place to ourselves as it is rainy season. However, we had a great time swimming and jumping around the waterfalls!", " This is a beautiful waterfall with out all the tourist. While not as tall as the other waterfalls - this one has nice picnic areas, hiking trails and really cool limestone pools and cliffs.", " If you are looking for an amazing waterfall experience (sight-seeing, great photos, swimming, picnic, romantic or family adventure) but think Misol Ha and Agua Azul are too crowded, this is the place you're looking for. It's only 30 min away from Palenque, on the road to the Lacandon Jungle, it's quiet, it's clean, there are no vendors and their restaurant is simple but enough good.", " The waterfalls can't be described, but they are so pretty they don't look real.", " It is a total adventure just to find Asunsion, the waterfalls are amazing and it is so hard to get here that you may have the waterfalls all just for you, it took us so much time to get the little tiny &quot;ejido&quot; called Asunsion that we couldn't do the 45 mins walking to the big waterfalls, but we did the 10 mins walk to the small waterfall. We met a very kind guy called Melquiziades who guided us to the small waterfall and he offers to guide us to the big waterfalls when we come back with more time.", " It is a total adventure just to find Asunsion, the waterfalls are amazing and it is so hard to get here that you may have the waterfalls all just for you, it took us so much time to get the little tiny &quot;ejido&quot; called Asunsion that we couldn't do the 45 mins walking to the big waterfalls, but we did the 10 mins walk to the small waterfall. Now, here is the important part. How to get Asunsion:\n\n1. - From Palenque take the road to Bonampak ruins. You also can try to find the little town called Nueva Betania. 6.- Drive 15 minutes more on the dirt road, you will have a couple of hills, you will find some some little houses and a basketball court on your left. Our guide name was Melquiziades you also can ask for him.", " It is a total adventure just to find Asunsion, the waterfalls are amazing and it is so hard to get here that you may have the waterfalls all just for you, it took us so much time to get the little tiny &quot;ejido&quot; called Asunsion that we couldn't do the 45 mins walking to the big waterfalls, but we did the 10 mins walk to the small waterfall. We met a very kind guy called Melquiziades who guided us to the small waterfall and he offers to guide us to the big waterfalls when we come back with more time. 2.- Around one hour on that way, on your right you may see an entry that advertise some cabanas called Bajum Pakal, that place is currently closed, but it is a good referenfe. You also can try to find the little town called Nueva Betania. 4.- After around 20 minutes you will find Nueva Betania which is a very little town, you may cross the town through the main road and continue in the same road. 5.- Passing Nueva Betania, like 10 or 15 minutes after you will find a fork, take left. Park the car in the best spot you find around and ask for somebody who can take you to the waterfall or try to take the little path at the north of the basketball court.", " We spent 5 days in Chiapas, staying in San Cristobal de las Casas which meant that we drove 5-6 hours each way to see Palenque. We also stopped at the Agua Azul waterfalls which were beautiful. After Chiapas, we went to the east coast to Mahahual in Quintana Roo.", " We had a tip about waterfalls in the nearby jungle off the beaten path, and since it was so humid I needed a swim. Modest me stepped into the jungle to change into swimsuit.", " We had a tip about waterfalls in the nearby jungle off the beaten path, and since it was so humid I needed a swim.", " I loved Palenque!! In my opinion it can compete with both Tikal and Semuc Champey; thought those are bigget but/and much more touristic. Go with a local guide through the jungle of Palenque and visit the ruïnes. Take another day to visit Aluxes Ecoparque and visit the Agua Azul Waterfall (get a minivan or taxi, and let local kids show you around - for a fair tip, of course). I was with a guided tour, just make sure you know what you do and go with a group to the waterfalls.", " I loved Palenque!! Its has a densed jungle with interesting plants and animals, impressive ruïnes, and nearby one of the most beautiful waterfalls I have ever seen. In my opinion it can compete with both Tikal and Semuc Champey; thought those are bigget but/and much more touristic. I was with a guided tour, just make sure you know what you do and go with a group to the waterfalls.", " That was a great option for us. Sure, it was all up-hill on stone stairs (lots and lots of stone stairs) but we had the shade of the jungle, the company of waterfalls, and a glimpse of wonders to come.", " We took a tour from San Cristobal de las Casas to Palenque arriving in the afternoon after stops in Agua Azul and Miho Sol (waterfall).", " The waterfalls are spectacular on the way out make sure you check them out before going to the museum.", " Early in the morning, the mist still lies thick between the temples in the jungle. It has the jungle, the pyramids covered in vegetation, a small river, great views and waterfalls. Here you will pass beautiful waterfalls, a hanging bridge and still pools of water, and this is a great path to take if you want photos of the jungle and water shimmering with sunlight.", " Just a short drive from the city of Palenque. A couple of hours can cover the site. In fact, in 1 long day, we visited the ruins, the waterfall of ..Hu (1hour), the waterfalls at Agua Azul (2.5 hours) and arrived at 11pm to San Cristobal.", " And the walk to the waterfall was amazing!!!! It is a must!", "What to say, more beautiful finger, surrounded by nature, near rivers of waterfalls.", " The site is very easy to reach from the city of Palenque with some private bus with as little as 30 pesos, and after an entrance fee of 60 pesos you can finally visit the place. Take your time to visit it, and when finished, ask to the guide or to some people to indicate you one of the many waterfalls around the site to have a refreshing swim.", " Day three i would sleep in and see misol ha and agua azul waterfalls on way to san cristobal (the waterfalls are beautiful, especially misol ha). If you only have the time or money for a day in palenque, see the ruins and the waterfalls, but try to spend as much time as possible in this beautiful site.", " While i am sick of people claiming it better than tikal in guatemala (its not, tikal is better) palenque is worth every penny and minute spent there. If i were to go back i would try to spend more time. I spent two nights there, and wish i had more time so i wasnt rushed. If i were to go back, i would spend a full day in palenque ruinas (see the ruins, museum, and pay a guide about 100 pesos to take me out into the forest in search of monkey, birds, and waterfalls). I would spend day two on the long day trip (very long from what i hear) to yaxchilan and bonampak ruins. Day three i would sleep in and see misol ha and agua azul waterfalls on way to san cristobal (the waterfalls are beautiful, especially misol ha).", "I really liked this place...everything is green and the waterfall is beautiful!"], "monterrey": ["Nice walking and river tour.", " Even though it's not a natural river - it's perfectly clean (i.e. &quot;swimming pool water) and is made of cement with no plants - it is a refreshing place to go, dip your toe in the water or run your hand through one of the many waterfalls.", " There is a trail that takes about 40 minutes to walk, it is beautiful, it has bridges, waterfalls, a river, etc.", " If you like a little adventure in your travel then look up a guide and complete the Via Farrata in the Parque La Huasteca. The views of the area from up on the Via Farrata route  are amazing as are the guides and locals that will be on the climb with you.", " This place is beautiful for pictures. I love to come here with my family every time I visit Monterrey. My family likes to stop by the food stand at the entrance of La Huasteca park to buy some &quot;elotes&quot; Corn in a cup. They also sale other things I would recommend getting.", " I love to come here with my family every time I visit Monterrey. My family likes to stop by the food stand at the entrance of La Huasteca park to buy some &quot;elotes&quot; Corn in a cup.", " My family likes to stop by the food stand at the entrance of La Huasteca park to buy some &quot;elotes&quot; Corn in a cup.", " My family likes to stop by the food stand at the entrance of La Huasteca park to buy some &quot;elotes&quot; Corn in a cup. They are pretty good but don't expect the corn to be sweet like in the states.", " The Huasteca canyon is a beauty to look at in the mornings. If you happen to drive by close or on a high point in Monterrey you may have a fantastic view of the Huasteca with the dusk coloring the area. Or if you like the adventure you can take your bike and visit the canyon for a fun adventure. There are restaurants in Santa Catarina close to the Huasteca where you can spend an evening looking at the canyon illuminated by the moon while enjoying a nice diner.", " La huasteca has the most incredible geology as all this is limestone and was once part of an ancient sea bed you can find shells and sea fossils in the stones, Also see how the rock was folded, and created to look like curtains. It is also a place for rock climbers, best to go with a guide, and take care as the rock is fragile.", " This leads to the cascada (waterfall) and small river.", " If you want a long hike and get a swim in waterfalls and big holes with water, the park is the place for that. It is a very nice place, i enjoyed it a lot with friends."], "tepoztlan": [], "tuxtla gutierrez": ["The trip to the waterfalls at Chiflon is a must see and do experience.", " Spectacular waterfalls and rapids, zipline, nice small restaurant - there are 2 entrances and each takes you up a different side of the falls. Bit of a hike up but lots of places  to rest and you can zipline down over part of the falls. The southern (larger) entrance gives you views of the falls from across the river.", " About a 2 1/2 hour drive from Tuxtla just off highway 226 are the Chiflon waterfalls. Spectacular waterfalls and rapids, zipline, nice small restaurant - there are 2 entrances and each takes you up a different side of the falls. The highest and final one you see is &quot;Velo de Novia&quot;."], "oaxaca": [" The natural swimming pools are right on the cliff face, in fact there are no fences here and it is scary watching the people get to the edge. The waterfalls are referred to a ‘petrified waterfall’, they are unique and they are stunning. If you walk to the second ‘waterfall’ and there is a path down below the waterfall and the view there is awesome.", " The waterfalls are referred to a ‘petrified waterfall’, they are unique and they are stunning. If you walk to the second ‘waterfall’ and there is a path down below the waterfall and the view there is awesome.", " The waterfall and its surroundings are well worth the trip.", " be prepared to pay a toll on the way and from the waterfalls.. its a highway toll.. nothing you can do to avoid it.. but..  sadly there is a town toll before hitting the waterfalls... then you have to pay another fee to see the waterfalls and if you have a cab or car that is waiting for you, you gotta pay again for parking. IF you like to swim in some natural spring water, do it up, but its not a hot spring so be prepared for it to be chilly ...  dont bring a drone (they hate drones there), but go pros, selfie sticks, snap chat glasses, zoom lenses are all recommended.", " be prepared to pay a toll on the way and from the waterfalls.. its a highway toll.. nothing you can do to avoid it.. but..  sadly there is a town toll before hitting the waterfalls... then you have to pay another fee to see the waterfalls and if you have a cab or car that is waiting for you, you gotta pay again for parking. luckily its in pesos so it doesn't really hurt that bad. but even all that torment, its so worth it. If you like hiking, take the paths around the waterfalls.", "These petrified waterfalls are So beautiful.", " We’ve seen a lot of waterfalls but not petrified ones. These are a set of two falls.", " There are mineral pools at the top of the first falls in which you can swim. Most tours stop for a little more than an hour which would leave little time to both hike to the second falls and go swimming.", " We were on a tour with PITAO, and this was our last stop. The pools and rocks were so interesting, and the &quot;petroglyph&quot; waterfall was amazing.", " However, once you're there, go around the back and down the path to get some amazing views of the &quot;waterfall&quot;.", " It is a gorgeous place, you can swim in the pools (it is NOT HOT, very cold in fact) you can take a hike to see the waterfalls from below.", " We visited hierve el agua as part of a tour. The walk down to see the ‘waterfalls’ took about 10 minutes, and the pools were nice to swim in.", " 1.15 hour drive from Oaxaca are these very interesting petrified waterfalls. On an average monday there were not many tourists, you have great views on the surrounding mountains and can do an interesting walk to the foot of the waterfalls.", " Make sure you go all the way behind the waterfall so that it's on your left", " A definite must see when you're in Oaxaca. Make sure you go all the way behind the waterfall so that it's on your left", " The view of the petrified waterfall from the top of the pools is beautiful. I didn't have enough time (tour bus) to go down to the bottom of the waterfall, but the view from the top was fine.", " This place had some of the most amazing views I've seen. I didn't have enough time (tour bus) to go down to the bottom of the waterfall, but the view from the top was fine. When I went there was not too many people there, which was very nice.", " You will find amazing views and the natural waterfalls are beautiful! From there, you will start to climb through a rocky path all the way up until you reach  the mountain top, where the waterfalls are.", " Hierve el Agua is a bit of a drive but absolutely worth the trip. The &quot;waterfalls&quot; are beautiful and breathtaking, and be prepared for a fairly strenuous walk to the bottom to fully appreciate the size and scope of the falls.", "This waterfall is the 2nd one in the world, a must see place for their stunning views and natural water", " From the city of Oaxaca you can go there with a tour or do the adventure and go by bus - taxi - more bus - ride etc. Once at Hierve el Agua make sure to have some water with you, you can do quite some hiking. You can swim on the little lagoons with the amazing views, or hike down to the petrified waterfall.", "Beautiful mineral waterfalls!", " Dont forget your swimsuit and good shoes. The walk to the &quot;waterfall&quot; is great and a swim in the lake refreshing.", " The only place, as far as I know, where you can see similar waterfalls is in Turkey. They are mineral springs that look like frozen waterfalls.", " It is a bit of a mission getting there if you do not want to do a tour and not much cheaper.Its about  an hour and a half/two hours each way with the collectivo taxi and the truck.Its a short uneven hike to the &quot;falls&quot; to then see two MAN Made pools the second of which people swim in (the water is cold despite the bubbling ) I live in New Zealand and this site was nothing in comparasion to the falls there.If you are near palenque save your Mexican waterfall for Agua Azul.", " We had the best time, go around and down to see the big &quot;waterfall&quot; you do not need a guide it is very easy, 15-20 m each way.", " When we arrived we first passed by the pools and kept going down the mountain till we reached some springs and waterfalls, only after coming up we had a swim in the nice water.", " This mineral &quot;waterfall&quot; is amazing to see.", " What is an great drive before you enter the villages there are some signposts \n to the waterfalls. You have to pay buy the gate for driving to the car park and pay entre fee fir going to the waterfalls. The petrified waterfalls are great to see.", " First of all, let me say that this place has not waterfalls, the things you see are made of salt. The pools don’t go deeper than 4 feet.", " I joined local tour and Hierve el Agua was the last stop. Very beautiful nature scene, you can stand on the pool side to look back the waterfall under the sunset!", " This mineral &quot;waterfall&quot; is amazing to see.", " you can see waterfalls on the other side but it's not &quot;made of water&quot;, is pretified.", " Never seen anything like it. You can swim and it requires some hiking, but calcified waterfalls?", "The frozen waterfalls are, of course, not frozen at all but a compilation of minerals that have built up over the years to make what looks like waterfalls.", " Really pleasant day trip from Oaxaca, you can see the calcified waterfalls and take a swim. Facilities are excellent and there are lots of cheap places to eat.", " The adventure starts from getting there: don't take the tour (you won't have time to walk around), share a taxi (communato) to Mitla instead and a pick-up track to the waterfalls.", " The adventure starts from getting there: don't take the tour (you won't have time to walk around), share a taxi (communato) to Mitla instead and a pick-up track to the waterfalls. The waterfalls are petrified (the water is trickling though) and the place is very special and unique.", " The area Hierve del Agua contains petrified waterfalls where springs of mineral water have formed and run down the mountain. The first, which is closest to the entrance, has natural pools that you can swim in. Although hierve means &quot;the boiling&quot;, the water is not hot, it's actually referring to the appearance of certain spots where the water &quot;boils&quot; up from the ground. The second waterfall is a small hike down in which you can observe the natural beauty of the Oaxacan flora.", " The waterfalls are not actually water falls but stone! They are so beautiful. You can swim in them and they are soooo nice!", "Magnificent calcified waterfalls and beautiful scenery!", " Hierve el Agua is a bit of an experience. The trip involves getting a taxi/colectivo to Mitla, and then another to here. Hierve el Agua itself is a set of 2 petrified waterfalls. The closer one has small pools of water than you can swim or dip your feet in. The further one provides some beautiful views of the 1st waterfall, as well as the surrounding valley area. Lots of walking/hiking can be done around here, so be sure to bring lots of sunscreen and a hat/sunglasses as it can get very sunny/hot up here, despite the altitude.", " Then of course there is the petrified waterfall, whilst it is great to see it from the car park area, it is worthwhile walking to the top of the waterfall, this is only about 10-15 minutes and again well worth it.", "One of the only two petrified waterfalls in the world, a little far from Oaxaca, but totally worth it.", " The first waterfall is a 5 min walk. But please go to the other waterfall. It's a 20 min walk hard walk. It's not quite organised. If you can take your suiwsuit it's a good idea.", " I guess after the waterfalls of Palenque it was kind of anticlimactic.", " Walk around the place if you feel a little adventurous, and don't feel like just staying at the top looking the view (although I understand if that's what you like, because it's quite pretty and relaxing) But you can walk the path and get to the top of the actual waterfall, take a picture there, and then take anoter path that will take you down. It's not a long way from the city, but it will take you some time, plus the time you spend there, I would say you need a day to visit and enjoy. You can also swim there and last time I was there they were building a hotel but I'm not sure it's working yet.", " Yes, the petrified waterfall is what you go there for, but the scenery is gorgeous. Walk around the place if you feel a little adventurous, and don't feel like just staying at the top looking the view (although I understand if that's what you like, because it's quite pretty and relaxing) But you can walk the path and get to the top of the actual waterfall, take a picture there, and then take anoter path that will take you down. And then keep walking and walking and walking (please take water with you) and you will end on the oposite end from the important waterfall.", " For those brave enough you can take the small hike to the waterfalls and then come back around to the natural spring where they allow you to swim."]}