{"zapopan": [" An upscale  shopping mall to rival any in the US. Conveniently located with Costco withing walking distance to the mall.", " We got there early on a Saturday - which was good because later it is very crowded. We walked most of the mall and shopped at a few places. We'll be back again soon.", " This is a very nice, quality mall. We got there early on a Saturday - which was good because later it is very crowded.", " There are also Sears and Sanborn's department stores too. A mall in which you will surely find what you are looking for due to the diversity of commercial stores that it has.", " A mall in which you will surely find what you are looking for due to the diversity of commercial stores that it has.", " A big shopping center. It has modern architecture and a lot of stores. It has a wide variety of brands of clothing, food, accessories, among others. At the other end there is a Liverpoool Department store.", " This mall is quite good, it have a lot of interesting sites, cinemas, coffee shops, banks, retail stores, tech stores, toy stores, etc.", "Is nice place to shop, there are more than 100 shops, restaurants and coffee shops is not the traditional Mexican place is more like America Mall, there are Pandora shops, American Eagle, Starbucks coffee, is the place that Mexican high class teens visit, is secure and you can buy with international credit cards as well debits card", " Inaugural visit to this mall was a very pleasant surprise - there is something for everyone here. Many trendy shops, restaurants and large department stores as well as nearby access to some notable &quot;big box&quot; stores (Costco, Super Walmart and Sam's Club).", " If you want to be there at this mall, surrounded by big &amp; \nExclusive Brand stores, everyday is a good time to do it!", " This mall has almost everything but it's better if you arrive in a uber or taxi because the mall is to Crowder.", " Andares is a very high end mall in Zapopan. It has everything from Movie Theaters VIP to Rolex and Food Courts.", " This is a first world place to enjoy a shopping and fun day in Guadalajara. A must in the city!!", "Great mall for shopping and hang around.", "A great place for shopping and eating, with world class stores, restaurants, movie theaters and facilities...", "This is a high-end open air mall that's a great place to walk around, hang out with friends or people watch.", " This has to be my favorite place to hangout here in Guadalajara, not only you can go shopping but also go to the movies, drink a coffee or taste the best fresh baked cookies in the whole city from &quot;The great American cookies&quot;. It's an attraction one can't miss, plus what I also like about this mall is that it's surrounded by green areas and it is family-friendly having places where your kids can play and run around.", " It's an attraction one can't miss, plus what I also like about this mall is that it's surrounded by green areas and it is family-friendly having places where your kids can play and run around.", "A great shopping mall, outside patio feeling, brand stores, good prices, good restaurants.", " Andares shopping mall is one of the best malls in Guadalajara. This mall is modern day Guadalajara the surrounding area has many new High rises under construction. The mall itself is clean spacious and very contemporary. The restaurant are open air dining great choices from Steak to Asian. You won't be disappointed it is a shoppers paradise bring your American Express card.", " Andares shopping mall is one of the best malls in Guadalajara. The restaurant are open air dining great choices from Steak to Asian.", " Andares shopping mall is one of the best malls in Guadalajara. This mall is modern day Guadalajara the surrounding area has many new High rises under construction.", " This mall is an all-day event and a great experience even if you are not there to shop. And wear good walking shoes .", " The mall has 3 levels of stores. This mall is an all-day event and a great experience even if you are not there to shop. It could be in the form of a Mariachi band, a lone clarinet player playing some awesome jazz(my favorite), or a troupe of dancers.", "Open air mall, beautiful landscaping and architecture.", " A great place to shop and dine at Guadalajara. Its a nice outdoor mall with good brands and nice restaurants. It also has a corporate building, residential towers and a nice hotel.", " I have been few times to andares and each time i try to explore more and more.. if u go on sundays you will see most of the restaurant are nearlly full and shopping mall too ..i think one of the most happening and luxurious places in gdl o zapopan ..you can go shopping o enjoy cine o enjoy variety of food.", " This mall is a clear example of modern México. It's a great place for a spare afternoon. You can have from a refreshing icecream with your kids to a great bussiness dinner in any of the high level restaurants inside the mall.", "Many shopping options and two staple stores, Liverpool and Palacio de Hierro which offer name brand clothing but with a way higher price than the US, there are also many dining options as well as a movie theater.", " I had to spend about a month in Zapopan and my hotel was in walking distance to this mall. We almost literally spent all of our days or evenings here.", " I had to spend about a month in Zapopan and my hotel was in walking distance to this mall. I loved the shopping here, and the food. I love out door malls and this location was one of the best places, there is so much to do and eat here.", " I had to spend about a month in Zapopan and my hotel was in walking distance to this mall. I loved the shopping here, and the food.", "Really Nice mall to visit, with Lots of different stores.", " This place is the best shopping center !", " You can even find a great spot where kids can stay while you do your shopping. The mall is indoor and outdoor.", " There are a couple of reasons that this is not my favorite mall, parking can be somewhat confusing and the design of the mall, which I find a bit confusing as the mall is three stories of shopping options with several centers from which radiate the specialty stores .", " The city`s largest mall has something for almost everyone, fashion, sports, specialty boutiques, movie comples and eating options . There are a couple of reasons that this is not my favorite mall, parking can be somewhat confusing and the design of the mall, which I find a bit confusing as the mall is three stories of shopping options with several centers from which radiate the specialty stores . All in all this is a mall worth visiting, there are two anchor stores at either end of the mall, Liverpool and Sears which offer shoppers everything from home furnishings to fashion.", " My wife and I enjoy this mall more than the others int he city.", " My wife and I enjoy this mall more than the others int he city. It has a great variety of stores and restaurants.", " We like to shop here, walk the mall and get a bite to eat. We go here at least one time per month.", " My wife and I enjoy this mall more than the others int he city. We like to shop here, walk the mall and get a bite to eat. Because this mall is popular sometimes parking is a challenge. But it is worth it.", " Fun fact, went there for a pair of pants and all the stores have tailors​ and you have to wait around 50 minutes for them to take measures and cut them and get them ready for you unlike any US mall.", " the mall is pretty nice, it has some nice shops for clothes, especially for sports. it has a cinema and a few restaurants.", "A great shopping mall, the fact is the place is not huge, medium size.", " This mall is by far well located. It has restaurants, mini-bars, a theater and many departamental stores.", "The mall is big, have some stores like Zara, fabricas de francia, sanborns, etc.... the third floor is food!!", "As other shopping malls in other big cities, it is just a big mall with many shops, restaurants and theater.", "Nice mall with lots of clothing and shoe stores.", " We went to check the mall for dinner and shopping. The mall has a good selection of shops and it takes a while to see the place around. We did not come across a decent shop map in the mall, there might be one though. The mall is clean and safe with prices well on level with expectations for this type of place. In the mall the noise level was quite high as well due to a band that was playing at the atrium.", " We went to check the mall for dinner and shopping. The mall has a good selection of shops and it takes a while to see the place around. We did not come across a decent shop map in the mall, there might be one though. The mall is clean and safe with prices well on level with expectations for this type of place. We had our dinner at Chili's where the service was good and meals were tasty as well.", "Gran Plaza is a great mall with many restaurants and nice stores.", " It is a very pleasant and safe mall, people can be assured that they will not be molested, and especially not when not provoced."], "leon": [" This mega shopping center is huge \nAnd has everything, restaurants, food court in the third floor and all the brands. This mall is even better than some US shopping malls", " This is a relatively new, large, semi-enclosed, two-level, regional fashion mall with a large Liverpool department store, a very large H&amp;M, fast fashion leader Zara, a C&amp;A, and a variety of other fashion stores, along more than the usual number of restaurants and a cinema multiplex (Cinepolis). Visibility from the adjacent Blvd.", " This is a relatively new, large, semi-enclosed, two-level, regional fashion mall with a large Liverpool department store, a very large H&amp;M, fast fashion leader Zara, a C&amp;A, and a variety of other fashion stores, along more than the usual number of restaurants and a cinema multiplex (Cinepolis). Torres Landa). The project is located just south of the Centro Max shopping center, a Home Depot, a Costco and a Mega hypermarket. This project does not have quite the number of stores that Plaza Mayor (in the north of Leon) has, but it has a better layout and design and offers a better pedestrian experience. The project presents a bold and colorful facade to Blvd. This project can not begin to compete with the large shopping centers in Mexico City, but for the Bajio, this is a good project and is definitely a place where one can spend a pleasant afternoon.", " this is a great shopping mall, it has everything, and its the best one in the world, we loved it.", "It is really,really big their are stores lots of everything their are restaurants,game area,movie theatre and lots more.Its a great place to go shopping 😍", " Zona Piel covers about 6-8 blocks (each one seems to focus on a particular type of apparel (one block is mostly hand-bags, another is jackets, another is boots, etc). The blocks surround a shopping mall (make sure to go inside for some really upscale leather good from the stores like Cuadra.", " Zona Piel covers about 6-8 blocks (each one seems to focus on a particular type of apparel (one block is mostly hand-bags, another is jackets, another is boots, etc). Also note that there are a few steak houses very close to the mall. The leather goods are of varying quality, so shop around before you decide what you're going to buy.", " The blocks surround a shopping mall (make sure to go inside for some really upscale leather good from the stores like Cuadra. The leather goods are of varying quality, so shop around before you decide what you're going to buy.", "Many shopping options for leather goods.", " There are hundreds of leather shops as well as fabric stores and a huge leather mall. I buy my indoor/outdoor fabric in Zona piel for a very low price.", "This is a large leather goods shopping center.", " Going to try and keep this short: If you are in or near Leon, go to the Leather area. We visited the Leather Stores/Stalls/Shops right across the street from the bus station.", " Shopping in the leather district is a must-do for visitors to both Leon &amp; nearby Guanajuato. Easy to get to, the bus station is in the heart of the district. It's tempting to wanna start at the Plaza De Zapatos at the entrance to the district, but that's no different than shopping at any mall in the US.", " The stores are all independent, and there are large open-air walkways to accommodate the crowds. They have a food court, and clean bathrooms throughout the mall.", "Open air mall with parking lot, ideal for shopping because of the variety of stores you can find.", " This mall is split into two sections, old and new, if you need to shop for something you will likely find it here, they even have some local leather goods sellers (more of the designer type but still local).", " This &quot;shoes mall&quot; is definitely overrated. Nothing special about the stores or the shoes they offer.", "I didn't see any good deals or even better prices here than you would find in a regular Mexican mall.", " This small to medium sized leather products mall sits on the main intersection entering the very large Zona Piel. From our experience, shopping the &quot;zona&quot; is more fun and has a great deal more character.", " I think it is a nice place to shop for leather shoes and accessories. I also have to mention that you have to have the time to look around and compare prices. I spent about two hours in here and I did not get to go to every store I wanted to go (because they were about to close). Also, I remember seeing many stores that offer many pretty, sophisticated and modern styles for men, women and children contrary to what another reviewer mentioned about seeing only cowboy boots. I also saw some of the reviews mention that you can walk up two streets and find another mall with shoes and leather goods, yes it is true! If you are looking to spend less money then I would suggest going to the neighboring towns, like Celaya. Personally I bought from the Plaza del Zapato because I knew I was getting genuine leather and I also feel good helping the local and state manufacturers.", " I also saw some of the reviews mention that you can walk up two streets and find another mall with shoes and leather goods, yes it is true! but you have to be aware that many of those shops sell counterfeit items.", " Sure it was a two story mall with nothing but shoe stores and a couple selling leather accessories, but we found it sterile and lacking the character of the adjoining Zona Piel. The stores reminded us of just a concentration of shoe stores found in most any mall. We had visited the Zona Piel briefly two years ago and there was a noticeable lack of counterfeit merchandise that was so prevalent two years ago.", " Sure it was a two story mall with nothing but shoe stores and a couple selling leather accessories, but we found it sterile and lacking the character of the adjoining Zona Piel. The stores reminded us of just a concentration of shoe stores found in most any mall.", " Sure it was a two story mall with nothing but shoe stores and a couple selling leather accessories, but we found it sterile and lacking the character of the adjoining Zona Piel.", " Near the bus station which is at least a mile (2 kms) from the downtown is the Plaza del Zapato which is a two story shopping mall with only shoe stores. They have men's shoes, women's shoes, athletic shoes, bargains, etc. Across the street is another mall with two floors (Plaza de Piel) with only leather goods. They have purses, billfolds, jackets, belts, and more.", " Leon is a large city but with a nice downtown and a really beautiful main plaza. Near the bus station which is at least a mile (2 kms) from the downtown is the Plaza del Zapato which is a two story shopping mall with only shoe stores."], "ciudad juarez": [" We enjoyed shopping here. They have a variety of stores as well as a movie theater. Lots of fun things for the kids to do.", "When receiving visits from out of town, family or business, take them to the mall, you'll have choices for eat or just enjoying time.", " I enjoyed Las Misiones mall, they have a lot to eat at the food court from Mexican to typical American food. It is a family place and safe. My friends whom have lives in Juarez never had visited until I came into town, they really liked it and have gone back since then.", " The mall is 2 stories you shopping, eating and fun. You can definetely spend the whole afternoon here if you are stuck in Cd Juarez.", " I enjoyed Las Misiones mall, they have a lot to eat at the food court from Mexican to typical American food. The mall is 2 stories you shopping, eating and fun. If you eat at the mall, you must try eating at &quot;El Tacotote&quot; -ah their bistec tacos and guacamole are delicious.", " Has an Imax theater and also a skating rink as a place for the kids to jump. Went to the mall everyday while in Juarez.", " This mall has a lot to offer. It has a large food court with several options. It also has several bug chain stores like Sears. Went to the mall everyday while in Juarez.", " Never been to a mall in mexico its a great place there alot of games for children but was only there for 15 min just did a quick tour and left.", "Is a very complete mall, you can eat, see movies or have fun on the adventure park (small, but very good)", " This mall impressed me alone for the city of Juarez because of all that it offered for families and everyone!", " I had been to this mall several times in the past. It has slowly morphed into something better as some stores come and go and new ones come.", "Nice mall with a movie theater and a arcade for the kids.", " We like to come here occasionally to the movie theater. It is huge, modern, and has many stores to sel you over-priced clothes and gadgets. It's so much nicer that you no longer have to pay parking---but it is always crowded!", " So if your in Ciudad Juarez for Immigration stuff this Mall is great to come to to spend the time your not in the Embassy. They have movie theatres, restaurants and stores to keep you busy.", " And the department store Sanborns has a store in this mall. This is a great chain of department stores in Mexico with a little bit of everything, plus a restaurant open late. This mall is located near the US Consulate so it's well situated.", " This mall is very close to the Consulate. This mall is much nicer than the so called The Torres &amp; Downtown shops.", " Its definitely the best mall in the city, You can go the movies and eat dinner afterwards. Go to VIP Cinepolis, its the best.", "This is the only mall in Juarez than can be call &quot;Mall&quot; the other are flea markets whit roofs.", "This is a great place to visit, has a lot of cool stores, the best movie theater at the city, has a great place to get food, great restaurants, yeah great place for kids and a family visit, a lot of place with arcades, pizza, movies, great food, ice cream, toys and a lot of cool stuff.", "By far the best shopping center in Juarez, you can find clothing stores, barbershops, a wide selection of places to eat and an amazing movie theater.", " The movie theater and activities in the mall outshine malls in the US. I was shocked to see how much more they have than what we have in the US. To have the same type of things that are in malls in the US and more PLUS everything is much lower in price here makes this my new favorite place!!!", " I am happy to have my mind blown in Juarez. The city has come so far in 5 years. Parking is secure and the mall is super clean!!", " Im from Las Vegas and I could see this mall there. It is gorgeous.", " The movie theater and activities in the mall outshine malls in the US. I was shocked to see how much more they have than what we have in the US.", " Im from Las Vegas and I could see this mall there. The movie theater and activities in the mall outshine malls in the US. Parking is secure and the mall is super clean!!", " The mall is beautiful and clean. We went to Cinepolis VIP movie theatre and it blew our minds compared to any movie theatre we had ever been to in the US.", " Exceeded my expectations. I went to the movie theater inside and saw 3 diifferent movies one which was a 4dx movie! i really recommend it!. fyi, i was located in a hotel nearby due to my husband's cosular interview.", " My kids loved happy land it has games prices and snacks a great place to let them run around. The best part was Sunday they had mass right there in the mall.", " I never would have thought they would have such a great mall. It had everything . The mall helped relieve our boredom. The best part was Sunday they had mass right there in the mall. All in all I loved the mall.", " I never would have thought they would have such a great mall. The food court was amazing except for a rib place nasty!! My kids loved happy land it has games prices and snacks a great place to let them run around. Since our family had so much to be grateful for I was happy I could thank God right there and not wait till I got home. All in all I loved the mall.", " Las misiones is the newer shopping center in ciudad Juarez. It has some nice stores but nothing fancy.", "I was very impressed with this mall, you don't find this kind of malls in the border towns of mexico, there are many options to dine, from your basic Mexican or American fast food, to some very decent steak house, applebees, comicx or other options.", " I enjoy coming to this mall when I visit family in Mexico.", " I enjoy coming to this mall when I visit family in Mexico. It has a very nice movie theatre. It has great stores such as Liverpool and Sanbournes. It has a variety of food choices in the food court and the ambience is lovely.", "Nice place for shopping, watched some movies in the movie theater with the family.", " Although not Catholic, I always enjoy visiting this place whenever I walk across the border to visit the nearby museum of the Mexican revolution or the Mercado Cauhtémoc. Walk across the Santa Fe St. bridge from El Paso  (there's about a 50¢ crossing fee going &amp; 30¢ returning). Benito Juarez is being turned into a pedestrian walking mall &amp; is completely safe. Do not bring a gun into Mexico."], "tijuana": [" I want to make clear, this review may be a little biased, as Playas de Tijuana is my home town. Everytime I go visit, I am always so glad to be in Playas, it is quiet, peaceful and just nice! We do enjoy walking on the boardwalk, coffee, a coconut or cool drink off many of the locally owned coffee shops and snack bars. Nowadays, Playas has a mall, movie theater, many restaurants both locally owned as well as chain American restaurants. It's a suburb so don't expect the ruckus you'd expect in the more tourist areas, don't expect endless bars or people trying to sell you blankets, piggy banks and other crap you see alongside the border or downtown areas. Enjoy healthy dining at the Yogurt Place (b-fast, lunch and dinner), stop for hand-crafted coffee at Cafe Latitud 32 (you would need to go down to the boardwalk to find it), if you lucky  you can see a live band playing. A MUST is tacos from EL FRANCES... opened at night, they use the best cuts of meats, fresh home made tortillas and all the delicious fix-ins.", "When in Tijuana, do stop by this fairly good sized indoor/outdoor mall with all the services.", " Unless you like freak show, then go to Avenida Revolucion. Once we cross the border, we headed to Avenida Revolucion just to do tourist thing. Plaza Rio on the other hand is where the locals go. Avenida Revolucion is a theme park for gringos to see what &quot;Mexico&quot; ought to look like. Our main reason for visiting was for Mini City (recommend for elementary school kids). We ate at Furasshu (Japanese Teppanyaki place). We wish our kids weren't as tired from Mini City so we could explore more stores. It charges by minute with something like 12 hour parking fee of 100 pesos (about 5 bucks). This mall it outdoor so it may not be the best place to roam around on a rainy day.", " A great place to peruse and grab a coffee... its like a strip mall... if its raining...unlikely ..but then this would not be good .. Has a great movie theatre and plenty spend your money on in. Its safe and has a good police presence!", " Good selection of restaurant choices.They have good entertainment as well, such as, a movie theater and a play place for kids and teens.", " This is a very nice plaza and has stores for just about anybody. It is located near the border and close to other places to visit such as bars across the street for a good night life and the Cecut, which included an IMAX-like theater, museums, and an aquarium.", "Mall was a standard type mall with some amazing department\\grocery stores.", "this is a very big mall\nwith lots of shops around, restaurants, travelling agency, banks, Cinema, etc....\na nice place to kill sometimes, get some good food, watch a movie or just relaxing....\nhere also have a ground for some show for the performers in the weekend...", "Just across the border in the RIO area is the RIO  MALL.", " It's within walking distance of the border, if you choose to walk across. They've got great stores and good food. They even have a small Caliente casino.", " you would come here to kill a bit of time.. didn't go into many shops to see the difference in price.. but with it being an open mall, there is no chance to escape the heat of the day.", "It's a good mall, very similar to US malls.", " Not your normal food court with chains, but I believe this is a must stop in Tijuana. This mall had a nice bard on the outside and your big normal chain stores.", " I had a tour guide that led me to this mall and I was really impressed. Not sure if it was the main food court to the mall. They had craft beer and Mexican fusion dishes in there.", " I had a tour guide that led me to this mall and I was really impressed. I was really impressed with the Food Court called &quot;Food Garden Plaza&quot;. Not your normal food court with chains, but I believe this is a must stop in Tijuana. I had Mexican Ceviche that was better than any I have had in the USA. This mall had a nice bard on the outside and your big normal chain stores. I would suggest stopping here after viewing some of the older historic points in the city.", " I was really impressed with the Food Court called &quot;Food Garden Plaza&quot;. Not sure if it was the main food court to the mall.", " Not sure if it was the main food court to the mall. Not your normal food court with chains, but I believe this is a must stop in Tijuana.", " This mall made me forget that I was in TJ. This mall has shops like Sephora, Apple Store, Starbucks, and a very huge movie theater. I walked around the mall for a while and checked out all the stores. I found mostly nice helpful people working at the stores, most in their 20's and thirty's.", " Great shopping mall in downtown Tijuana, and they have both a Cinepolis Movie theater and a Cinepolis VIP Movie Theater. They also have a great food court and you can pretty much find anything you need here.", " No matter if it is week day or weekend, there is always something interesting to do from art gallery, exhibits and conventions to food and crafts festivals you will always have great moments in this cultural center. The place has a nice coffee shop, a theater, a souvenir and books store, an IMAX dome and a bistro restaurante named El Cubo among others.", "Place has movie theaters, plays, great place to take a break- has IMAX - very friendly people in the area.", " A great place to visit! My children especially love the imax movies! Enjoyed it with my family.", " They also have art exhibits on the cube. On sundays everything is FREE!! The IMAX theatre is very cool, just seat all the way on the top so you don’t get dizzy.", " The IMAX was running and was great value for us.... about $1.00 for both of us...", " The IMAX was running and was great value for us.... about $1.00 for both of us... If its a rainy day your in out of the weather and you can spend a few hours there.", " The main exhibit displays the history of Baja California from the dinosaur age to around the setup of the new US Mexico border. Don't just come to take a picture of the dome that houses the IMAX theatre but go into the complex and spend a couple of hours, also go into the botanical gardens and have a stroll. Entrance to the museum is free but there are charges for the IMAX.", " While visiting we decided spontaneously to visit CECUT to see a movie in the IMAX Theater. We were surprised to find that on that daythere was a celebration of the three holy kings on that day in Mexico where a special sweet bread is eaten traditionaly on that day called &quot;Rosca&quot; and that around the entire theatre there was a huuuuge rosca that was being given away. There is an Elevator for disabled guests which was good. Did not have more time to explore the rest of CECUT.", " While visiting we decided spontaneously to visit CECUT to see a movie in the IMAX Theater. The takes were wonderful and the audio magnificent.", " While visiting we decided spontaneously to visit CECUT to see a movie in the IMAX Theater. We were surprised to find that on that daythere was a celebration of the three holy kings on that day in Mexico where a special sweet bread is eaten traditionaly on that day called &quot;Rosca&quot; and that around the entire theatre there was a huuuuge rosca that was being given away. It was atreat for the children as well as for us.", " I could have spent HOURS going through it all. Would have loved to take in one of the movies at the IMAX, but not enough time.", " All the time I went tijuana we visited  because siempre tiene cosas muy  interesante I like most the imax theater but if you only want to relax walk at botanical garden love it", " I looked for examples of the fish found around the Baja Peninsula. It does have an IMAX theater, but I'm deaf, there was no use seeing that.", " I was a regular in the Monterey Aquarium, different art galleries, and the Smithsonian museums. I looked for examples of the fish found around the Baja Peninsula. It does have an IMAX theater, but I'm deaf, there was no use seeing that.", " My expectations were [ridiculously] set too high. I do like the building, walking into a ball---cool. I was a regular in the Monterey Aquarium, different art galleries, and the Smithsonian museums. I hoped to see an exhibition of the Mexican Revolution, but didn't see one. I looked for examples of the fish found around the Baja Peninsula. It does have an IMAX theater, but I'm deaf, there was no use seeing that. The beautiful artwork that was in place caught my eye, and made the trip worthwhile.", " I've been several times at CECUT every time a great experience. It's a very interesting place, not just for the building itself but for the ever changing art galleries, the projections at the IMAX, teather plays, and expos.", " It's a very interesting place, not just for the building itself but for the ever changing art galleries, the projections at the IMAX, teather plays, and expos.", " &quot;La bola&quot; as locals call it always has something to offer. The IMAX teather keeps it interesting and the art exhibits and library are very cool.", " It features an Imax theater as well as a performance theater and several rooms with art and other exhibits. This center houses &quot;Museo de las Californias&quot; (Californias Museum)\n The museum shows the history of both Californias; higher and lower. From the first inhabitants in the area to the arrivals of Spaniards and other peoples in the area.", " I visit it whenever I have a chance. It features an Imax theater as well as a performance theater and several rooms with art and other exhibits.", " The imax runs every hour. Imax was about the same. Plan for atleast an hour in the gallery.", "The IMAX is very good priced, about 2 bucks US and there was 4 options of movies to see.", "great place to  spend an  afternoon  or  weekend  with  family, they  have  great  public  event,  free of  charge, and  new movies  on  imax  very  afortable", " We went to the museum and is very interesting , it is called &quot;El museo de las Californias&quot;. Also we watched a movie in the IMAX theater and it was a fun experience. The day we were there an orquestra was having a free concert.", " IMAX, and other auditoriums make it very comprehensive.", " Every time i have gone, i always wish to have time to do it more often. I could be on IMAX, theater or exposition, its alway a great experience.", " I could be on IMAX, theater or exposition, its alway a great experience.", " We visited the imax theater viewed the Pandas being introduce back into the wild, didn't turn out well for them. Visitors this is a place to visit. Weekends are a place for arts and crafts.", " We were impressed of the design of the Cultural Center, clean, simple and beautiful. We visited the imax theater viewed the Pandas being introduce back into the wild, didn't turn out well for them.", "excellent family fun\nmust be aware of the ULTURAL events that occur in the main concourse CECUT\nalternative cinema, imax screen, theater and many other event\nFree museum Sunday\n\nexcelente diversion familiar\nhay que estar pendiente de los eventos ulturales que se presentan en la explanada principal del cecut\ncine alternativo, pantalla imax, teatro y muchos otros evento\ndomingo de museo gratis", "Great Theatre, IMAX, museum and exhibit space.", " The Tijuana Cultural center and in particular the IMAX theatre are an incredible deal, for less than $5.00 Dollars (including parking fee) you get to see Imax movies in all their glory, I just saw a documentary of US National Parks and it is impressive, the place is clean and orderly.", " Cecut is a not to miss. A few yards away is a wonderful IMAX theater.", " It may be a difficult to communicate in spanish, but this place offer a lot of options from expositions, children activities, imax movies and even an aquarium. the entry for the cecut is free, but if you want to watch any of the imax, special events or the aquarium, you will need buy tickets for those particular events", " CECUT is a world-class museum and cultural center that offers a variety of reasons to visit:  permanent museum exhibit of the history of Baja California, IMAX theater, traveling exhibitions, meeting halls, cafeteria, aquarium, events on the esplanade that range from music, to art, to crafts markets, etc.", " This cultural center has several exhibits and even offers IMAX! The multi theaters gives CECUT a multi dimensional articulate setting.", " It's one of a kind, iMAX Cinema, it a point in Tijuana were you can find culture and history in one place.", " Great place to go, even there imax is one of the best one I been ever in my life.", " Got a coupon from a server at a restaurant for 3 documentaries at the IMAX theater at the Tijuana Cultural Center and had a great time! I had never visit the center  before and I'm glad I did. After watching the three documentaries, I went to see 3 additional exhibits: one for Frida Kahlo, another had part of the personal art collection of Carlos Slim from the Soumaya Museum in Mexico City, and yet another exhibit had art made by local Tijuanans, very interesting!", " Got a coupon from a server at a restaurant for 3 documentaries at the IMAX theater at the Tijuana Cultural Center and had a great time! I had never visit the center  before and I'm glad I did.", "This is the best cultural place to go, you can see expositions, imax movies, plays, state of the art installations, parking fee not cheap.", "IMAX movies, great historical museum, art exhibits, garden with indigenous statue reproductions, book store and gift shop,  art classes, kids area to explore books and make art.", " Went with my two boys to see the dragons movie on imax and they were impressed with the facilities and movie", " Loved their Frida Kahlo exhibition as well as their IMAX dome, and their cafe!", " Loved their Frida Kahlo exhibition as well as their IMAX dome, and their cafe! It's a must visit and it's FREE (except the IMAX movies)!", "went to Mercado Hidalgo and decided to take a walk to Tijuana Cultural Center, almost empty place, no too much to see, one o two expositions.. nothing interesting.. continued to Plaza Rio Tijuana Shopping Mall for a diner", " CECUT center is a must visit if you are in Tijuana, it's a Culture Center, ... It has a historic museum , and a theater that host a variety of events. From Musical , theater shows, Concerts, it has a OMNIMAX Theater, lecture rooms , with top writers.", " Everytime my family and I visit Tijuana, we make it a must to watch a film at the IMAX theater. Our only complaint is that the A/C was not working and it was very stuffy in there.", " Everytime my family and I visit Tijuana, we make it a must to watch a film at the IMAX theater. Any film before 11am is only $1.50 which I think is a steal.", " Everytime my family and I visit Tijuana, we make it a must to watch a film at the IMAX theater.", " A very good place to visit for fun or just to know more of the cultural things related to Tijuana, there are small restaurants , big circular screen movies, theater, music, museum, art exhibitions, documentals, and a friendly staff. they have big and accesible parking lot.", " Close to Rio Mall or Galeria with nice expositions going on at the time of my visit, righy after the visit just cross the street and have a nice bite at the mall which is well served of a variety of kinds of restaurants.", " we viewed the exhibit on Baja California. Was interesting to see from their perspective. The IMAX has good reviews but it makes me seasick so we didn't see it.", "The options are very good, you always have a good educational movie in the IMAX, several expositions of art.", " Everyone who visits Tijuana should try to find some time to visit the Culteral Center (Spanish Acronym CECUT). There is a lovely free botanical garden, an IMAX theater, a concert hall, a permanent history of the Californias exhibit and multiple traveling exhibits. The new section of the building called &quot;El Cubo&quot; is a modern art exhibition space that rivals any similar space in San Diego. There is always something interesting going on at CECUT. Also, Sundays are free admission days for everything eXcept the IMAX theater and the concert hall.", " Attractions include Imax, art galleries, exhibit on the history of Baja, aquarium and while we were there a performance of traditional Mexican dancing.", " Attractions include Imax, art galleries, exhibit on the history of Baja, aquarium and while we were there a performance of traditional Mexican dancing.", " Loved the Cultural Center in downtown Tijuana. We visited on a Sunday so some attractions were free. Attractions include Imax, art galleries, exhibit on the history of Baja, aquarium and while we were there a performance of traditional Mexican dancing.", " Have attended concerts, comedianes and art displays many times at CeCut. Centrally located in Zona Rio CeCut provides a wide variety of events and activities throughout each month with special artists, IMAX theatre films, political and cultural talks as well as just fun entertainment. Do not miss CeCut if you have the time while in Tijuana.", " As my hometown i recomend the CECUT as the place ti visit while in Tijuana. It has a museum with Baja California history, art and photo expos all around the year, an aquarium, free matinee, shows, concerts,ballet,theater &amp; the IMAX dome known in here as &quot;la bola&quot; . Also 1 Saturday of each month they have a presentation of the juvenile symphonic of Baja California and you can spend a nice evening with your family or friends for free.", "Museum , IMAX theater and gallery all combined what else can u ask for, near to the shopping center mall and food district", " Since the new director arrived CECUT has gottn a facelift inside and out. If you haven't been there for a while I definitely recommend you go again...Love watching the IMAX movies", " CECUT really has lots of nice expositions every now and then. Not to mention, the screening of many foreign films and the IMAX dome which is a landmark of the city. They added an aquarium that is good for the price you pay (about 3-5 Dlls I think) some really nice fish but it's pretty small.", " We spent five hours here seeing exhibits in the Cultural Center and an IMax movie in the beautiful theatre known as &quot;La Bola&quot;. On Sundays the museum is free and other tickets are discounted.", " We spent five hours here seeing exhibits in the Cultural Center and an IMax movie in the beautiful theatre known as &quot;La Bola&quot;.", " I was surprised at what this place has to offer. It has an Imax and several different exhibits displaying local Indian and Mexican history. This place brings it to life along with the local history relative to what was going on in the world at the time.", " When you enter the museum, called &quot;Museo de las Californias&quot; (museum of the Californias) you are greeted by several acrylic cloth works hanging from the ceiling, depicting varied points of view on living in a border city like Tijuana. There is an Imax theater, a Film Club area and a performance theater.", " A nearby modern shopping mall has several options for dining. The center is easy to find and parking is available, but re-crossing the border is a nightmare.", " CECUT is a fabulous establishment. Its exhibition on Baja alone is worthwhile -- highly creative and excellently executed. And then there is the IMAX cinema and all sorts of other activities.", " Saw a movie their theater, seats not as comfortable as a Cinepolis and small screen. The IMAX theater needs better titles like USA IMAX locations. Remodeling was in progress, hopefully it will improve the visit the next time.", " Saw a movie their theater, seats not as comfortable as a Cinepolis and small screen.", " Took taxi drive to museum, ($3.00) and was kinda lost when I got there. They are working in construction onsite and I didn't even know if the place was open. I was so lost and confused, but I asked and was directed to the ticket booth where I paid $5.00 for three tickets to see the exhibition &quot;Las Californias.&quot; My teenage kids and I were very well pleased with the exhibition. It was very, very nice and we were able to take pics of almost everything, except the wall paintings. I had to leave my backpack at the entrance and claim it after I came out, but that was okay. I didn't have anything important in the bag. I would've loved to stay to watch a movie in the imax theater, but my teenage son didn't want to wait until 4 p.m. for the show.", " I was so lost and confused, but I asked and was directed to the ticket booth where I paid $5.00 for three tickets to see the exhibition &quot;Las Californias.&quot; My teenage kids and I were very well pleased with the exhibition. I would've loved to stay to watch a movie in the imax theater, but my teenage son didn't want to wait until 4 p.m. for the show.", "nice imax show and the place is beautiful.", " Famous for tis &quot;globe like&quot; IMAX teather, this cultural center has a very nice areas. I was here to visit an international congress of entrepreneaurs. And before that I ente to watch an IMAX movie.", " Famous for tis &quot;globe like&quot; IMAX teather, this cultural center has a very nice areas. I was here to visit an international congress of entrepreneaurs.", " wednesdays there are group readings, you can sign up on facebook and find out what anthropologist is coming to town. the museum costs, and so do the IMAX movies.", " I was pleasantly surprised by the amount to activities and functions going on. We visited the IMAX theather and the museum. We would like to come back for the opera.", " wether it been taking the kids to an amazingly produced play, browsing the current artist in residence expo or taking a casual guitar class taught by a prodigious 13 year old, this place has everything you need for a fun and relaxing cultural outing - don't miss out the constant influx of jazz events, regional performances, IMAX experiences and stand up!", " This place made our Tijuana visit really memorable. The history of northern Baja inside is fascinating, the IMAX theater is excellent, and we even saw the Grammy-nominated Baja Orchestra play in the new orchestra hall, which has excellent acoustics.", " This casino has lower table minimums then the other Casino Caliente further down on Avenida Revolucion about ten minutes walk. Its also smaller and less nicer than the other one of Avenida Revolucion. The best of the Casino Calientes is the one closest to the border connected to the hotel Plaza Pueblo. Here they only had a few tables as well just like their sister casino on Avenida Revolucion.", " El Trompo is an interactive science museum for children, but adults can enjoy their time there as well.", " This is an interactive science museum for kids. It has several floors and theater.", "It is very close from the Mexico-US border.", " You can either drive across the border or park your car right outside the border and walk across.", " This is a wonderful tourist spot just across the border from San Ysidro, CA. You can either drive across the border or park your car right outside the border and walk across.", " We were there on a Wednesday afternoon in May after taking the Blue Line trolley from downtown San Diego to San Ysidro (next to the Mexican border). After exiting the building follow the signage to get to Revolution Avenue. It will be about a 1 mile (1.6 kilometer) walk to the Tijuana Arch landmark and Avenida Revolución. If you get lost, use this landmark to get your bearings. Avenida Revolución is maybe a 6 – 7 block stretch where the “action” is. If you’ve been to Playa del Carmen, it is somewhat similar in some respects – lots of souvenir stores and restaurants. On the Avenida Revolución there are also a few pharmacies selling cheap drugs. If you like souvenir shopping, this maybe the place for you. I would rate the experience at 3.25 out of 5 rating – above average. Notes &amp; Tips\n    • The restaurant that is said to have invented the Caesar Salad is on Avenida Revolución\n    • Check out the “zebras” on Avenida Revolución and take a photo with one for a fee\n    • We had lunch at El Gallo (in Tijuana), at the Santiago Arguello outdoor mall across from  the McDonald's. Santiago Arguello “runs” right into Avenida Revolución by the Tijuana Arch. This “mall” consists of a lot of restaurants, souvenir vendors and other businesses. • If you have mobility issues and can’t walk more than 4 miles - walking to and from the border and walking down Revolution Avenue, I would suggest taking a taxi or alternate transportation once you cross the border. The washroom facilities in the building that houses McDonald’s is a pay facility. • Check various websites for additional information\n    • After our trip to Tijuana, we went to Las Americas shopping outlet in San Ysidro. Just take the overpass and once you reach the sidewalk on the other side, walk maybe a 1/4 mile to the intersection and you will see the shopping outlet.", " Once you get off the trolley, you will see the McDonald’s and the pathway to the Mexican border. This “mall” consists of a lot of restaurants, souvenir vendors and other businesses.", " We wanted to do the border crossing on foot, and did which was cool, and did the walk from the border to Avenida. We were surprised how undeveloped the walk was from the border to the Ave.  Once we got there, we were surprised that it was only 3 or 4 streets and not very long, not many shopping options or things to do. We ended up grabbing lunch, doing a little shopping and heading back to the San Diego area--not staying nearly as long as we anticipated", " We wanted to do the border crossing on foot, and did which was cool, and did the walk from the border to Avenida. We were surprised how undeveloped the walk was from the border to the Ave.  Once we got there, we were surprised that it was only 3 or 4 streets and not very long, not many shopping options or things to do.", " We are a family of 5- husband, wife and 3 boys- 1 late teen and 2 early elementary. We spent a week plus in San Diego and we parents had fond memories of visiting Avenida Revolution as early teens with our respective families. Our taxi driver tried to discourage us from going there saying it is nothing like it once was and he was right. We did walk down a cross street to the Cathedral which was pretty and the shops along the way were far more interesting. We also walked to a local modern mall and the Cultural Center. Sadly, we didn't have time to enjoy the Cultural Center, but wish we had. Enjoyed our lunch in a café across from the mall and walked back to the border.", " We spent a week plus in San Diego and we parents had fond memories of visiting Avenida Revolution as early teens with our respective families. Sadly, we didn't have time to enjoy the Cultural Center, but wish we had. Enjoyed our lunch in a café across from the mall and walked back to the border.", " Sadly, we didn't have time to enjoy the Cultural Center, but wish we had. Enjoyed our lunch in a café across from the mall and walked back to the border.", " I went to Tijuana, for &quot;shopping&quot; on Avenida de la Revolucion last time in 2000. Going to Tijuana by foot was easy, you just walk over the border and catch a taxi that brings you to Avenida Revolucion.", " The happening street in TJ is Avenida Revolucion which is approx. Crossing the border into TJ is fast, but be prepared for a wait upon your return as you will have to go through customs, and don't forget your passport or passport card! Some fun, but free or cheap activities in TJ are as follows: You can enjoy the sound of Mariachis which will make you feel that you are truly in a foreign country even though you may live just a few miles from the border!", " We crossed the border and walked to the Avenida Revolution. The wait at the border was anywhere from 1 1/2 to 3 hours.", " Avenida Revolucion is the main tourist shopping street of Tijuana.", "I loved the stores at Avenida Revolucion.", " We parked in San Ysidro and walked over the border. We then had to wait in line at the border for two and a half hours just to walk back across to the USA.", " We had a very fun day in Tijuana. The city is very safe at least by day we could see police officers all around. For food i recommend you hop in a taxi and go for the newer parts of Tijuana like Zona Rio where you can find extremely good food at very nice restaurants and they even have an IMAX at their cultural center and a great mall called Plaza Rio with a very elegant cinema where I got to watch &quot;the hangover&quot; while only paying 45 pesos which is about 3.50 in this great big air conditioned room that had big leather seats!", " For food i recommend you hop in a taxi and go for the newer parts of Tijuana like Zona Rio where you can find extremely good food at very nice restaurants and they even have an IMAX at their cultural center and a great mall called Plaza Rio with a very elegant cinema where I got to watch &quot;the hangover&quot; while only paying 45 pesos which is about 3.50 in this great big air conditioned room that had big leather seats!", " The only negative thing i can say is that the vendors are do not leave you alone and try to get you to buy something even if you say no thank you. For food i recommend you hop in a taxi and go for the newer parts of Tijuana like Zona Rio where you can find extremely good food at very nice restaurants and they even have an IMAX at their cultural center and a great mall called Plaza Rio with a very elegant cinema where I got to watch &quot;the hangover&quot; while only paying 45 pesos which is about 3.50 in this great big air conditioned room that had big leather seats!", " We started in Avenida Revolucion where you can find amazing Mexican Hand Made goods at great prices. For food i recommend you hop in a taxi and go for the newer parts of Tijuana like Zona Rio where you can find extremely good food at very nice restaurants and they even have an IMAX at their cultural center and a great mall called Plaza Rio with a very elegant cinema where I got to watch &quot;the hangover&quot; while only paying 45 pesos which is about 3.50 in this great big air conditioned room that had big leather seats! WOW"], "hermosillo": [" Is a medium size mall, however it has everything you might want, restaurants, kids places, even movie theater. Stores and boutiques, it was recently expanded adding new brands.", "Nice mall that has everything you want from movie theater to food.", "It has what a mall has, nothing extraordinary, nothing horrible, just shops, food and a movie theater.", " This is a typical mall. Nothing interesting. It has the regular stores you find in a mall including food.", " This is, in my opinion, the nieces shopping mall in Hermosillo. And it's all near the beautiful MUSAS art museum.", " It's just a small mall with some well-known boutiques but not much else, it doesn't even have much variety, but since it's like the only mall here, then it may be the only place with what some need.", "Great location, variety of shops, Sears, movie theater and food court in an upscale mall.", " I am including it only because TripAdvisor is listing this little mall as something worthy of your attention. If you have been to a mall in the US, then you've already experienced what Galerias Mall has to offer. And the small array of stores offer things you would find in the US for roughly twice the price.", " If you have been to a mall in the US, then you've already experienced what Galerias Mall has to offer. Except, it is much smaller.", " My review is written for foreigners that might be visiting Hermosillo. I am including it only because TripAdvisor is listing this little mall as something worthy of your attention. If you have been to a mall in the US, then you've already experienced what Galerias Mall has to offer. Listing this mall as a 'thing to do' would parallel listing a gas station in the US for Mexicans to visit.", " If you have been to a mall in the US, then you've already experienced what Galerias Mall has to offer. And the small array of stores offer things you would find in the US for roughly twice the price. Listing this mall as a 'thing to do' would parallel listing a gas station in the US for Mexicans to visit."], "cancun": [" I love an outdoor mall and this one on the lagoon is beautiful! I haven’t shopped here much as we usually come for food and drink. I miss the theater that was here but otherwise it’s a good spot.", " This is a great outdoor mall in Cancun. Movies theatre, department stores, locanfood kiosks, international restaurants, you name it.", " This is a great outdoor mall in Cancun. It has everything from big name retailers to small local stores. Movies theatre, department stores, locanfood kiosks, international restaurants, you name it.", "Is a very nice mall aside of cancun lagoon.", "We had been here before, so wanted to again visit this mall to do some shopping .", "Great mall with lots of shops.", "Loved this out door mall.", " Very beautiful shopping mall close to the hotels. They have all your usual stores you would expect to find in the malls back home!", "Terrific open air mall with lots of shops and restaurants.", " This is a high end mall with lots of shops selling expensive and over priced items. It has a very strange layout that does not lend itself to easily find shops. Overall this was a high end mall that had lot of items that really were not things we would be looking for.", "Enjoy going to this outdoor mall with a variety of department stores, smaller shops, restaurants, and amusement attractions.", " If you need to take a break from the pool or beach this is nice to take a walk I guess. It’s still really hot and the mall is just like any mall in the US nothing special.", "A lot of stores and restaurants.", "Very nice shopping area.", "The mall and activities were great.", " It’s basically a shopping mall whatever you can find at a mall it’s there. We went to Mercado 28 and Downtown 28 instead and I loved it there better for souvenirs and authentic flea market experience.", "Nice outdoor mall but if you're looking for a bargain forget it very expensive nice and clean a lot of stores places to eat very clean but if you're looking for a bargain you need to leave out of the tourist area it's in the heart of the Hotel Zone", " Nice Mall but wasn’t interesting in shopping but good friendly atmosphere around it with some nice places to grab a bite with nice vue over the sea", "Very nice place for shopping, eating or just having a good time... an excellent variety of restaurants to eat, good coffee shops, and you can find almost anything in this mall, nice familiar ambience!", " There is lots of parking at this mall. There are restaurants and an Aquarium also, in the mall.", "Great outdoor mall, designer stores, excellent customer service and some excellent restaurants.", "I want to the mall is section hi end and all brand names it’s very nice the have section that reg stores nice restaurants", "Lots of good restaurants, bars and shopping.", " I would not have stopped at this mall based on it's looks but our friends told us it was an open air mall with a bunch of restaurants on the lagoon with sunset views, it was a nice stop.", " I would not have stopped at this mall based on it's looks but our friends told us it was an open air mall with a bunch of restaurants on the lagoon with sunset views, it was a nice stop. It even has an aquarium and ferris wheel", " Cinema also in mall with English movies. Ferris wheel outside mall.", "An excellent space for all family: good stores and excellent food for every one!", " Nice mall, would suggest more variety of stores. Looks like they are adding on to this mall.", " I’m not a big shopper but I do find this mall a great option if looking for a little diversion or some decent restaurant options. We have stayed at the westin Lagunamar a few times and one of the draws is the convenience to la isla. We did visit last year and went into several of the larger stores looking for a prom dress but I did not find those stores quite as good for what I like.", " I’m not a big shopper but I do find this mall a great option if looking for a little diversion or some decent restaurant options. There are a few shops my teenage daughter always likes to hit - Roxy, Hurley, UnderArmour, Birkenstock. We did visit last year and went into several of the larger stores looking for a prom dress but I did not find those stores quite as good for what I like. I actually haven’t been to either here (there are so many better options and my daughter is a pescatarian) but I know sometimes with teens or kids you just need that food from home.", "Great mall in Cancun.", " My husband and I enjoyed a fun time at this open air mall. We were staying at a resort right across the street from the mall so it was very convenient.", " My husband and I enjoyed a fun time at this open air mall. My husband and I had a delicious Mexican lunch and we had a coupon for free drinks. Our waiter even balanced our drinks on his head. Our lunch was great. We were staying at a resort right across the street from the mall so it was very convenient.", "If you are in Cancun you most go to this lovely mall and buy you self and love one an ice cream cone.", " This mall is pretty complete. If you want to tour the whole mall give yourself 3 to 4 hours.", " My hotel was directly across the mall and shopping village which made it very convenient. On a prior stay in Cancun, my hotel was much further away so used taxi.", "Nice place to walk , shopping, eat .", " Really good fun, great shopping spot, great for buying souvenirs etc, good location. This place is growing and there is a huge building site next to it, it will be a huge shopping mall in about 12 mths.", "This is a open air mall on the water where I feel very safe.", "Relaxing and wonderful mall.", " What to say? It is a mall with the standard franchise stores and some souvenir shops. It is however located by the water which is nice.", "Beautiful Shopping area and very clean.", "Good clean mall with not as many “touristy souvenir “ shops.", " This was somewhat disappointing for an upscale shopping mall. The Mexican restaurant I dined at was probably the worst meal I had in an 18 day trip throughout México.", " The bus driver was very helpful telling us when to get off the bus. It is an outdoor mall, so we did take our umbrella. A lot of high end stores. Plenty of food options, but we did not eat there, as we had dinner reservations. Fun to people watch, also. Felt very safe the entire time.", " Road the bus to La Isla Mall. The bus driver was very helpful telling us when to get off the bus. It is an outdoor mall, so we did take our umbrella. Felt very safe the entire time.", "This is a wonderful outdoor mall (with many covered areas) to spend an afternoon.", "Great stores, activities and restaurants.", " Welcome to USA mall at higher than USA prices !", "If you are shopping for regular brand name or luxury brands, this is the mall for you.", " The shopping mall is highly secure with cops and armed securities... the mall has a good mix of high end shops and others.", " We took a bus from our hotel (Hampton Inn) to the Plaza las Americas mall. From here, we took the R-27 bus to the stop outside the La Isla mall. We spent a few hours exploring the shops, then walked a few kms to the public beach. A perfect day trip! We finished of the day with a lovely dinner at the mall; we ate at a mexican restaurant on the water and enjoyed the sunset.", " We took a bus from our hotel (Hampton Inn) to the Plaza las Americas mall. From here, we took the R-27 bus to the stop outside the La Isla mall. We finished of the day with a lovely dinner at the mall; we ate at a mexican restaurant on the water and enjoyed the sunset.", " La Isla is a clean, safe, fun to walk outdoor mall. Very good food and service for an okay price. Easy taxi and bus drop off and pick up.", " If you're looking for an American mall in Mexico, this is it.", "It’s really worth it to take some hours and go shopping here.", "Lots of stores and restaurants.", "This open air mall is nice to visit with nice stores.", " Was looking for a place to shop in Cancun,  I recommend to check out this mall as it has high brands and also most of the other brands like Zara etc.nice open air mall with a small closed area .check it out", " the most exclusive shopping mall I've seen in Cancun. has it all: stores, aquarium, great restaurants and even a wax museum.", "Great shopping area with lots of different food options!!", "Great outdoor mall, great stores and restaurants!", " The Shopping mall is more of an open space where you can find typically north american stores such as Kate Spade, Prada, etc with a few Mexican stores selling t-shirts , candies catered to an elite audience. Overall, the place is quite commercial , but worth visiting once. It can easily be reached using R1 or R2 buses roving up and down the hotel zone area.", " The La Isla mall was across the road from the property we were staying in and provided a very pleasant place to spend an evening having dinner and looking at the many interesting shopping options. There were numerous eating place, I can definitely recommend the Argentinian steak house where we had a delicious meal. We also are twice st the Italian restaurant and can also recommend this place as well.", " The La Isla mall was across the road from the property we were staying in and provided a very pleasant place to spend an evening having dinner and looking at the many interesting shopping options. La Isla mall is definitely worth a visit and the local bus stops right outside!", "Great place for shopping.", "Not a very exciting mall.. quite nice sunset view from the dock.", " Stopped by here to spend couple hours checking out the shops before dinner. Let me just say the mall was built for tourists and tourists only. The mall is composed of small islands that are connected via bridges, and the bridges only have stairs.", " Generally prices were more expensive than in the uk but it was nice to look around there was a mini Venice type canal in the mall. There are loads of shops in the mall from high end to high street.", " This is an open mall. You need to walk a bit but the river cross the mall and at the end facing the lake there are some fountains.", "Beautiful shopping mall on the lagoon.", "It is a lovely shopping mall full of shops and restaurants.", " Outdoor Mall with lots of shopping options. Check out the Aquarium or the water sports.", " I came to this mall for a morning out of the sun and gift shopping. When I first entered the mall I was approached by 3 men selling tours. I said no thank you and continued walking, and they started following me! They said, loudly, &quot;Senorita, you must stop and talk to us&quot;, as if I wasn't allowed to enter the mall until I'd talked with them. When I continued walking they said &quot;Senorita you dropped something&quot;. I was used to people trying to sell me things, and in stores I was used to people following me around, but these men were way over the top. Honestly, if I hadn't been in a brightly lit mall with plenty of people, I would have been really scared. It felt like these men might have physically forced me to stop if the environment was different. This put a damper on my experience with the mall. I did have a lovely lunch at a restaurant on the water, and watched water skiing and other water sports, but by then I was more interested in getting out without running in to these men again. I left via a different entrance and decided to pay for a cab, even though I'd been taking the bus all week, because I still felt very unsafe. Even if I hadn't felt accosted I still would not highly recommend this mall.", " I came to this mall for a morning out of the sun and gift shopping. There were kiosks throughout the mall, most offering day trips (these are found all over the Island-total overkill). When I first entered the mall I was approached by 3 men selling tours. They said, loudly, &quot;Senorita, you must stop and talk to us&quot;, as if I wasn't allowed to enter the mall until I'd talked with them. This put a damper on my experience with the mall. It's like any other mall and had nothing new to offer than can be found all over the island.", "Like the title says if you’re an American there really is no need to visit this place as it is basically a shopping mall that can be found in any city in the USA.", "Very nice mall.", "Beautiful high-end mall with an aquarium worth a visit there.", "This is a large shopping mall that has a very nice mix of shops and restaurants.", " I went to two malls both a few blocks from each other. The mall had a heavy army presence with machine guns. One mall had luxury high-end brands and other was more like an outlet. The stores were decent.", " It’s a beautiful mall/shopping village right on the strip, one of the best I’ve seen. It feels like you’re in a shopping mall in the US.", " Stopped by this mall on my trip to Cancun with my boyfriend. It’s a beautiful mall/shopping village right on the strip, one of the best I’ve seen. It’s great to walk around and take in the scenery but the prices for things here are pretty expensive (expected in a tourist attraction in Cancun). Some of the stores here as well sold some clothing among other things more expensive then you’d find them in the US, when I calculated the currency exchange.", " It feels like you’re in a shopping mall in the US. Some of the stores here as well sold some clothing among other things more expensive then you’d find them in the US, when I calculated the currency exchange.", " Stopped by this mall on my trip to Cancun with my boyfriend. It was also pretty annoying getting through the entrance of the mall without being harassed about timeshares or excursions that are being offered, and the people working there are pretty persistent even if you try to ignore them and walk away.", " Stopped by this mall on my trip to Cancun with my boyfriend. It’s a beautiful mall/shopping village right on the strip, one of the best I’ve seen. It’s great to walk around and take in the scenery but the prices for things here are pretty expensive (expected in a tourist attraction in Cancun).", " The Isla mall is a great choice very conveniently located just on hotel zone of Cancun. There’s an aquarium inside the mall as well as host of many restaurants.", " A new feature at the mall now is a hugh Ferris wheel, it stands out in the skyline. The mall is a mix of dolphin event, restaurants, low end and high end shops. Lots of souvenir stores. It's an ok place to wander, shop or have a meal.", " This was a great place to shop for the wife and myself there are lots of different shops to choose from and there is plenty to see and enjoy we took a ride on the Ferris Wheel just outside this mall and the view from the top was awesome plenty of authentic shops to go with the more upscale shops the aquarium was fun and all the folks we met were very friendly and helpful we will return to this mall again next year", " They have a little bit of everything from High end to low end stores. It's an outside mall so it can be very hot.", " This mall might be very close to your Resort where you plan on staying. It's easy to get here as any bus that passes by your Resort will stop across the street or in front of the door of this mall.", " This mall might be very close to your Resort where you plan on staying. The mall is open-air so its best to visit this mall when its not too hot out and certainly not on a rainy day.", "I love La Isla Shopping mall.", "It's a great mall with a few photo spots\n\nYou can find all kind of restaurants, there are also some of them where you can see the lagoon.", "nice huge open mall .", "The shopping mall has a lot of brand name stores, variety restaurant and souvenir shops.", "Lots of shopping options.", " This large mall in the middle of the hotel zone offers a wide variety of restaurants, souvenir shops as well as convenience/drug stores and high-end fashion. The mall is also expanding and should have nearly twice the selection when finished. Currently, it lacks a much needed grocery store.", " La Isla shoping mall was great lots of stores lots of good resturants and store that sell local merchandise. They also have family activities for adults and young children.", " Outdoor shopping mall with lots of different shops. Possibility for money exchange and tour booking.", "La plaza is a great place to go Shopping, walking; go to the acuarium and; go to have lunch or dinner; is an outdoor mall.", " Very big mall... what ever you want to buy you will find it, an huge variety of shops also it have prestige shops like Gucci LV Rolex D&amp;G also it have small shops for sevonere the restaurants have a nice see side reply enjoyed", " This shopping mall has nothing special. The area is huge, lots of entertainments for children.", " We visited Cancun on Aug 12th, 2018 and visited this mall a few days later. Thought it was an indoor mall as the sun is extremely hot. Turned out that it was an outdoor mall, however, there is enough shade that yiu don’t really feel the heat.", " We visited Cancun on Aug 12th, 2018 and visited this mall a few days later. Turned out that it was an outdoor mall, however, there is enough shade that yiu don’t really feel the heat. It’s great for souvenir shopping as the prices in the stores there are most times cheaper than the regular tourist traps markets. Also have some nice places for dining. Would certainly recommend a boat when you are on the hotel strip.", " This mall is fantastic. I've always enjoyed the malls in open spaces. The first time we went to this mall, my family and I ate in a Chili's restaurant that is located besides a channel.", " The Bad :\nThe only not-so-good part of this place is that restaurants don’t have their own restrooms. You have to use the general restrooms in the mall.", "We love shopping here.", " The Mall was very well kept. I received my first henna tattoo at the Mall.", " La Isla is a shopping mall close to the hotels line. The mall is open ( no roof ), so it’s good to visit at night.", " La Isla is a shopping mall close to the hotels line. Its got everything.", " The mall has nice shops, some of the upscale, ok restaurants and the aquarium; it’s open space so not recommended for a rainy day", " They have many stores and restaurants. My boyfriend and I stopped here a couple times during our stay. I did do a little shopping here and it's a place I recommend going to.", " Great big shopping mall we did visit but got no bargains quite expensive. Nice to walk around we visited hooters for lunch.", " On this outside mall You can find a lot of luxury brands.... but the prices in thesw shops are too too high.... The best is shopping in their mexican brands shops,not luxury shops from EU and US..", "This great place to go shopping.", "Nice shopping area.", " We had a wonderful experience at La Isla. Although it was hot, the mall has a lot of stores to offer.", " The La Isla Shopping Village is one of the best shopping mall in Cancun. My wife and I, really enjoyed the environment, primarily the brands of merchandises.", "Great stores amazing prices.", "If you have teens and love the higher end of life you have to go to this mall.", " Recommended by some friends so we checked it out. It is a nice mall with lots of shopping, good restaurants, and we took of kids to the aquarium. We enjoyed and it was a break from the hotel vibe and hotel good. We were at The JW and it was a 5-min can ride.", " Went to La Isla Mall to look for some accesories for our camera and was able to find everything we needed.", "Great outdoor mall.", " This mall was walking distance from my resort Melody Maker (previously Me By Melia). This mall has a lot of stores in offers souvenir shops and restaurants. I was able to find affordable souvenirs at a little shop. It is set up like outlet mall and it is much bigger than it looks from the outside.", " This mall was walking distance from my resort Melody Maker (previously Me By Melia). This mall has a lot of stores in offers souvenir shops and restaurants. I was able to find affordable souvenirs at a little shop.", " Isla is one of the 3 main shopping centers in the hotel zone in Cancun. It also houses an aquarium, restaurants and movie theater   If you are looking to kill a few hours shopping this is the place to do it", " If you are not close by the bus is only 1 dollar and it drops you off right at the mall. This has a wide selection of stores and have a few specialty store.", " If you are not close by the bus is only 1 dollar and it drops you off right at the mall.", " This mall was within walking distance of our hotel so we went here quite a few times. If you are not close by the bus is only 1 dollar and it drops you off right at the mall.", " This mall was within walking distance of our hotel so we went here quite a few times.", " It’s a USA mall, all of the same stores that you would find in the USA.", " If you are interested in shopping at stores you find in the U.S than this would be the spot to come. I would say they had decent prices throughout the mall but if you are looking for other things from Mexico besides souvenirs, then you have a better chance looking somewhere else.", " We love this open air mall,  we like going in the early evening and walking around since during the day the mall can be very warm.", " We love this open air mall,  we like going in the early evening and walking around since during the day the mall can be very warm. Our favorite place to go with the kids,  Johnny Rockets and aquarium\nmany beautiful restaurants for every taste and the clothing is mostly &quot;high end labels&quot;\nHave Fun!", "Beautiful shopping center with plenty of shops to visit, high end stores also enough stores to shop that are reasonably priced .", " it's a nice shopping mall with lots of brand stores but it's a little bit hot when you go around as it's open and not a lot of shade and also not all the stores have air condition\nbut if you want a break from the beaches it's a nice place to do shoppinf and it's not far from the hotels zone.", " As frequent visitors to Cancun,  my husband and I took our extended family with several teenagers to La Isla Shopping Center, as we have always had great times there. Our Family really enjoyed themselves, as there are high end stores, regular stores, souvenir stores, attractions, and plenty of food choices.", " The atmosphere is fun so it make s it not like just going to the mall.", " It’s very touristy so it’s very expensive shopping. We stayed at the Hyatt Zilara and it was a short 15 min walk to the mall.", "Lots of variety of stores!!", "A fairly small, friendly shopping mall, very well set up for tourists, close by a waterfront with restaurants, bars, etc.", " This is an upscale shopping mall. It is very pleasant, but certainly not cultural, as many of the shops and restaurants are large chains.", " We took our 16 year old nephew around this mall. We had a good time looking around the shops.", " I don&quot;t how this mall makes money. There were very nice and fancy stories but clothes I guess were more conmected with the Mexican dress/style", " They have Cinemax (?) They have everything. They are working out one big giant wheel right outside the mall.", " They are working out one big giant wheel right outside the mall. This mall is right in the hotel zone, any R1-R2 or any bus passing through you, ll get you to this mall. If you are in Cancun, come here for a night.", " So, what you are in Cancun, you can have best of shopping experience here and La-Isla is the place.", " So, what you are in Cancun, you can have best of shopping experience here and La-Isla is the place. This is not closed shopping mall, in fact it has themed like Venice canals, not sure boat is there or not. It was rainy day (Memorial Day weekend 2018) and we were here to dine out in THAI. But after seeing this, decided to roam around. They have Cinemax (?) This mall is right in the hotel zone, any R1-R2 or any bus passing through you, ll get you to this mall. If you are in Cancun, come here for a night.", " The mall is super cute. Not a flea market but an actual mall just that it is outdoors. Walk a little further down the boulevard and you will find the luxury stores like Gucci, Ferragamo, Louis Vuitton, etc.", " This mall is great if you are wanting to get off of the beach for a few hours and do a little shopping. There is a phenomenal Thai restaurant in the mall, it's definitely worth a walk through if you are looking for a place to eat one night.", "Anything you may have forgotten to bring can be purchased at this mall.", " We stopped in on a rainy day. We are not mall shoppers. For that matter, we are not into shopping.", " Next day decided to go to the movies, the air conditioner was not working in the movie theater but it had been raining so it was ok.", " Very nice shopping mall, with good restaurants and every type of store imaginable. You don’t have vendors hawking at you like carnies at a fair here, unlike what you find at shopping centers farther up the road. We took the bus to la Isla from our resort.", "Very nice outdoor mall\nOn the lagoona \nAll the big names and brands are there\nNot affordable for Canadians though due to the exchange \nSame prices or less back home", " Nice place to see people from different places and styles. If you want to buy some expensive stuff, they have a fashion mall with stores like Prada, Louis Vuitton and other luxury stores.", " Last time, we spent time here in the movie theater with our kids (about 5 years ago) when it was raining. It was the best thing to do.", " It is the second time I visit Las Islas Shopping Village. If you want to buy some expensive stuff, they have a fashion mall with stores like Prada, Louis Vuitton and other luxury stores. I did not check prices since I live in the USA and have all these options there.", " There is a &quot; Mexican &quot; store in the mall but its; full of junk.", " This is a lovely mall, however I would skip it and go to one of the Mexican markets.", " There is a &quot; Mexican &quot; store in the mall but its; full of junk. Skip the mall, unless you need something you forgot and go to one of the Mexican markets.", " This is a lovely mall, however I would skip it and go to one of the Mexican markets. Skip the mall, unless you need something you forgot and go to one of the Mexican markets.", " Shops, restaurants, ambiance, vendors, currency exchange, movie theater, souvenirs, music and various attractions. I've been shopping when in Cancun. This was a nice treat that I'll have to revisit in November when I return.", "Nice and pleasant shopping center with a lot of stores and restaurants.", " We tried several of the restaurants in the mall. The mall appeared to have many higher end shops mixed in with junky souvenier shops. The mall has a huge ferris wheel directly in front of it, so you cannot miss it.", " We visited the mall, which was located directly across the street from the Westin Lagunamar, for the restaurants and not the shops. We tried several of the restaurants in the mall. If the restaurants had not been located in the mall area, we would not have visited.", "Very nice , clean shopping area.", " The La Isla shopping village has stores that you are have heard of before like Victoria Secret’s, Zara, Krispy Kreme, Subway, Hooters.. This mall also has high end stores like Gucci, Prada, Ferragamo, H. Stern jeweler, etc. We walked around the mall that closes at 10pm most nights and felt safe.", " Mall had lots of options and plenty of restaurants  to choose from, Italian, Mexican, bar type restaurants, McDonald’s,Hooters, Starbucks...It was mostly an outdoor mall. Walked there from hotel it was always busy and a nice place to walk for exercise.", " La isla is located in the hotel zone. Any bus going in the hotel can take you there. The mall is an outdoor mall with cover. There is a canal running through it.", "Very nice shopping mall with a variety of stores and shops.", " La Isla Mall was a great place to shop in a worry free environment! I would highly recommend shopping here while staying in the hotel zone of Cancun!", "High end stores with many places to eat and have several large nice stores that have a wide range of souvenirs.", " This was a great mall because it had a wide range of price points.", " It was enjoyable to walk around (except for the people trying to sell excursions everywhere) with some interesting stores along with some standard Canadian/American stores. We stayed at the Omni and took the R2 bus to this mall and back.", " This was a great mall because it had a wide range of price points. We stayed at the Omni and took the R2 bus to this mall and back.", " I researched all about the shopping in Cancun since the last time I was here, the Flamingo mall was NICE, lol. Anyway, I actually enjoyed the mall more than I thought and was able to haggle enought to walk away happy. You will find many known shops but some little trinket type places as well.", " No, it's not an authentic Mexican shopping market but it was a beautiful mall with pretty jewelry and clothes.", " I researched all about the shopping in Cancun since the last time I was here, the Flamingo mall was NICE, lol. Anyway, I actually enjoyed the mall more than I thought and was able to haggle enought to walk away happy. I liked it.", " I researched all about the shopping in Cancun since the last time I was here, the Flamingo mall was NICE, lol. Anyway, I actually enjoyed the mall more than I thought and was able to haggle enought to walk away happy.", "Great mall that continues to improve each year!", "A beautiful outdoor mall in the Hotel Zone.", " A bus ride is 12 pesos or you can pay $1 US dollar. You take the R1 or R2 (just make sure you have the direction correct). The mall is more of an American feel having many of the stores you would know.", "Teens enjoy this outdoor mall.", " We went to this shopping mall for a chill event. Can ride was cheap, about $8 from our hotel. Nice stores if you want to shop. We got a good deal on an excursion that we couldn’t pass up.", " The place is an outdoor shopping mall. The first thing we did was grab a ride on a pirate ship that goes around the mall and out to sea.", " The place is an outdoor shopping mall. Walked around with the family and everyone loved it. There are also a lot of luxury retailers as well. It was a quick trip by bus and just gorgeous to see.", " I really enjoyed this mall while staying at the Westin across the street. You will also be approached by others to buy excursions as you walk around the mall. Aside from that, there are several good restaurants in the mall, including good Mexican restaurants, good souvenir stores, gelato, and other specialty stores.", " The mall is upscale , you got your Gucci and Prada but you also have great shops like Roxy and  Mexican stores. I was 100 percent impressed with this mall!", "What a great mall, variety of shops and food for all.", " The mall offers a great variety of shops and restaurants. Many of the restaurants are near the water, so you can enjoy beautiful views while eating.", " La Isla is our favorite shopping area in Cancun. The mall offers a great variety of shops and restaurants.", "Love this mall .Has lots of regular mall stores plus souvenir shops lots of really good restaurants our favorite taco place was tequila tacos.", " We grabbed an R2 city bus from our hotel for $1 USD each and went to La Isla shopping mall for the afternoon.", " We always make sure to head to La Isla Mall when in Cancun. This was the first time we had a chance at the Harbour side where all the high end shops are.", " We always make sure to head to La Isla Mall when in Cancun. This was the first time we had a chance at the Harbour side where all the high end shops are. Definitely dont miss out if you have any interest in shopping, or just checking out something new.", "Modern, clean shopping mall with a mix of local and chain stores.", "Nice outdoor mall with high end stores with mix of other stores.", " This is a normal mall, there is not fantastic except the restaurant Thai which I visited and BIG SURPRISE, but the mall is worth a visit.", " La Isla is a big, impressive, chock-full of everything you might need and want mall including some high end and low end restaurants and stores and is packed with people all the time. Its a great place to grab a cab or catch a bus and directly across the street from a visitor’s center.", "You can find anything from top brands to local stuff in this shopping mall for all tastes.", " We went on a boat ride around the mall with people dressed as pirates and it was actually a really fun experience! It’s a big shopping centre, and looks really nice", "Mall is super clean and nice shops.", " I will continue to visit this mall when I am in town, but the variety of shopping offerings is truly lacking. It seems to be loaded with swimsuit shops. I get it, but do we really need that many? I walked away without spending any money and I don’t think that is what you want.", " Ive been coming to Cancun for about 13 years and always go to this mall! Its clean, people are friendly and its within walking distance of most things!", " Local mall in hotel zone of Cancun so easy to get to for shopping. Used to be outdoor mall with lots of little stores but is much bigger these days and has restaurants, shops and places to get souvenirs. Decent place to shop if that is what you are looking for.", "Nice shopping mall; a lot of the same stores that are in the U.S.", " I had a great time shopping there. You will enjoy it.", "This shopping mall has a lot to offer: top of the notch brand shops, delicious restaurants, and a wonderful view of the lagoon.", "Excellent mall.", "The mall is nice, centrally located on the perfect  for a little shopping (or strolling).", " It's really a huge mall mainly made for tourists. But it's a good place to go shopping if you're looking for named brand stuff or if you want to book an excursion for less than in the hotel.", " So we haven't been to La Isla much since I moved away from Cancun years ago and I must say they have done a great job of getting better shops and restaurants inside the mall. Def recommend for anyone who needs to get souvenirs or wants to do rainy day shopping.", " I got excited when we drove past this mall and saw the wide range of brands available but sadly was disappointed when we actually went to visit as the shops were a lot smaller and didn’t usually carry everything.. if you’re free and want to pass sometimes it’s not bad.. there are restaurants as well but we didn’t try anything", " Went to check out this mall while staying in the hotel zone. The mall itself is not bad, but nothing special either. It's a mall after all. It does have a playground, that does not charge anything, but encourages to leave a tip. The rest of the mall is good and has good restaurants.Go, walk around, and remember... don't talk to strangers.", "It is a clean, beautiful shopping mall.", " My wife and I wanted to do a little shopping, so we went to la isla mall. It was a 10 minute walk from the royal sands resort where we were staying. This is an exceptional mall.", " My wife and I wanted to do a little shopping, so we went to la isla mall.", " My wife and I wanted to do a little shopping, so we went to la isla mall. Food, clothing stores, high end as well as very reasonable stores too. There is also a canal that runs throughout the mall if you want to ride on a gondola for a fun experience. Recommend this for anyone that wants to shop and have fun doing it.", " My wife and I wanted to do a little shopping, so we went to la isla mall. It was a 10 minute walk from the royal sands resort where we were staying.", " An outdoor Mall with big name shops, worth a walk to, on a rainy day, but if you are working class, then keep your money in your pocket, and spend it down town, and it's not as big as some would have you believe.", " If you go further down the boulevard, a taxi or bus ride down...(walking distance for younger legs) there is an indoor mall, not very big, but more shopping. Anyhow the mall is quite popular and has lots of &quot;stuff&quot;...something to do when your off the beach or out of the pool.", " The mall is a modern complex with brand name stores. You need to work your way back to the area that borders on to the lagoon and have a nice lunch or beer at one of the many restaurants.", " The mall is huge with lots to do but very expensive recommend buying brand names in the US as here they are 20 or more bucks expensive. This mall has an aquarium a movie theater the lagoon runs in between and can rent paddle boats to to enjoy the visit. It has more than 10 restaurants and it is just amazing.", " This mall has an aquarium a movie theater the lagoon runs in between and can rent paddle boats to to enjoy the visit. The only downfall is that everyone is trying to sell you something anywhere you go but I still enjoyed the visit.", " The mall is huge with lots to do but very expensive recommend buying brand names in the US as here they are 20 or more bucks expensive.", "Beautiful and fun shopping and restaurants!", " This is not a Mall by any means but was fun for what I needed. I didn't come to shop so I'm quick in and done!", " Had a lot of fun...its an outdoor mall...even if you don't purchase it is a fun filled day...there is an aquarium there for a fee to enjoy as well.", " We went for souvenirs shopping at La Isla and found great things at  very reasonable prices. The outdoors mall also provides good selection of more luxurious brand where we went mostly window shopping.", "This is a great open air mall that's great for shopping in Cancun.", "such a beautiful and unique shopping experience.", "Nice mall has up scale stores and tourists stores a lot of different restaurants something for everyone", " At summer expect to fight the heat and moisture because it's an outside mall. There are movie theaters with a VIP section worth going into it and have some heat relief.", " Nice view on lagoon side of the water. Nice stores,restaurants,bars and movie theaters!", "Nice mall in Cancun.", " La Isla Shopping Village is more than just shopping it has several restaurants with a great lagoon view. I enjoy wondering around and seeing the sights and stopping for a cold drink with a great view :)\nI make a point to visit the mall on every trip to Cancun.", "If you are looking for the typical tourist focused mall, this is your place, easy to access mid strip, is provides many shopping and dining options", "Good shopping center for cancun area .", "A large mall with lots of shops, including what you need to bring home some Mexican souvenirs without having to haggle your way through.", " This center has very upper end stores, all the way down to souvie shops with loads of this and that! No matter what you are shopping for it will be here. Its worth the window shopping even if not buying.", " You have to be careful when Shopping because not all of the malls in Cancun take US currency. All of the stores at this mall take the US currency.", " The mall has a huge offering. All of the stores at this mall take the US currency.", " This mall has a nice selection of upper end stores. It could use a few stores like Gap or J Crew.", " It`s right on the hotel strip so you can take the bus and it drops you off right in front of the mall.", " Loved it! It`s right on the hotel strip so you can take the bus and it drops you off right in front of the mall.", " They have added lots of high end stores, but there are also regular stores, Mexican Shops, and restaurants. I make sure to go there every time I`m in Cancun.", " I love shopping so it was for me a place where I had a great time.", " The mall has a lot of shops to choose from and the prices of items was fair. The mall is also very easy to get to from the hotel zone.", " This shopping center is not different from anyone in the US. That mall is better organized and offers anything at the local price.", "This is a beautiful, ambient and seriously clean shopping mall.", " I recommend this mall to my parents too. I like it.", " I recommend this mall to my parents too. I like it. It’s an open mall with a lot of shopping:) nice weather and you good to go", " When I finally found the store, it didn't have much selection. It's an open air mall with stores ranging from expensive to reasonable.", " The shopping area has some good stores, that is true. On the south side, the stores are quite expensive. On the north side, the stores are more down to earth and affordable - like a normal mall.", " On the south side, the stores are quite expensive. On the north side, the stores are more down to earth and affordable - like a normal mall.", "Good mall with good food options but very expensive.", "La isla is such a beautiful shopping outdoor spot with many high end stores.", "We loved this mall.", "Great shopping!", " La Isla Shopping Village Cancun is home to the Interactive Aquarium, a movie theater, outstanding restaurants, coffee shops, upscale boutiques and souvenir shops. This is an open air mall and has a beautiful canal running through it.", " La Isla has the same shops every mall has, but wait, the sale. Technomarine buy 1 get one free.", "Nice, outdoor shopping center, many stores.", "A huge shopping mall.", "Beautiful place to go out for some shopping and if you want to have a nice dinner, a lot of restaurants and nice stores.", " My family visited the mall 3 times and really enjoyed it. We had breakfast, lunch and evening snacks in the mall over 3 days as there are many restaurants and eateries around. Also the mall is well designed so it's nice walking around.", " This mall is beautiful in all aspects! All the restaurants we’ve tried at the mall we’re very good, with friendly and attentive service, great selection (from Thai to Mexican) and reasonable prices.", " This mall is good to change the beach routine and spend some time shopping. They have all the most popular and luxury brands. Inside the mall is the aquarium", "That mall is beautiful, there are variety of stores, restaurants &amp; attractions the view to the lagoon is awesome is a nice place of Cancun we liked it too much!", "The mall is great place to spend some time.", " My main reason to go to the mall everyday was for coffee at Starbucks, not that I'm a fan of Starbucks but I do like a good consistent latte. So my morning walk  lead me here and although I did not do any shopping I found it a fun place to look around and we ate a few meals by the lagoon which were very nice.", " My main reason to go to the mall everyday was for coffee at Starbucks, not that I'm a fan of Starbucks but I do like a good consistent latte.", "Cute outdoor mall if you're bored and want to pay a lot more than at home.", " The Isla was a great place to go if you're looking for shopping for the typical shops and brand stores. It was big and a lot to look around and activities included.", " I visit this charming mall every time I come to Cancun! Very useful!", " I visit this charming mall every time I come to Cancun!", " Very nice shopping across the street from Live Aqua. La Isla offers restaurants, high end shopping boutiques,  department stores and coffee shops.", "Nice smaller mall with numerous good restaurants and shops.", " We all went on a family adventure to look thru the mall.", " Pros: The outdoor mall has numerous high end shops and stores with prices comparable to the US for those interested in some shopping. There were plenty of security personnel all around the mall so we felt very safe wandering around day or night.", " Pros: The outdoor mall has numerous high end shops and stores with prices comparable to the US for those interested in some shopping. Cons: Numerous vendors trying to sell you timeshares and trinkets.", "big variety of stores and restaurants.", " The La Isla mall is easy to miss if you spend all your time on the beach and in restaurants. But it is a fun break and an opportunity to do some shopping and walking. And because this mall is entirely outdoors, you are still enjoying the good weather.", " It’s very easy to get to as every bus goes by the mall. There is something for everyone and some high-end stores near the far end of the mall.", " The mall is clean and had a ton of great shops. The mall has a cool Nike store and nice restaurants.", "Great outdoor mall with great stores and restaurants.", " The place has nice stores and it has great atmosphere. It’s a shopping mall very modern.", "This is a open air mall on the water where I feel very safe.", " Nice mall nice restaurants. Nice to take a stroll if u need some clothes or last minute items.", "Normal mall but with good prices for tourists.", "Awesome mall with lots of amenities and shops.", " Looking directly at the mall from across the best hotel in cancun ( Westin Lagunamar ) you have the shops for almost everyone and at the back is the marina and 6 Restaurant choices. Amazing everything at this mall .", "Nice shopping mall with lots of selections to shop within.", " The mall is mostly open air so it is not a great shelter from the rain.", "Stayed in Cancun for 2 weeks, and visited the mall on a couple of occasions.", " It has everything from an Aquarium to a Wax Museum. It has numerous jewelry stores, a movie theater, a car rental, a convenience store, etc.", " You must visit La Isla Shopping Village. It is a chic, upscale waterfront mall which has something for everyone, It makes excellent use of the breathtaking natural surroundings to bring about a truly tropical experience to shopping. It has everything from an Aquarium to a Wax Museum. It has numerous jewelry stores, a movie theater, a car rental, a convenience store, etc.", "Nice outdoor shopping mall close to our hotel.", "Outdoor mall ....modern with lots of restaurants and quality shops .", " I have been to this outdoor mall, located at km 12.5, but my husband has not. The mall reminds me of Venice with the bridges over the meandering waterways through the shopping village.", " We are frequent visitors of La Isla mall as we stay at Live Aqua.", " We are frequent visitors of La Isla mall as we stay at Live Aqua. We always feel safe and the mall has a great variety of stores to get gifts or even designer name brands.", "This is very cool mall with a lot of nice restaurants and even an aquarium, right off the main avenue by all the great hotels and best beaches, there is canal running through the whole mall and that is quite pretty also, the sunset is really awesome by the restaurant area which is on the lagoon side, for those that like the really expensive name-brand stores there are lots of those also.", " We had a meander through this mall on our stay in Cancun.", " La Isla is hands down the best mall in the hotel zone. The have a variety of high end stores such as Louis Vuitton, Gucci, Prada, YSL just to name a few. We always go shopping here while in Cancun. Remember to bring your passport with you when shopping for duty-free and you’re going to need a credit card unless you want to exchange all your money into pesos.", "Variety of stores and restaurants.", " This is a very nice shopping. It has a more &quot;regular&quot; shops area while also having a premium area with the expensive brand stores.", " This mall is the biggest and best shopping experience in Cancun. From a nice souvenir, to premium brand clothing. It has state of the art facilities for great shopping and even has a Fashion section with the world’s best fashion brands.", " This mall is the biggest and best shopping experience in Cancun. A must while in Cancún.", " We visited La Isla Shopping mall, on a day where the weather wasn’t great, and the family did not want to stay by the pool. It’s in a nice location, It has very high end shops, with astronomical prices!", "Amazing place for shopping and walk.", " Beautiful Mall with High end stores, other well known stores like Forever 21, Harley Davidson, Oakley,  Wayans, and novelty shops galore! However,  there are many photo ops in the plaza! A must visit in Cancun hotel zone!", " We got the R1 or the R2 bus. We got the bus many times along the boulevard, we stopped off at La Isla shopping village a lot, we got off at Flamingo shopping mall, and another shopping mall not far from the fire station called Luxury Avenue.", " We got the R1 or the R2 bus. We got the bus many times along the boulevard, we stopped off at La Isla shopping village a lot, we got off at Flamingo shopping mall, and another shopping mall not far from the fire station called Luxury Avenue. It really was a tonic and one of the best laughs I had on our holiday.", "There are stores from moderate to high-end shopping.", "Great for shopping and having a a good time.", "You have to go shopping here.", "Very secure area lots of police around and lots of stores around with a wide variety of stores and restaurants.", " The Avenida is nice and clean, lots of shopping options, but if you are looking to authentic Mexican shopping this is NOT the place. Lots of Brand names Store.", " My family enjoyed walking from our resort down this boulevard. We found a Luxury Mall for some shopping. My daughter found her beloved McDonald's there, and ice cream shop and many different shops to choose from. We also found some great restaurants on the water side of that mall. We did our strolling and shopping during the day and had lunch there twice on our Cancun trip. We felt like everyone was friendly and we were safe and we did not notice anything alarming. Such a pleasant experience after hearing crazy, crazy stories before our trip. We loved Cancun!", " We found a Luxury Mall for some shopping. We did our strolling and shopping during the day and had lunch there twice on our Cancun trip. Such a pleasant experience after hearing crazy, crazy stories before our trip. We loved Cancun!", " We found a Luxury Mall for some shopping. My favorite shopping stroll was to an outdoor mall (I can't remember its name). We also found some great restaurants on the water side of that mall.", " My family enjoyed walking from our resort down this boulevard. We found a Luxury Mall for some shopping. My favorite shopping stroll was to an outdoor mall (I can't remember its name). My daughter found her beloved McDonald's there, and ice cream shop and many different shops to choose from.", "With shops, shopping mall and impressive hotels, it is enjoyable to go from one end to the other.", " Their are beautiful shopping areas and restaurants for those that are big spenders.", " EVERYTHING is basically on this road,,,it runs like from the airport-ish  to  the city of cancun,,,\n\nthe kukulkan luxery ave mall, tons of eating spots // la-isla mall,,,forum by the sea mall//hard rock  etc////at that point it turns and goes to the  REAL CANCUN!!!!", "This Mall was fascinating.", " This is a very upscale mall, with very nice stores in it. It has pricey name brand stores, but really has quite a few reasonably priced stores.", " I enjoy walking around this nice Mall and have a bite to eat in one of their Mexican small restaurants on the second floor. I love shopping for jewelry and Mexican goodies.", "Other than the Luxury Avenue at the very beginning of the mall, there wasn't much going on here.", "Great shopping!", "Plenty of restaurants, fancy mall, shops, entertainment.", "Love the stores at plaza Kukulkan.", " You don't need to pay a taxi cab to travel the avenue because there are buses which are very cheap and safe and run 24 hours the avenue is just two ways you can stop to eat or go the the mall to shop or catch a movie or to take a trip to Isla Mujeres because there is the Catamaran around the same area to take you there.", " It's quite safe to walk on Kukulkan Boulevard and the mall is beautiful. It has quite a few high end stores and prices can vary!", "excellent mall, courteous staff and a wide range of stores are available.", " The shops in the mall have something for everyone. The jewelry stores have amazing pieces in all price ranges. They have beautiful pearl jewelry.", " Our hotel was around Kilometer 11, so we were at the Plaza Flamingo/La Isla Mall area. There is one at La Isla Mall right across from the Liverpool store where police actually stop the traffic so you can cross.", " Luxury Mall and Kukulkan Plaza are great, safe shopping with free Wi-Fi. Ultrafemme in Luxury Mall has discounted major cosmetic brands and their own house brand. Toward the opposite end from Luxury is a wonderful shop with Mexican leather and handmade fashions. Bought souvenir playing cards for $5 that were $8 at the hotel shop. The better stores also give a duty rebate (about 7%) you can cash in at the air port if you use Visa or MasterCard.", " Luxury Mall and Kukulkan Plaza are great, safe shopping with free Wi-Fi. Bought souvenir playing cards for $5 that were $8 at the hotel shop.", "Nice place to spend some money, easy to find..at the afternoons is more calm than night.... Shopping La Isla is the best Mall....", " I really enjoy this out door shopping mall. If your luggage is missing this would be my only stop for clothing.", " Beautiful Kukulkan Mall...Luxary stores", " Avenida Kukulkan is quite long however most tourists focus and infatuate about the shopping. The stores are all the ones that you can find in the States in any large mall........... the prices equal to the ones at home too. What I recommend is finding those few typical Mexican restaurants (such as Destileria) and enjoy a different cuisine and culture!", " This is a nice mall if you want to get out of the sun and do some shopping. It is very clean and has a large variety of stores.", " I like the fact that it has tons of stores combined with US and mexican stores. I enjoyed shopping at Avenida Kukulkan.", " To all those new to Cancun here is where you will find all the tourist spots from hotels to mall, if you want something local take the bulevar until you hit downtown.", "Well air conditioned mall with good shopping, although the Isla shopping mall had a greater range of shops and restaurants.", "Nice indoor mall to get out of the heat.", "All the resorts and some stores and shopping malls are along this avenue.", "The mall had mostly high end stores/shops.", " We enjoy the La Isla Mall. It features the Aquarium and also many restaurants and stores.", " I have to admit that I like La Isla mall a bit more, but I can imagine in the really hot months this totally enclosed  mall is a great refuge. Great Tequilla store there, too.", " I have to admit that I like La Isla mall a bit more, but I can imagine in the really hot months this totally enclosed  mall is a great refuge. I felt like we were shopping in Paris. I know it isn't always the feeling you want from shopping in Mexico, but it is fun for something different for one evening.", " We came to the mall to look for shoes and we found many beautiful things!! We eat at the fast food área and everything was delicious!!", "very nice new mall they are still adding stores ,,,,nice food court and some very nice dining,,,,,,,there is a shuttle from the neares buts stop", " Puerto Cancun Marina Mall was completed a few months ago, has some very good stores including Best Buy (the only one in Cancun) a very nice food court with take out foods from many different parts of the world and a wine bar, a good place to come for shopping and have lunch, the sitting area is outdoors facing the water.", "A lot of cool stores.", "We went here to do a little shopping and had a great time!", " The mall is still under construction so bear in mind it is still new but worth watching.", " The Mall is one of the modern Malls in Mexico you must visit to see the effort they have made to improve the quality of life for the locals and the travellers.", " Went to view and shop. Suvenere shopping OK. Outdoor tiered mall with movie theater.", " It's part of a residential complex, so new that even the mall wasn't 100% fully occupied when we visited and they were still building high rises around it. There were numerous selfie spots peppered around the mall, the restrooms are plentiful and signage were easy to follow.", " I went to this mall and was blown away. When this mall is fully stocked it will rock. My wife and daughter loved Lefties. I got me 2 pairs of super hip fine Aldo quality leather shoes for 110 bucks.", " I went to this mall and was blown away. When this mall is fully stocked it will rock.", " There is a Starbucks, a new cinema with IMAX and a great food court with a wide selection of food and great views of the water. Bathrooms are a bit far from the food court.", " Was looking for a safe and clean place to eat and came across this place by accident, seeing all of the advertisements at the start of Blvd Kukulcan. Parking was free and there was a lot of uniformed private security guards walking around. There is a Starbucks, a new cinema with IMAX and a great food court with a wide selection of food and great views of the water. Bathrooms are a bit far from the food court.", " The mall is still being expanded but it is very nice.", " Our reason for going was to try out the new IMAX. It was great also!", " Cancun's newest and nicest shopping center; \nIt is now the home of Bershka, Devlin Optical, H&amp;M, Lefties, Plaza Mexico La Fiesta ,Prada, Pull &amp; Bear, Sephora, Springfield, Starbucks, Sfera, Sunglass Islands, Zara, Zara Home, Uterque among others ...\nMore stores to come with a great food court; from Sushi to Stakes and if movies are your thing, Cinepolis IMAX is also on site!", "It's really close to the Plaza caracol mall, and to hotel area.", "Inside mall close to the Fiesta Mall.", " We did visit this mall twice while on our vacation. It was the closest to our hotel.", "Old mall, just OK, nothing to be surprised about.", " Lots of the same touristy places...La Isla Mall is much better. What he does is simply amazing!", " They also have a Ferris Wheel and after your activities you can enjoy walking around the mall.", " Located at La Isla Mall, our 3-year old and 7-year old really liked the aquarium. It has some great exhibits, including an area where you can touch the rays and starfish.", " First.. it’s small aquarium, and the entrance fee it’s expensive .. you can go another place or you can walk in the mall it’s pretty.", "The aquarium is in a mall called la isla .It is very nice, but small than what I expected!", " This aquarium is in the la Lisa shopping mall. It's very small, nothing special.", " Fun aquarium within the beautiful La Isla plaza in Cancun. The mall is a great location for an evening or rainy day walk, lots to see and do.", " My wife and I were in the area shopping and decided to check out the aquarium which is also in the mall.", " This aquarium is located within La Isla mall. It makes for a nice visit and is ideal for a cloudy or rainy day .... or if you've had a power shopping day at the mall and want something different to do, you can easily drop by to walk through and enjoy.", " My son and I did this at the La Isla mall at the aquarium.", " It is located at La Isla mall so you can spend your whole day there between the aquarium, shopping, and eating and drinking at the tons of restaurants.", "In La isla mall close to hotels .", " Interesting place in the La Isla mall to take a break from shopping :)  Would be fun for kids (we didn't have any with us)", "Aquarium is in La Isla shopping mall.", " You could also pet sting rays! Definitely something to do if you are headed to that outside shopping mall for the day!", " It is situated at La Isla Mall (don't miss it).", " We took the bus to the mall. That part was easy. This place is small – I mean really small.", " This was in a mall down the street from the hotel.", " There were plenty of native handicraft and clothing which were more reasonably priced than at the La Isla Shopping Mall which was just across the Wewtin Lagunamar where we stayed. Took a taxi ( no meters in Cancun ) for 30'pesos to Walmart Station for bus back to the hotel.", " I was sad to see so few tourists at Mercado 28- but I know why. In the hotel zone, the concierges direct people to the Mall and deter them from Mercado 28. Its a real shame- the Mall is like any American mall, while this is like any outdoor market in any city in the world- like the Night Market in Hong Kong, or the Ubud Market in Bali- this is the typical block of booths with all sorts of arts and crafts, souvenirs, all the sort of thing they try to sell you in the hotel lobbies for 5 times the price. Its a great place to just walk around for an hour or two, and then go get some really authentic Mexican food in the center of the Mercado. Warning- like all markets, they are there to sell you stuff. Its the only place I went to in Cancun that actually felt like I was in a foreign country.", " In the hotel zone, the concierges direct people to the Mall and deter them from Mercado 28. Its a real shame- the Mall is like any American mall, while this is like any outdoor market in any city in the world- like the Night Market in Hong Kong, or the Ubud Market in Bali- this is the typical block of booths with all sorts of arts and crafts, souvenirs, all the sort of thing they try to sell you in the hotel lobbies for 5 times the price.", " This is the place to go for souveniers. It is an open air mall and the vendors are very enthusiastic about you coming into their shop to see what they have to offer.", " It is an open air mall and the vendors are very enthusiastic about you coming into their shop to see what they have to offer.", " This isn't a shopping mall, it's not a strip mall, it's not a WalMart nor is it even an American Flea Market. It's a Mexican Market!", " We didn't do a lot of shopping, but we did visit here.", " We ended up getting pretty lost on our way back to the bus stop to go back to the hotel zone and I have no idea where we were. The merchandise sold in the shops are honestly not that unique and you can find the exact same things at either Flamingo mall, the souvenir shop in La Isla Mall, or Coral Negro (a market much closer to the hotel zone where you could avoid getting lost in a foreign neighborhood).", " The La Isla Mall shops (Mexican Fiesta) would only sell them in USD and the cheapest price was 49.99USD. I saw the exact earrings in a jewellery store in La Isla Mall for 600pesos.", " My family and I went to this Market and it was a good experience however you must haggle with all the vendors because believe me that they are trying to rip you off!!! Basically if you take the first price cut it in half and then cut it in half again you may be around a reasonable deal. And the mall has a dolphin aquarium you can visit that is pretty nice. So unless your really looking for something specific La Isla mall was great, Market 28 was a great experience though", " And the mall has a dolphin aquarium you can visit that is pretty nice. So unless your really looking for something specific La Isla mall was great, Market 28 was a great experience though", " Go to the main mall in town and even mention a few shops that he recommended. Then we asked one of the staff Members at our hotel if it was safe he said, YES!", " very safe to get there from the hotel zone,get the r-2 bus,will leave you about  5 to 8 minutes away walking,i had gone to la isla mall a day before, and we found a lot of the same stuff for almost half the cost,we got a shirt for my son for $10 us at the mall,and the same shirt we got 2 for 1 at mercado,just use your bargaining skills(just tell them is your first stop,or that you will come back later and they will reduce the price dramatically) totally worth it,go ahead and good luck", " Soriana supermarket is inside the Kukulcan mall and of course you can later have dinner at this same mall if you feel like, but there are so many options around.", " Playa Marlin is right next to Plaza Kukulcan (mall). Soriana supermarket is inside the Kukulcan mall and of course you can later have dinner at this same mall if you feel like, but there are so many options around. Awesome view as in every beach in this paradise.", " We stayed at the Royal Cancun and there was a mall across the street. Most items at the mall already had price tags on them so it was harder to bargain, but at the market it was much easier without price tags.", " We visited the Las Plazas Outlet Mall because it was an outlet mall.", " I saw a few reviews commenting on prices  I am not sure if they went to the same outlet mall!, granted the stores arr not massive but the prices was a amazing. My advice spend most of the day there to soak up the food and the different shops , as there are definitely\nbargains to be had.", "Nice outlet mall with good prices and nice food.", " This is far from a real outlet mall... Options are very limited and there's nothing good except for under armour and Nike (which most times I've been to they never have anything interesting) I can't say prices are super cheap compared to the Regular stores..", " This is far from a real outlet mall... Options are very limited and there's nothing good except for under armour and Nike (which most times I've been to they never have anything interesting) I can't say prices are super cheap compared to the Regular stores.. Disappointing, I expected a lot more...", " The city mayor and government offices are on the same side as the mall.also some Casinos where they have buffet all you can eat lunch and dinners..super nice  drive to get the scope of Cancun.many buses go down that street..just tell the taxi to go to the Mall on Tulum..have fun..best mall and best street to really see the real Cancun....", " This street does run a long way and as you go North you run into some local shoe stores that have some good bargains. At the other end of the street, about 6 blocks From the downtown fountain there is a beautiful mall which can fill all your shopping needs.", "It is the best place to go shopping, is not a mall but a Main Street with stores all over and reasonable priced and you can bargain with the vendors, I love to bargain, most of the times you get your price.", "Good shopping, bars and food.", " First, go to the mall this place is located at. There are numerous stands throughout the mall where you can get a much better deal than if you buy at the ticket booth.", " My kids loved it. Great photos were sold to us after which were well worth it. Location was fabulous at the La Isla Mall area.", "Go here rather than dolphins in la Isla shopping Mall.", " The bus drops you back, but this is a pretry good mall La Isla, if you are missing something in your carry on, if you need something like a pair of sandals or something else this would be the place the get it. Prices match a US mall, so no savings unfortunately.."], "patzcuaro": ["Old convent turned into shopping mall for local artisans."], "tlaquepaque": [" Admission is almost free, and free one day a week. It is at the end of the main pedestrian mall in Guad and the whole mall including the Cathedral and the Degollado Theatre deserve a visit as you amble.", "Great shopping and restaurants.", "Great Shopping!"], "chihuahua": [" If coming from the hotels or fashion mall, you can take Av Politenicnico Nacional at the south end of the mall and follow it west, look for the Carl's Jr restaurant to know where to turn.", " If coming from the hotels or fashion mall, you can take Av Politenicnico Nacional at the south end of the mall and follow it west, look for the Carl's Jr restaurant to know where to turn. de la Juventud to be the easiest route. You should turn right onto Av. Prol Tecfilo Borurda and follow the avenue till it tells you to turn for La Salle University. The Family monument should be in front of you and you can park along the street.", " Presa El Rejon is a city park which has been made around a large reservoir about a half mile west of the Fashion Mall. The Parque has the La Salle University on the west bank and growing Chihuahua neighborhoods around the Fashion Mall on the east and south banks. de la Juventud near the Fashion Mall and near the intersection of Av.", " I was able to walk through the mall rather quickly. It is similar to any other mall so I would not say it is a must see, but it is a fun way to kill some time, and thin your wallet.", "It is a decent theater.", " During our trip to Chihuahua we spent several afternoons here at the Mall. This is by far the best shopping mall in the Chihuahua and it is about the size of a mid-level American mall in the United States, like Sunland Park Mall in El Paso, TX or Aventura Mall in the Miami area.", " The Ace Hardware store is more of a furniture and home décor store than the local hardware stores here in states. Sanborn is a high end, Mexican chain store which is part department store, newsstand and high end electronics shop. Sanborn also hosts a sit down restaurant with a good buffet which is a good place to grab lunch or dinner. A true joy and great value is the Cinepolis Movie theatre on the second floor. The Cinepolis houses 12 screens, 8 regular and 4 VIP. If you join the Club Cinepolis at the theatre for free, it enables you to see first run movies quite affordably. Matinees before 2:00pm are around $2 US. If you have 4 people in your party, you can use to card to get everyone in for only 100 pesos or about 6 dollars and 70 cents before 2pm. Here you will find Mc Donald's, Burger King, Subway, Dominos and several Mexican and Asian fast food places. I greatly enjoyed the ComicX restaurant, which is a hamburger restaurant styled on the characters from Marvel and DC Comic books and is similar to Planet Hollywood. You can also book your next flight out at the Interjet ticket office. There are also many Hair and beauty salons, nail shops and dress stores to entertain the ladies in your group. Here you will find the best selections of books in English and Spanish for the whole family. Please note that there is a 10 peso an hour fee for parking you car at the Fashion Mall which is payable at the kiosks near the main entrance. There is also bus service from the central/Downtown area of Chihuahua on the RC-02 Panamericana Mirador route which takes about 30 minutes to go to downtown. The bus costs 6 pesos one way and is the most cost effect way around town. If you are staying a one of the several Hotels next to the mall, Holiday Inn, Staybridge, Hampton Inn or Wingate, just walk over to the Mall which is less than a quarter mile.", " If you are staying a one of the several Hotels next to the mall, Holiday Inn, Staybridge, Hampton Inn or Wingate, just walk over to the Mall which is less than a quarter mile.", " During our trip to Chihuahua we spent several afternoons here at the Mall.", " This is by far the best shopping mall in the Chihuahua and it is about the size of a mid-level American mall in the United States, like Sunland Park Mall in El Paso, TX or Aventura Mall in the Miami area. There are four anchor stores which include Liverpool, Sears, Ace Hardware and Sanborn's. The Ace Hardware store is more of a furniture and home décor store than the local hardware stores here in states. Here you will find Mc Donald's, Burger King, Subway, Dominos and several Mexican and Asian fast food places.", " This is by far the best shopping mall in the Chihuahua and it is about the size of a mid-level American mall in the United States, like Sunland Park Mall in El Paso, TX or Aventura Mall in the Miami area. The Liverpool store is very much like a Macy's or high end Dillard's in the United States. The Sears store here has a much greater selection of inventory than in the US and is paired with Pier One to provide a better selection.", " The Mexican People love their ice cream and frozen yogurt shops. The mall has no less than 5 of these shops selling ice cream by the cone or ounce. For those seeking to buy or upgrade their cell phones, the mall, by far, has the best options in Chihuahua with a huge Tel-cel store, Moviestar and several others companies to choice from.", "Very new, clean mall with lots to see and do inside."], "puerto penasco": [" First of all, I hate shopping! This &quot;mall&quot; has enough variety to keep me interested.", " My wife and I are regular visitors to Cholla Mall.", " Most of the stores on &quot;Cholla Mall&quot; have the same items found in Old Port. However, there are a couple of stores with really nice handicrafts.", " The visit to Cholla Mall was fun with plenty of shops of all kinds. My friend and I felt very safe..the people are friendly. I found some very nice original art work which I didn't see in any other shops and we did plenty of shopping. One of the shops had some really good quality cotton clothes not as inexpensive as I thought they would be but again this was quality clothing .....none of the merchants were in your face pushy following you down the street trying to get you to buy things...yes that happens...Make sure to visit you will enjoy the variety ...not your typical shopping place.", "This street mall has just about any type of Mexican souvenir that you might want, all reasonable priced.", " Although the Trip Advisor locator map for Cholla Mall is hundreds of miles off (as are most of the Puerto Penasco attraction maps) this local &quot;Rodeo Drive&quot; tourist shopping center is very easy to find by turning west off Blvd. Benito Juarez (Hwy 8 into town) at the Avenida Revolucion traffic signal. Formerly Cholla Mall was a &quot;captive audience&quot; situation as all ATV traffic going to Cholla Bay or to the dunes and back was funneled through here. Business has dropped off in the last few years here but it should be improved in a couple weeks by completion of a new paved road that ties into Hotel Row better than in the past. Parking is around back of the &quot;storefronts&quot; and the shops are best inspected on foot. I recommend visiting Cholla Mall one time only, just to experience the dazzling merchandising effect it has. Frankly, the items sold are mostly low quality 'junque' and are typical of souvenirs gullible tourists might buy.", " I love the Cholla Mall. It is not a mall by any means. It is just a bunch of your typical Mexican curio shops on a street, but there are some great stores here. They have made some serious improvements to this area in the last decade, including awnings and a paved road.", "Lot's of good shopping and nice restaurants.", "OK for quick souvenirs but for nice mexican made items and better prices to the Chollo Mall.", "Go shopping each time i am here.", "Good shopping!", "Spend an afternoon shopping around the various stores.", "This is a nice area with lots of shopping and lots of bars and restaurants."]}